K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
    2020.02.13.01
      Enabling OPTION_WINKEY_PINCONFIG_PTT_CONTROLS_PTT_HOLD by default with YCCC SO2R Mini hardware profile while we continue to troubleshoot issue involving PTT line, SO2R Mini footswitch, and K1EL Winkey emulation PINCONFIG PTT bit 0

    2020.02.18.01
      Fix for YCCC SO2R Mini issue involving PTT line, SO2R Mini footswitch, and K1EL Winkey emulation PINCONFIG PTT bit 0 (Thanks, K1GC and JH5GHM)

    2020.02.18.02
      Corrected fix for YCCC SO2R Mini issue involving PTT line, SO2R Mini footswitch, and K1EL Winkey emulation PINCONFIG PTT bit 0 (Thanks, K1GC and JH5GHM)
      In K1EL Winkey emulation character echo is now sent after character CW is sent

    2020.03.06.01
      Merged pull request 92 - Fix button logic and add test https://github.com/k3ng/k3ng_cw_keyer/pull/92  (Thanks W6IPA)

    2020.03.07.01
      Added OPTION_WINKEY_PINCONFIG_PTT_CONTROLS_PTT_LINE - K1EL Winkeyer PTT setting activates/deactivates PTT line rather than controls buffered character PTT hold 
      TinyKeyer - OPTION_DISABLE_SERIAL_PORT_CHECKING_WHILE_SENDING_CW enabled by default for TinyKeyer (keyer_features_and_options_tinykeyer.h)

    2020.03.07.02
      Command Line Interface - Added \] to disable and enable PTT

    2020.03.07.03
      Fixed bug with \] and \U interaction (Thanks SV5FRI)
      Added \] to serial help  

    2020.03.08.01  
      Fixed another bug with \] and \U interaction (Thanks SV5FRI)

    2020.03.10.01
      Merged pull request 94 - HARDWARE_GENERIC_STM32F103C - Fixed error : call of overloaded 'noTone(<anonymous enum>)' is ambiguous (Thanks 7m4mon)  
      Merged pull request 93 - Option to disable ultimatic to save space (Thanks, W6IPA)

    2020.04.13.01
      Fixed compilation error when LCD display is enabled without FEATURE_MEMORIES (Thanks Nigel M0NDE)

    2020.04.14.01
      Support for FlashAsEEPROM (Thanks Phil M0VSE) 
  
    2020.04.14.02
      Support for FlashAsEEPROM, take two; ARDUINO_SAMD_VARIANT_COMPLIANCE support (Thanks Phil M0VSE) 

    2020.04.14.03
      Support for FlashAsEEPROM, take three; ARDUINO_SAMD_VARIANT_COMPLIANCE support (Thanks Phil M0VSE) 
      Added DEBUG_EEPROM_READ_SETTINGS

    2020.04.15.01
      Support for FlashAsEEPROM, take four; ARDUINO_SAMD_VARIANT_COMPLIANCE support (Thanks Phil M0VSE) 

    2020.04.21.01
      FEATURE_BEACON_SETTING
      Command Line Interface: \_ Command - Beacon Mode at Boot Up Enable / Disable (requires FEATURE_BEACON_SETTING)
      {Need to update wiki}

    2020.04.24.01
      Added to settings files: command_mode_acknowledgement_character 'E'

    2020.04.25.01
      -....- now echoes as dash "-"  (-...- is double dash / equals =)
      Added Command Mode command: -  Enable / disable PTT Line

    2020.04.26.01
      memory_area_end is now automagically calculated at runtime and is no longer in settings files  

    2020.05.27.01
      The Paddle Echo timing factor is now in eeprom and can be set with the \:pf ### extended CLI command ( https://github.com/k3ng/k3ng_cw_keyer/wiki/310-Feature:-Command-Line-Interface#cli-commands )
      Autospace now has a configurable timing factor which can be set with the \:af ### extended CLI command
      cw_echo_timing_factor setting has been deprecated and replaced with default_cw_echo_timing_factor
      default_autospace_timing_factor setting created
      memory_area_start is now automagically calculated
      FEATURE_COMMAND_MODE_ENHANCED_CMD_ACKNOWLEDGEMENT created which has customizable CW feedback messages for most command mode commands
      New settings in settings files for FEATURE_COMMAND_MODE_ENHANCED_CMD_ACKNOWLEDGEMENT ( https://github.com/k3ng/k3ng_cw_keyer/wiki/320-Feature:-Command-Mode#feedback )

    2020.06.03.01
      Fixed issue (hopefully) with memory_area_start automatic cacluation
      Fixed issue of command_mode_acknowledgement_character not used for command acknowledgement when FEATURE_COMMAND_MODE_ENHANCED_CMD_ACKNOWLEDGEMENT is disabled

    2020.06.03.02
      In FEATURE_COMMAND_MODE_ENHANCED_CMD_ACKNOWLEDGEMENT added setting command_t_tune_mode for T (tune) command
      Without FEATURE_COMMAND_MODE_ENHANCED_CMD_ACKNOWLEDGEMENT, setting command_mode_acknowledgement_character now is used for T (tune) command
      Added setting FEATURE_ETHERNET_DNS {8,8,8,8} to FEATURE_WEB_SERVER and FEATURE_INTERNET_LINK (FEATURE_ETHERNET)

    2020.06.03.03
      Fixed issue with paddle interruption of stacked memories not being consistent (Thanks, Marcin SP5IOU)
      \S memory macro now prints space on CLI and LCD display

    2020.06.13.01
      HARDWARE_GENERIC_STM32F103C - hard code EEPROM length to account for length() method not being available on this platform

    2020.06.14.01
      Added [ character as prosign AS for K1EL Winkeyer / N1MM+ compatibility (Thanks, Mark WH7W)

    2020.07.01.01
      Pull request 98 - Support for configuring the side tone line states - merged.  (https://github.com/k3ng/k3ng_cw_keyer/pull/98) (Thanks, Costin Stroie)
      New settings: sidetone_line_active_state, sidetone_line_inactive_state   

    2020.07.04.01
      Added OPTION_WINKEY_PROSIGN_COMPATIBILITY for additional character mappings to support K1EL Winkey emulation prosigns 

    2020.07.07.01
      Merge of pull request 99 - Add support for using the NewTone library (https://github.com/k3ng/k3ng_cw_keyer/pull/99) (Thanks, Costin Stroie)
        Added support for configuring the sidetone line states HIGH and LOW.
        Use the NewTone instead of the standard tone library (~1k smaller code).
        Included the NewTone library by Tim Eckel <teckel@leethost.com>
      Added FEATURE_WEB_SERVER and FEATURE_INTERNET_LINK to all features and options files  

    2020.07.17.01
      Merge of pull request 100 - Command buttons 1-3 are not working with ARDUINO_GENERIC_STM32F103C (https://github.com/k3ng/k3ng_cw_keyer/pull/100) (Thanks, 7m4mon)  
  
    2020.07.26.01
      Extended CLI commands now work with linefeed line terminations in addition to carriage return; Issue 101 (https://github.com/k3ng/k3ng_cw_keyer/issues/101), (Thanks, devcpu)

    2020.08.17.01
      FEATURE_WINKEY_EMULATION - fixed bug that adversly affected operation with Logger32

    2020.08.21.01
      FEATURE_COMMAND_BUTTONS is now called FEATURE_BUTTONS
      Command mode is now broken out into its own feature, FEATURE_COMMAND_MODE

    2020.08.22.01
      Minor tweak in check_buttons()  

    2020.08.23.01
      Added FEATURE_LCD_I2C_FDEBRABANDER
      Added settings
        lcd_i2c_address_mathertel_PCF8574 0x27             // I2C address of display for FEATURE_LCD_MATHERTEL_PCF8574
        lcd_i2c_address_fdebrander_lcd 0x27                // I2C address of display for FEATURE_LCD_I2C_FDEBRABANDER
        lcd_i2c_address_ydv1_lcd 0x27                      // I2C address of display for FEATURE_LCD_YDv1
        lcd_i2c_address_sainsmart_lcd 0x27                 // I2C address of display for FEATURE_LCD_SAINSMART_I2C  

    2020.08.24.01
      In pin settings files clarified the function of pins for FEATURE_CW_DECODER & OPTION_CW_DECODER_GOERTZEL_AUDIO_DETECTOR   
      Updated CW Decoder Wiki Page https://github.com/k3ng/k3ng_cw_keyer/wiki/385-Feature:-CW-Decoder   

    2020.08.28.02
      Merged pull request 103 Change personalized startup operation ( https://github.com/k3ng/k3ng_cw_keyer/pull/103 )  (Thanks, VK2EFL) 

    2020.08.29.01
      Implemented fix for memories not halting after a paddle press ( https://groups.io/g/radioartisan/message/13500 ) (Thanks, Gary, AF8A, for code )    

