K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
#include "keyer.h"

#ifdef FEATURE_EEPROM_E24C1024
  #include <E24C1024.h>
  #define EEPROM EEPROM1024
#endif 

#include "keyer_dependencies.h"
#include "keyer_debug.h"

#if defined(HARDWARE_OPENCWKEYER_MK2)
  #include "keyer_pin_settings_opencwkeyer_mk2.h"
  #include "keyer_settings_opencwkeyer_mk2.h"
#elif defined(HARDWARE_NANOKEYER_REV_B)
  #include "keyer_pin_settings_nanokeyer_rev_b.h"
  #include "keyer_settings_nanokeyer_rev_b.h"
#elif defined(HARDWARE_NANOKEYER_REV_D)
  #include "keyer_pin_settings_nanokeyer_rev_d.h"
  #include "keyer_settings_nanokeyer_rev_d.h"
#elif defined(HARDWARE_OPEN_INTERFACE)
  #include "keyer_pin_settings_open_interface.h"
  #include "keyer_settings_open_interface.h"
#elif defined(HARDWARE_TINYKEYER)
  #include "keyer_pin_settings_tinykeyer.h"
  #include "keyer_settings_tinykeyer.h"
#elif defined(HARDWARE_FK_10)
  #include "keyer_pin_settings_fk_10.h"
  #include "keyer_settings_fk_10.h"
#elif defined(HARDWARE_FK_11)
  #include "keyer_pin_settings_fk_11.h"
  #include "keyer_settings_fk_11.h"
#elif defined(HARDWARE_MAPLE_MINI)
  #include "keyer_pin_settings_maple_mini.h"
  #include "keyer_settings_maple_mini.h"
#elif defined(HARDWARE_ESP32_DEV)//sp5iou 20220123
  #include "keyer_pin_settings_esp32_dev.h"
  #include "keyer_settings_esp32_dev.h"
  #ifdef ARDUINO_ARCH_ESP32
    #include "esp32-hal-log.h"
  #endif
#elif defined(HARDWARE_GENERIC_STM32F103C)
  #include "keyer_pin_settings_generic_STM32F103C.h"
  #include "keyer_settings_generic_STM32F103C.h"
#elif defined(HARDWARE_MORTTY)
  #include "keyer_pin_settings_mortty.h"
  #include "keyer_settings_mortty.h"  
#elif defined(HARDWARE_MORTTY_REGULAR)
  #include "keyer_pin_settings_mortty_regular.h"
  #include "keyer_settings_mortty_regular.h"   
#elif defined(HARDWARE_MORTTY_REGULAR_WITH_POTENTIOMETER)
  #include "keyer_pin_settings_mortty_regular_with_potentiometer.h"
  #include "keyer_settings_mortty_regular_with_potentiometer.h"   
#elif defined(HARDWARE_MORTTY_SO2R)
  #include "keyer_pin_settings_mortty_so2r.h"
  #include "keyer_settings_mortty_so2r.h"   
#elif defined(HARDWARE_MORTTY_SO2R_WITH_POTENTIOMETER)
  #include "keyer_pin_settings_mortty_so2r_with_potentiometer.h"
  #include "keyer_settings_mortty_so2r_with_potentiometer.h"    
#elif defined(HARDWARE_K5BCQ)
  #include "keyer_pin_settings_k5bcq.h"
  #include "keyer_settings_k5bcq.h"
#elif defined(HARDWARE_MEGAKEYER)
  #include "keyer_pin_settings_megakeyer.h"
  #include "keyer_settings_megakeyer.h"
#elif defined(HARDWARE_TEST_EVERYTHING)
  #include "keyer_pin_settings_test_everything.h"
  #include "keyer_settings_test_everything.h"
#elif defined(HARDWARE_YAACWK)
  #include "keyer_pin_settings_yaacwk.h"
  #include "keyer_settings_yaacwk.h"
#elif defined(HARDWARE_TEST)
  #include "keyer_pin_settings_test.h"
  #include "keyer_settings_test.h"
#elif defined(HARDWARE_IZ3GME)
  #include "keyer_pin_settings_iz3gme.h"
  #include "keyer_settings_iz3gme.h"
#elif defined(HARDWARE_YCCC_SO2R_MINI)
  #include "keyer_pin_settings_yccc_so2r_mini.h"
  #include "keyer_settings_yccc_so2r_mini.h"  
#else
  #include "keyer_pin_settings.h"
  #include "keyer_settings.h"
#endif

#if !defined(HARDWARE_GENERIC_STM32F103C) && !defined(FEATURE_MCP23017_EXPANDER) // bypass when using mcp23017_write_io in place of digital write
  #if (paddle_left == 0) || (paddle_right == 0)
  #error "You cannot define paddle_left or paddle_right as 0 to disable"
  #endif
#endif

#if defined(FEATURE_BUTTONS)
  #include "src/buttonarray/buttonarray.h"
#endif

#if defined(FEATURE_SIDETONE_NEWTONE) && !defined(OPTION_SIDETONE_DIGITAL_OUTPUT_NO_SQUARE_WAVE)
  #include <NewTone.h>
  #define tone   NewTone
  #define noTone noNewTone
#endif //FEATURE_SIDETONE_NEWTONE

#if defined(FEATURE_SLEEP) && !defined(HARDWARE_GENERIC_STM32F103C) && !defined(HARDWARE_MAPLE_MINI) && !defined(HARDWARE_ESP32_DEV)
  #include <avr/sleep.h>  // It should be different library for STM32 and ESP32 sp5iou
#endif 

#if defined(FEATURE_PS2_KEYBOARD)
  #include <K3NG_PS2Keyboard.h>
#endif

#if defined(FEATURE_BT_KEYBOARD)
  #include "bt_keyboard.hpp"  // from esp-32 project component folder
  #include "esp_err.h"
  #include "nvs_flash.h"
#endif

#if defined(FEATURE_LCD_4BIT) || defined(FEATURE_LCD1602_N07DH) || defined (FEATURE_LCD_8BIT) // works on 3.2V supply and logic, but do not work on every pins (SP5IOU)
  #include <LiquidCrystal.h>
  #include <Wire.h>
#endif

#if defined(FEATURE_LCD_ADAFRUIT_I2C) || defined(FEATURE_LCD_ADAFRUIT_BACKPACK) || defined(FEATURE_LCD_YDv1) || defined(FEATURE_LCD_SAINSMART_I2C) || defined(FEATURE_LCD_FABO_PCF8574) || defined(FEATURE_LCD_MATHERTEL_PCF8574)
  #include <Wire.h>
#endif

#if defined(FEATURE_LCD_YDv1)
  #include "LiquidCrystal_I2C.h"
#endif

#if defined(FEATURE_LCD_ADAFRUIT_I2C)
  #include <Adafruit_MCP23017.h>
  #include <Adafruit_RGBLCDShield.h>
#endif

#if defined(FEATURE_LCD_ADAFRUIT_BACKPACK)
  #include "Adafruit_LiquidCrystal.h"
#endif

#if defined(FEATURE_LCD_SAINSMART_I2C)
  #include <LiquidCrystal_I2C.h>
#endif

#if defined(FEATURE_LCD_FABO_PCF8574)
  #include <FaBoLCD_PCF8574.h>
#endif  

#if defined(FEATURE_LCD_MATHERTEL_PCF8574)
  #include "LiquidCrystal_PCF8574.h"
#endif

#if defined(FEATURE_LCD_I2C_FDEBRABANDER)
  #include "LiquidCrystal_I2C.h"
#endif

#if defined(FEATURE_LCD_LIQUIDCRYSTAL_I2C)
  #include <Wire.h>
  #include "LiquidCrystal_I2C.h"
#endif

#if defined(FEATURE_TFT_DISPLAY)
  const uint8_t grid_len_max = 9;
  #define CONFIG_I2C_ENABLE_SLAVE_DRIVER_VERSION
  //#define TFT_VIEWPORT
  #ifdef M5STACK_CORE2a
    //#include <M5ModuleDisplay.h>
    #include "SPI.h"
    #include <TFT_eSPI.h> // Graphics and font library for ILI9341 driver chip
    TFT_eSPI lcd = TFT_eSPI();  // Invoke library
    //#include <m5stack_core_2.h>
    //#include  <m5gfx.h>
    //#include <M5Unified.h>
    //#define lcd M5.Lcd

    //#define setTextColor(a,b,c) setTextColor(a,b)
    //#define fillSmoothRoundRect(x,y,w,h,r,fg,bg) fillSmoothRoundRect(x,y,w,h,r,fg)
    //#define drawSmoothRoundRect(x,y,r,ir,w,h,fg,bg) drawRoundRect(x,y,w,h,r,fg) 
    #define setFreeFont(a) setFont(a)
    #define FM9 &fonts::FreeMono9pt7b
    #define FMB12 &fonts::FreeMonoBold12pt7b 
    #define FS9 &fonts::FreeSans9pt7b
    #define TFT_HEIGHT 240
  #else
    #include "SPI.h"
    #include <TFT_eSPI.h> // Graphics and font library for ILI9341 driver chip
    TFT_eSPI lcd = TFT_eSPI();  // Invoke library
    #define FM9 &FreeMono9pt7b
    #define FS9 &FreeSans9pt7b
    #define FMB12 &FreeMonoBold12pt7b
  #endif
  //#include "Free_Fonts.h" // Include the header file attached to this sketch  
  #define GFXFF 1                 // enable FreeFont set of custom fonts from AdaFruit
  #define TFT_FONT_SMALL FS9      // FreeFont mono 9pt, not bold.
  #define TFT_FONT_MEDIUM FMB12  	// FreeFont Mono Bold 12pt
  #define COLUMN_WIDTH 15         // width of mono-spaced scroll box font in pixels
  #define MY_DATUM TL_DATUM       // can change to MC_DATAUM for centered text in a drawstring()

  #ifdef RES_320_480   // 320x480 display
    // Define handle to receive return value
    #define SCREEN_WIDTH (TFT_HEIGHT-1)   // We are rotated horizontal so width and height are reversed.
    #define SCREEN_HEIGHT (TFT_WIDTH-1)
    #define SCROLL_BOX_LEFT_SIDE 3
    #define SCREEN_BOX_HEIGHT 180    // This is set to the working area defined in the currently red border area.  
    #define SCROLL_BOX_TOP 39   // 1 row below the status bar border line
    #define STATUS_BAR_FONT 4   // 2  or FM9 or FS9
    #define ICON_COLUMN_WIDTH COLUMN_WIDTH    // width of mono-spaced status bar font in pixels
    #define SCROLL_BOX_FONT FMB12   // 4
    #define ICON_SPACING (ICON_COLUMN_WIDTH+5)
    #define TX_NUM_ANCHOR (122)
    #define GRID_ANCHOR (167)
    #define WPM_ANCHOR (307)
    #define ICON_ANCHOR (382)
    #define STATUS_BAR_X_CURSOR (8)
  #else   // 240x320 and 170x320
    #define SCREEN_WIDTH (TFT_HEIGHT-1)   // We are rotated horizontal so width and height are reversed.
    #define SCREEN_HEIGHT (TFT_WIDTH-1)
    #define SCROLL_BOX_LEFT_SIDE 3
    #define SCREEN_BOX_HEIGHT 170    // This is set to the working area defined in the currently red border area.  
    // 170 for the 170x320 and 240x320 displays
    // On screens that are larger than 170px, the extra area is intended to be used for buttons or status windows.
    // you can set this to full height and increase the LCD_ROWS setting but 5 rows seems plenty to avoid much clutter. 
    #define SCROLL_BOX_TOP 29   // 1 row below the status bar border line
    #define STATUS_BAR_FONT 2   // 2  or FM9 or FS9
    #define ICON_COLUMN_WIDTH 12    // width of mono-spaced status bar font in pixels
    #define SCROLL_BOX_FONT FMB12   // 4
    #define ICON_SPACING (ICON_COLUMN_WIDTH+2)
    #define TX_NUM_ANCHOR (72)
    #define GRID_ANCHOR (108)
    #define WPM_ANCHOR (202)
    #define ICON_ANCHOR (250)
    #define STATUS_BAR_X_CURSOR (6)
  #endif

  #define SCROLL_BOX_WIDTH (TFT_HEIGHT-(2*SCROLL_BOX_LEFT_SIDE)) // pixel width of scroll box area
  #define SCROLL_BOX_HEIGHT (SCREEN_BOX_HEIGHT-SCROLL_BOX_TOP-3)  // pixel height of scroll box area inside borders
  #define SCROLL_TEXT_TOP_LINE (SCROLL_BOX_TOP+20)   // stat of first row of text
  #define SCROLL_TEXT_LEFT_SIDE (SCROLL_BOX_LEFT_SIDE+8)   // start of text columns
  
