K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
  #define TFT_GREY 0x5AEB // New color
  #define FONT_HEIGHT ((lcd.fontHeight()+2))    // using 2px padding for line separation
  #ifdef TOUCH_BUTTON_16
    #define BUTTON_HEIGHT 57
    #define BUTTON_WIDTH  57
    #define BUTTON_ROW  (SCROLL_BOX_TOP+SCROLL_BOX_HEIGHT+12)
    #define BUTTON_ROW2 (BUTTON_ROW+66)  // used when 2 rows are displayed at a time
  #else
    #define BUTTON_HEIGHT 60
    #define BUTTON_WIDTH  60
    #define BUTTON_ROW  (SCROLL_BOX_TOP+SCROLL_BOX_HEIGHT+8)
    #define BUTTON_ROW2 (BUTTON_ROW+66)  // only used when 2 rows are displayed at a time
  #endif
  #define SCROLL_BOX_ROW1 (SCROLL_TEXT_TOP_LINE)
  #define SCROLL_BOX_ROW2 (SCROLL_TEXT_TOP_LINE+FONT_HEIGHT)
  #define SCROLL_BOX_ROW3 (SCROLL_TEXT_TOP_LINE+(2*FONT_HEIGHT))
  #define SCROLL_BOX_ROW4 (SCROLL_TEXT_TOP_LINE+(3*FONT_HEIGHT))
  #define SCROLL_BOX_ROW5 (SCROLL_TEXT_TOP_LINE+(4*FONT_HEIGHT))
  #define SCROLL_BOX_CENTER (SCROLL_BOX_WIDTH/2)
  #define SCROLL_BOX_BOTTOM (SCROLL_BOX_TOP+SCROLL_BOX_HEIGHT)
 
  #define TFT_VIEWPORT_EXISTS (lcd.checkViewport(SCROLL_BOX_LEFT_SIDE+3, SCROLL_BOX_TOP+4, 1, 1))
  #define TFT_SET_VIEWPORT (lcd.setViewport(SCROLL_BOX_LEFT_SIDE+2, SCROLL_BOX_TOP+2, SCROLL_BOX_WIDTH-4, SCROLL_BOX_HEIGHT-4, false))
  #define TFT_SET_WINDOW (lcd.setWindow(SCROLL_BOX_LEFT_SIDE+1, SCROLL_BOX_TOP+1, SCROLL_BOX_WIDTH-2, SCROLL_BOX_HEIGHT-2))
#endif

#if defined(HARDWARE_ESP32_DEV)
  #include <driver/gpio.h>
  #include <freertos/event_groups.h>
  //#include "freertos/semphr.h"
  #include <freertos/task.h>
  volatile bool paddle_left_state  = true;   // 1 is pulled high, 0 is contact closed
  volatile bool paddle_right_state = true;
  volatile bool straight_key_state = true;
  static EventGroupHandle_t Key_Events = NULL;
  #ifdef FEATURE_MCP23017_EXPANDER    
    #include "MCP23017.h"
    #ifdef USE_WIRE1 
      MCP23017 mcp23017 = MCP23017(MCP23X17_ADDR, Wire1);
    #else
      MCP23017 mcp23017 = MCP23017(MCP23X17_ADDR, Wire);
    #endif
  #endif
#endif

#if defined(FEATURE_LCD_HD44780)
  #include <Wire.h>
  #include <hd44780.h>
  #include <hd44780ioClass/hd44780_I2Cexp.h>
  #define WIRECLOCK 400000L
#endif

#if defined(FEATURE_TRAINING_COMMAND_LINE_INTERFACE)
 // #include <BasicTerm.h>
#endif

#if defined(FEATURE_CW_DECODER) && defined(OPTION_CW_DECODER_GOERTZEL_AUDIO_DETECTOR)
  #include <goertzel.h>
#endif
#if defined(FEATURE_WIFI) && defined(HARDWARE_ESP32_DEV) //SP5IOU 20220127
#include <WiFi.h>
#include <WifiClient.h>
#include <WiFiServer.h>
#define EthernetClient WiFiClient
#define EthernetServer WiFiServer
#define EthernetUDP WiFiUDP
#endif

#if defined(FEATURE_ETHERNET)
#if !defined(ARDUINO_MAPLE_MINI) && !defined(ARDUINO_GENERIC_STM32F103C) && !defined(HARDWARE_ESP32_DEV)//sp5iou 20180329 20220127
  #include <Ethernet.h>  // if this is not included, compilation fails even though all ethernet code is #ifdef'ed out
  #if defined(FEATURE_INTERNET_LINK)
    #include <EthernetUdp.h>
  #endif //FEATURE_INTERNET_LINK
#endif //!defined(ARDUINO_MAPLE_MINI) && !defined(ARDUINO_GENERIC_STM32F103C) //sp5iou 20180329  
#endif //FEATURE_ETHERNET


#if defined(FEATURE_USB_KEYBOARD) || defined(FEATURE_USB_MOUSE)  // note_usb_uncomment_lines
  // #include <hidboot.h>  // Arduino 1.6.x (and maybe 1.5.x) has issues with these three lines, moreover we noted that Arduino 1.8.6 it's not afected by an issue during USB Shield SPI init see https://github.com/felis/USB_Host_Shield_2.0/issues/390
  // #include <usbhub.h>   // Uncomment the three lines if you are using FEATURE_USB_KEYBOARD or FEATURE_USB_MOUSE
  // #include <Usb.h>      // Note: the most updated USB Library can be downloaded at https://github.com/felis/USB_Host_Shield_2.0
#endif

#if defined(FEATURE_CW_COMPUTER_KEYBOARD) 
  #include <Keyboard.h>  // Have a problem with Keyboard.h not found?  See https://github.com/k3ng/k3ng_cw_keyer/issues/35
                           // For some unknown reason this line uncommented in Arduino 1.8.1 <sometimes?> causes compilation error (sigh) 
#endif //defined(FEATURE_CW_COMPUTER_KEYBOARD)

#if defined(FEATURE_4x4_KEYPAD)|| defined (FEATURE_3x4_KEYPAD)
  #include <Keypad.h>
#endif

#if defined(FEATURE_SD_CARD_SUPPORT)
  #include <SPI.h>
  #include <SD.h>
#endif //FEATURE_SD_CARD_SUPPORT

#if defined(ARDUINO_SAMD_VARIANT_COMPLIANCE)
  extern uint32_t __get_MSP(void);
  #define SP __get_MSP()
#endif  

#define memory_area_start (sizeof(configuration)+5)

// Variables and stuff
struct config_t {  // 120 bytes total
  
  uint8_t paddle_mode;                                                   
  uint8_t keyer_mode;            
  uint8_t sidetone_mode;
  uint8_t pot_activated;
  uint8_t length_wordspace;
  uint8_t autospace_active;
  uint8_t current_ptt_line;
  uint8_t current_tx;
  uint8_t weighting;
  uint8_t dit_buffer_off;
  uint8_t dah_buffer_off;
  uint8_t cmos_super_keyer_iambic_b_timing_percent;
  uint8_t cmos_super_keyer_iambic_b_timing_on;
  uint8_t link_receive_enabled;
  uint8_t paddle_interruption_quiet_time_element_lengths;
  uint8_t wordsworth_wordspace;
  uint8_t wordsworth_repetition;
  uint8_t cli_mode;
  uint8_t ptt_buffer_hold_active;
  uint8_t ptt_disabled;
  uint8_t beacon_mode_on_boot_up;
  uint8_t keying_compensation;
    // 22 bytes

  unsigned int wpm;
  unsigned int hz_sidetone;
  unsigned int dah_to_dit_ratio;
  unsigned int wpm_farnsworth;
  unsigned int memory_repeat_time;
  unsigned int wpm_command_mode;
  unsigned int link_receive_udp_port; 
  unsigned int wpm_ps2_usb_keyboard;
  unsigned int wpm_cli;
  unsigned int wpm_winkey;
  unsigned int cw_echo_timing_factor;
  unsigned int autospace_timing_factor;
    // 24 bytes 

  uint8_t ip[4];
  uint8_t gateway[4];  
  uint8_t subnet[4]; 
  uint8_t dns_server[4];
    // 16 bytes

  uint8_t link_send_ip[4][FEATURE_INTERNET_LINK_MAX_LINKS];   // FEATURE_INTERNET_LINK_MAX_LINKS = 2
  uint8_t link_send_enabled[FEATURE_INTERNET_LINK_MAX_LINKS];
  unsigned int link_send_udp_port[FEATURE_INTERNET_LINK_MAX_LINKS];
    // 14 bytes

  unsigned int ptt_lead_time[6];
  unsigned int ptt_tail_time[6];
  unsigned int ptt_active_to_sequencer_active_time[5];
  unsigned int ptt_inactive_to_sequencer_inactive_time[5];
    // 44 bytes

