K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
  int sidetone_volume;
    // 2 bytes

#ifdef FEATURE_TFT_DISPLAY
  uint8_t grid_digits;  // length of gridsquare to display
  char GridSq[grid_len_max];  // typically 9 bytes
  bool ignore_gps;  // set to true if we shoudl not use GPS info
  float declination; // store the declination stored in memory 12 from config, or from a user entered overriding value in memory 12
    // 2+9 bytes
#endif

#if defined(FEATURE_WIFI) && defined(HARDWARE_ESP32_DEV) //SP5IOU 20220129
  char wifissid[20]=WIFI_SSID;//Initialize configuration.wifissid with default set in keyer_settings...h file
  char wifipassword[20]=WIFI_PASSWORD;//Initialize configuration.wifipassword with default set in keyer_settings...h file
    //40 bytes
#endif
} configuration;

// Forward declarations to make esp-idf happy

void add_to_send_buffer(byte incoming_serial_byte);
int paddle_pin_read(int pin_to_read);
void display_serial_number_character(char snumchar);
int memory_start(byte memory_number); 
int memory_end(byte memory_number);
void tx_and_sidetone_key (int state);
void send_char(byte cw_char, byte omit_letterspace);
void boop();
void beep();
void check_serial();
void remove_from_send_buffer();
void winkey_port_write(byte byte_to_send,byte override_filter);
void cli_timing_command(PRIMARY_SERIAL_CLS * port_to_use,String command_arguments,byte command_called);
void serial_change_wordspace(PRIMARY_SERIAL_CLS * port_to_use);
int serial_get_number_input(byte places,int lower_limit, int upper_limit,PRIMARY_SERIAL_CLS * port_to_use,int raise_error_message);
void cli_extended_commands(PRIMARY_SERIAL_CLS * port_to_use);
void serial_switch_tx(PRIMARY_SERIAL_CLS * port_to_use);
void serial_tune_command (PRIMARY_SERIAL_CLS * port_to_use);
void write_settings_to_eeprom(int initialize_eeprom) ;
void check_dit_paddle();
void check_dah_paddle();
void clear_send_buffer();
void loop_element_lengths(float lengths, float additional_time_ms, int speed_wpm_in);
void speed_set(int wpm_set);
int convert_cw_number_to_ascii (long number_in);
void cli_timing_print(PRIMARY_SERIAL_CLS * port_to_use);
void cli_paddle_echo_factor(PRIMARY_SERIAL_CLS * port_to_use,String command_arguments);
void serial_play_memory(byte memory_number);
void switch_to_tx_silent(byte tx) ;
void serial_set_dit_to_dah_ratio(PRIMARY_SERIAL_CLS * port_to_use);
void serial_program_memory(PRIMARY_SERIAL_CLS * port_to_use);
void serial_status(PRIMARY_SERIAL_CLS * port_to_use) ;
void cli_autospace_timing_factor(PRIMARY_SERIAL_CLS * port_to_use,String command_arguments);
void serial_receive_practice_menu(PRIMARY_SERIAL_CLS * port_to_use,byte practice_mode);
void serial_wordsworth_menu(PRIMARY_SERIAL_CLS * port_to_use);
void receive_transmit_echo_practice(PRIMARY_SERIAL_CLS * port_to_use, byte practice_mode_called) ;
void serial_set_weighting(PRIMARY_SERIAL_CLS * port_to_use);
void process_serial_command(PRIMARY_SERIAL_CLS * port_to_use);
void serial_set_sidetone_freq(PRIMARY_SERIAL_CLS * port_to_use);
void serial_status_memories(PRIMARY_SERIAL_CLS * port_to_use);
void initialize_eeprom_memories();
void serial_set_serial_number(PRIMARY_SERIAL_CLS * port_to_use);
void repeat_play_memory(PRIMARY_SERIAL_CLS * port_to_use);
void serial_set_memory_repeat(PRIMARY_SERIAL_CLS * port_to_use);
void initialize_eeprom();
void cli_eeprom_dump(PRIMARY_SERIAL_CLS * port_to_use);
void serial_practice_interactive(PRIMARY_SERIAL_CLS * port_to_use,byte practice_type_called);
void serial_random_menu(PRIMARY_SERIAL_CLS * port_to_use);
void random_practice(PRIMARY_SERIAL_CLS * port_to_use,byte random_mode,byte group_size) ;
void wordsworth_practice(PRIMARY_SERIAL_CLS * port_to_use,byte practice_type);
void initialize_eeprom();
void serial_cw_practice(PRIMARY_SERIAL_CLS * port_to_use);
void serial_practice_non_interactive(PRIMARY_SERIAL_CLS * port_to_use,byte practice_type_called);
void cli_keying_compensation(PRIMARY_SERIAL_CLS * port_to_use,String command_arguments);
void serial_wpm_set(PRIMARY_SERIAL_CLS * port_to_use) ;
void serial_set_farnsworth(PRIMARY_SERIAL_CLS * port_to_use);
void send_serial_number(byte cut_numbers,int increment_serial_number,byte buffered_sending);
void serial_receive_transmit_echo_menu(PRIMARY_SERIAL_CLS * port_to_use);
byte play_memory(byte memory_number);
void display_scroll_print_char(char charin);
void popup(bool show);
void sinewave_interrupt_compute();
void initialize_sinewave_generator();
void initialize_tonsin();
void mydelay(uint32_t _ms);
void setup_esp();
int print_memory(byte memory_number, char *mem_string);
void check_gps(bool force_update, bool ignore_gps);
void check_compass(void);
void process_compass(bool force_update, bool ignore_dec);

#ifdef FEATURE_TOUCH_DISPLAY
//---------------------------------------------------------------------
// Buttons and Popup Window for Touch Displays
//---------------------------------------------------------------------
// list all possible buttons to get a unique ID.  The order does not matter
enum button_ID{
  BUTTON_F1 = 0,
  BUTTON_PAUSE,
  BUTTON_TX_ENABLE,
  BUTTON_WPM_UP,
  BUTTON_WPM_DN,
  BUTTON_F2,
  BUTTON_MEM_1,
  BUTTON_MEM_2,
  BUTTON_MEM_3,
  BUTTON_MEM_4,
  BUTTON_F3,
  BUTTON_MEM_5,
  BUTTON_MEM_6,
  BUTTON_MEM_7,
  BUTTON_MEM_8,
  BUTTON_F4,
  BUTTON_MEM_LIST,
  BUTTON_SIDETONE_EN, //  Toggle Sidetone On/Off
  BUTTON_TUNE,
  BUTTON_TX_SELECT,
  BUTTON_POPUP_2,
  BUTTON_POPUP_3,
  CW_BOX,
  BUTTON_last_button
};

  uint16_t t_x = 0, t_y = 0;    // Variables to store touch coordinates
  bool button_active = false;
  uint8_t button_row = 0;  // default to row 1
  uint16_t BtnX_active = 0;  // tracks if a key_ID is active across touches
 

  // Create all posible keys assignments here.  Config variables will then define how many of them 
  //  will be be in a row and how many rows.
  // Keys are mapped to buttons.  Each row of buttons are reused for each row.
  // In the case of 2 rows displayed at the same time, they are instead a single row with half
  //  of the buttons placed on lower Y row.  Thre may not be a need for the Fx key in this case.
  //  If so, can hide it somehow TBD.

  #ifdef TOUCH_BUTTON_16
    const uint8_t buttonCount = 16 + 1;  // sizeof(btn) / sizeof(btn[0]);  
    const int NUM_BUTTON_ROWS = 1; // number of rows of buttons
    const int NUM_KEYS = buttonCount;  // +1 is CW Scroll Box touch zone.  Fx key counts as a regular key
  #else
    const uint8_t buttonCount = 5 + 1;  // sizeof(btn) / sizeof(btn[0]);  
    const int NUM_BUTTON_ROWS = 4; // number of rows of buttons
    const int NUM_KEYS = (NUM_BUTTON_ROWS*5)+1;  // +1 is CW Scroll Box touch zone.  Fx key counts as a regular key

  #endif
  // The +1 is the CW Scroll Box touch zone. More may added for Yes/No confirmation buttons. 
  // This includs the Fx kay though it might be hidden or unused in some cases

  struct BTN_State {
    TFT_eSPI_Button p_btn;
    uint8_t len;
    uint32_t duration;
  } btn[buttonCount] = {};
  
