K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
    if (keyer_awake){
      digitalWrite(keyer_awake,KEYER_AWAKE_PIN_AWAKE_STATE);
    }

    last_activity_time = millis();
    #ifdef FEATURE_LCD_BACKLIGHT_AUTO_DIM
      last_active_time = millis(); 
    #endif //FEATURE_LCD_BACKLIGHT_AUTO_DIM

    #ifdef DEBUG_SLEEP
      debug_serial_port->println(F("check_sleep: I'm awake!"));
    #endif //DEBUG_SLEEP
  }


}
#endif //FEATURE_SLEEP
#endif //HARDWARE_ESP32_DEV
//-------------------------------------------------------------------------------------------------------

#ifdef FEATURE_LCD_BACKLIGHT_AUTO_DIM
void check_backlight() {

  static unsigned long last_bl_check = 0 ;

  if (millis() - last_bl_check < 1000) return;   // not time-critical

  last_bl_check = millis();
  
  if ((last_bl_check - last_active_time) > ((unsigned long)dim_backlight_inactive_time*60000)){
    
    #ifdef DEBUG_BACKLIGHT
      debug_serial_port->println(F("check_backlight: I'm asleep!"));
    #endif //DEBUG_BACKLIGHT

    if (keyer_power_led){
      analogWrite(keyer_power_led,keyer_power_led_asleep_duty);
    }      
    lcd.noBacklight();
    
  } else {
    
    #ifdef DEBUG_BACKLIGHT
      debug_serial_port->println(F("check_backlight: I'm awake!"));
    #endif //DEBUG_BACKLIGHT

    if (keyer_power_led){
      analogWrite(keyer_power_led,keyer_power_led_awake_duty);
    }
    lcd.backlight();
  }
}
#endif //FEATURE_LCD_BACKLIGHT_AUTO_DIM

//-------------------------------------------------------------------------------------------------------
// claer the scrollable text area of the display
#ifdef FEATURE_DISPLAY

void lcd_scroll_box_clear() {
    #ifdef FEATURE_TFT_DISPLAY
        if (popup_active) {
          //debug_serial_port->println(F("Skipping Popup while in lcd_scroll_clear()")); 
          return;  // skip this when a popup window is up, else will corrupt popup window content
        }
      //if (TFT_VIEWPORT_EXISTS) {
      //    debug_serial_port->println("Close Viewport");
          lcd.fillRoundRect(SCROLL_BOX_LEFT_SIDE, SCROLL_BOX_TOP, SCROLL_BOX_WIDTH, SCROLL_BOX_HEIGHT, 6, TFT_BLACK);
          vTaskDelay(1 / portTICK_PERIOD_MS);
      //    lcd.resetViewport();
      //}
      //else {
      //    debug_serial_port->println("Clear scroll box, no Close Viewport");
      //    lcd.fillRoundRect(SCROLL_BOX_LEFT_SIDE, SCROLL_BOX_TOP, SCROLL_BOX_WIDTH, SCROLL_BOX_HEIGHT, 6, TFT_BLACK);
          lcd.setTextColor(TFT_WHITE, TFT_BLACK);
      //}
    #else
        lcd.clear();
        lcd.noCursor();//sp5iou 20180328
    #endif
}
#endif

#ifdef FEATURE_BT_KEYBOARD
char bt_keyboard_read() {
  #ifndef USE_BT_TASK
    vTaskDelay(1 / portTICK_PERIOD_MS);
    check_bt_keyboard();
  #endif
  return queuepop();
}

int bt_keyboard_available() {
  #ifndef USE_BT_TASK
    vTaskDelay(1 / portTICK_PERIOD_MS);
    check_bt_keyboard();
  #endif
  return queue_available();
}
#endif // FEATURE_BT_KEYBOARD

int touch_key_read() {  // if touch_button_available then ther eis a non-zero touch key value set in button_active
  #if defined(FEATURE_TOUCH_DISPLAY)
    #ifndef USE_TOUCH_TASK
      check_touch_buttons();    
    #endif 
    vTaskDelay(1 / portTICK_PERIOD_MS);
    if (button_active) process_buttons();
    return queuepop();
    #else
      return 0;
  #endif
}

int touch_button_available() {
  #if defined(FEATURE_TOUCH_DISPLAY)
    #ifndef USE_TOUCH_TASK
      check_touch_buttons();
    #endif
    if (button_active) process_buttons();
    return queue_available();
  #else
    return 0;
  #endif
}

void update_icons(void) {
#ifdef FEATURE_TFT_DISPLAY    
    if (popup_active) return;  // bail, these screen writes below are outside the popup window    
    static char last_GridSq[grid_len_max] = "";
    static byte last_key_tx = false;
    char tx_str[7] = "";
    static uint8_t last_tx = 0;
    const int32_t row = STATUS_BAR_X_CURSOR;

    lcd.setTextDatum(MY_DATUM);
    //lcd.setFreeFont(STATUS_BAR_FONT);    
    lcd.setTextFont(STATUS_BAR_FONT);  // &fonts::FreeMonoBold12pt7b)    
  
    #ifdef FEATURE_GPS      // if not enabled leave the default grey 00:00:00 printed at init time.
      if (!time_disp_updated && !configuration.ignore_gps && !stop_msg) {
        lcd.setTextColor(TFT_YELLOW, TFT_BLACK);
        time_disp_updated = true;
      } else {
        lcd.setTextColor(TFT_GREY, TFT_BLACK);
        time_disp_updated = true;
      } 
      
      if (time_disp_updated) {
        lcd.drawString(time_str, SCROLL_TEXT_LEFT_SIDE-6, STATUS_BAR_X_CURSOR);  
        time_disp_updated = false;
      }
    #endif

    if (configuration.current_tx != last_tx || last_key_tx != key_tx) // TX state changed, update display
    {
      sprintf(tx_str, "T%d", last_tx);
      lcd.setTextColor(TFT_BLACK, TFT_BLACK);
      lcd.drawString(tx_str, TX_NUM_ANCHOR, row);   // blank out space 

      sprintf(tx_str, "T%d", configuration.current_tx);
      if (!key_tx) lcd.setTextColor(TFT_RED, TFT_BLACK);  // enabled
      else lcd.setTextColor(TFT_GREEN, TFT_BLACK); // disabled
      lcd.drawString(tx_str, TX_NUM_ANCHOR, row); // update display

      last_tx = configuration.current_tx;  // remember last state
      last_key_tx = key_tx;
    }

    if (strcmp(configuration.GridSq, last_GridSq) != 0)  // grid changed, update display
    {
      lcd.setTextColor(TFT_BLACK, TFT_BLACK);
      lcd.drawString(last_GridSq, GRID_ANCHOR, row);   // blank out space 

      if (!configuration.ignore_gps && !stop_msg) {
        lcd.setTextColor(TFT_MAGENTA, TFT_BLACK);
        lcd.drawString(configuration.GridSq, GRID_ANCHOR, row); // update display
      } else {
        lcd.setTextColor(TFT_GREY, TFT_BLACK);
        lcd.drawString(configuration.GridSq, GRID_ANCHOR, row); // update display
      }

      strcpy(last_GridSq, configuration.GridSq);  // write grid square
    }

//    GRID_ANCHOR (SCREEN_WIDTH/4)
//    #define WPM_ANCHOR (SCREEN_WIDTH/2)
//    #define ICON_ANCHOR (479-5-(5*COLUMN_WIDTH))
//    #define ICON_WIDTH COLUMN_WIDTH

    char WPM[7] = "\0";
    static int last_WPM = 0;

    if (last_WPM != (int) configuration.wpm)  // wpm changed, update display
    {
      lcd.setTextColor(TFT_CYAN, TFT_BLACK);
      itoa(configuration.wpm, WPM, 10);
      strncat(WPM, "wpm", 6);
      lcd.drawString("       ", WPM_ANCHOR, row);  // erase old
      lcd.drawString(WPM,       WPM_ANCHOR, row);  // WPM rate
      last_WPM = configuration.wpm;
    }

    #ifdef NOT_USING_THESE_NOW
    if (last_sending_mode != sending_mode)    // modes are : Auto, Manual, Auto-Interrupted
    {
      switch (last_sending_mode) {
        case AUTOMATIC_SENDING:             lcd.setTextColor(TFT_BLACK, TFT_BLACK); lcd.drawChar('A', ICON_ANCHOR, row); break;
        case AUTOMATIC_SENDING_INTERRUPTED: lcd.setTextColor(TFT_BLACK, TFT_BLACK); lcd.drawChar('I', ICON_ANCHOR, row); break;
        case MANUAL_SENDING:                lcd.setTextColor(TFT_BLACK, TFT_BLACK); lcd.drawChar('M', ICON_ANCHOR, row); break;
      }
      switch (sending_mode) {
        case AUTOMATIC_SENDING:             lcd.setTextColor(TFT_ORANGE, TFT_BLACK); lcd.drawChar('A', ICON_ANCHOR, row); break;
        case AUTOMATIC_SENDING_INTERRUPTED: lcd.setTextColor(TFT_ORANGE, TFT_BLACK); lcd.drawChar('I', ICON_ANCHOR, row); break;
        case MANUAL_SENDING:                lcd.setTextColor(TFT_PINK, TFT_BLACK);   lcd.drawChar('M', ICON_ANCHOR, row); break;
      }
      last_sending_mode = sending_mode;
    }
    #endif

    static byte last_keyer_machine_mode = 255;

    if (last_keyer_machine_mode != keyer_machine_mode)    // modes are : Beacon KEYER_NORMAL KEYER_COMMAND_MODE
    {
      switch (last_keyer_machine_mode) {
        case BEACON:              lcd.setTextColor(TFT_BLACK, TFT_BLACK); lcd.drawChar('B', ICON_ANCHOR+ICON_SPACING, row); break;
        case KEYER_NORMAL:        lcd.setTextColor(TFT_BLACK, TFT_BLACK); lcd.drawChar('N', ICON_ANCHOR+ICON_SPACING, row); break;
        case KEYER_COMMAND_MODE:  lcd.setTextColor(TFT_BLACK, TFT_BLACK); lcd.drawChar('C', ICON_ANCHOR+ICON_SPACING, row); break;
      }
      switch (keyer_machine_mode) {
        case BEACON:              lcd.setTextColor(TFT_ORANGE, TFT_BLACK);    lcd.drawChar('B', ICON_ANCHOR+ICON_SPACING, row); break;
        case KEYER_NORMAL:        lcd.setTextColor(TFT_LIGHTGREY, TFT_BLACK); lcd.drawChar('N', ICON_ANCHOR+ICON_SPACING, row);; break;
        case KEYER_COMMAND_MODE:  lcd.setTextColor(TFT_PINK, TFT_BLACK);      lcd.drawChar('C', ICON_ANCHOR+ICON_SPACING, row); break;
      }
      last_keyer_machine_mode = keyer_machine_mode;
    }

    static byte last_ptt_line_activated= 255;

    if (last_ptt_line_activated != ptt_line_activated)  // Tx state changed
    {
      lcd.setTextColor(TFT_BLACK, TFT_BLACK);
      if (ptt_line_activated) {
          lcd.drawChar('R', ICON_ANCHOR+(2*ICON_SPACING), row);
          lcd.setTextColor(TFT_RED, TFT_BLACK);
          lcd.drawChar('T', ICON_ANCHOR+(2*ICON_SPACING), row);
      } else {
          lcd.drawChar('T', ICON_ANCHOR+(2*ICON_SPACING), row);
          lcd.setTextColor(TFT_GREEN, TFT_BLACK);          
          lcd.drawChar('R', ICON_ANCHOR+(2*ICON_SPACING), row);
      }
      last_ptt_line_activated = ptt_line_activated;
    }

    static byte last_pause_sending_buffer = 254;

    if (last_pause_sending_buffer != pause_sending_buffer)
    {
      if (pause_sending_buffer != 0) {
          lcd.setTextColor(TFT_GOLD, TFT_BLACK);
          lcd.drawChar('P', ICON_ANCHOR+(3*ICON_SPACING), row);   // Sending Paused
      } else {
          lcd.setTextColor(TFT_BLACK, TFT_BLACK);
          lcd.drawChar('P', ICON_ANCHOR+(3*ICON_SPACING), row);   
      }
      last_pause_sending_buffer = pause_sending_buffer;
    }

