K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
        case DAH_CLOSURE_DIT_ON:
          if (dah_buffer) {
            if (dit_buffer) {
              dit_buffer = 0;
            } else {
              last_closure = DAH_CLOSURE_DIT_OFF;
            }
          } else {
            if (dit_buffer) {
              last_closure = DIT_CLOSURE_DAH_OFF;
            } else {
              last_closure = NO_CLOSURE;
            }
          }
          break;

        case NO_CLOSURE:
          if ((dit_buffer) && (!dah_buffer)) {
            last_closure = DIT_CLOSURE_DAH_OFF;
          } else {
            if ((dah_buffer) && (!dit_buffer)) {
              last_closure = DAH_CLOSURE_DIT_OFF;
            } else {
              if ((dit_buffer) && (dah_buffer)) {
                // need to handle dit/dah priority here
                last_closure = DIT_CLOSURE_DAH_ON;
                dah_buffer = 0;
              }
            }
          }
          break;
      }
    } else {  // if (ultimatic_mode == ULTIMATIC_NORMAL)
     if ((dit_buffer) && (dah_buffer)) {   // dit or dah priority mode
       if (ultimatic_mode == ULTIMATIC_DIT_PRIORITY) {
         dah_buffer = 0;
       } else {
         dit_buffer = 0;
       }
     }
    } // if (ultimatic_mode == ULTIMATIC_NORMAL)
  } // if (configuration.keyer_mode == ULTIMATIC)
  #endif // OPTION_NO_ULTIMATIC

  if (configuration.keyer_mode == SINGLE_PADDLE){
    switch (last_closure) {
      case DIT_CLOSURE_DAH_OFF:
        if (dit_buffer) {
          if (dah_buffer) {
            dah_buffer = 0;
          } else {
            last_closure = DIT_CLOSURE_DAH_OFF;
          }
        } else {
          if (dah_buffer) {
            last_closure = DAH_CLOSURE_DIT_OFF;
          } else {
            last_closure = NO_CLOSURE;
          }
        }
        break;

      case DIT_CLOSURE_DAH_ON:

        if (dah_buffer) {
          if (dit_buffer) {
            last_closure = DAH_CLOSURE_DIT_ON;
            dit_buffer = 0;
          } else {
            last_closure = DAH_CLOSURE_DIT_OFF;
          }
        } else {
          if (!dit_buffer) {
            last_closure = NO_CLOSURE;
          }
        }
        break;

        

      case DAH_CLOSURE_DIT_OFF:
        if (dah_buffer) {
          if (dit_buffer) {
            dit_buffer = 0;
          } else {
            last_closure = DAH_CLOSURE_DIT_OFF;
          }
        } else {
          if (dit_buffer) {
            last_closure = DIT_CLOSURE_DAH_OFF;
          } else {
            last_closure = NO_CLOSURE;
          }
        }
        break;

      case DAH_CLOSURE_DIT_ON:
        if (dit_buffer) {
          if (dah_buffer) {
            last_closure = DIT_CLOSURE_DAH_ON;
            dah_buffer = 0;
          } else {
            last_closure = DIT_CLOSURE_DAH_OFF;
          }
        } else {
          if (!dah_buffer) {
            last_closure = NO_CLOSURE;
          }
        }
        break;

      case NO_CLOSURE:
        if ((dit_buffer) && (!dah_buffer)) {
          last_closure = DIT_CLOSURE_DAH_OFF;
        } else {
          if ((dah_buffer) && (!dit_buffer)) {
            last_closure = DAH_CLOSURE_DIT_OFF;
          } else {
            if ((dit_buffer) && (dah_buffer)) {
              // need to handle dit/dah priority here
              last_closure = DIT_CLOSURE_DAH_ON;
              dah_buffer = 0;
            }
          }
        }
        break;
    }
  } //if (configuration.keyer_mode == SINGLE_PADDLE)

  service_tx_inhibit_and_pause();

}

//-------------------------------------------------------------------------------------------------------

void ptt_key(){

  unsigned long ptt_activation_time = millis();
  byte all_delays_satisfied = 0;
  
  #ifdef FEATURE_SEQUENCER
    byte sequencer_1_ok = 0;
    byte sequencer_2_ok = 0;
    byte sequencer_3_ok = 0;
    byte sequencer_4_ok = 0;
    byte sequencer_5_ok = 0;
  #endif 

  if (configuration.ptt_disabled){return;}

  if (ptt_line_activated == 0) {   // if PTT is currently deactivated, bring it up and insert PTT lead time delay
    #ifdef FEATURE_SO2R_BASE
        if (current_tx_ptt_line && (configuration.ptt_buffer_hold_active || manual_ptt_invoke_ptt_input_pin)) {

          #if defined(FEATURE_WINKEY_EMULATION) && defined(OPTION_WINKEY_PINCONFIG_PTT_CONTROLS_PTT_LINE)
            if (winkey_pinconfig_ptt_bit){
              digitalWrite (configuration.current_ptt_line, ptt_line_active_state);
            }
          #else
            digitalWrite (configuration.current_ptt_line, ptt_line_active_state);  
          #endif // defined(FEATURE_WINKEY_EMULATION) && !defined(OPTION_WINKEY_PINCONFIG_PTT_CONTROLS_PTT_HOLD) 


          //digitalWrite (current_tx_ptt_line, ptt_line_active_state);

          //mydelay(configuration.ptt_lead_time[configuration.current_tx-1]);
          #ifdef FEATURE_SEQUENCER
            sequencer_ptt_inactive_time = 0;
          #endif  
        }
    #else
      if (configuration.current_ptt_line) {

          #if defined(FEATURE_WINKEY_EMULATION) && defined(OPTION_WINKEY_PINCONFIG_PTT_CONTROLS_PTT_LINE)
            if (winkey_pinconfig_ptt_bit){
              digitalWrite (configuration.current_ptt_line, ptt_line_active_state);
            }
          #else
            digitalWrite (configuration.current_ptt_line, ptt_line_active_state);  
          #endif // defined(FEATURE_WINKEY_EMULATION) && !defined(OPTION_WINKEY_PINCONFIG_PTT_CONTROLS_PTT_HOLD) 

        //digitalWrite (configuration.current_ptt_line, ptt_line_active_state); 



        #if defined(OPTION_WINKEY_2_SUPPORT) && defined(FEATURE_WINKEY_EMULATION)
          if ((wk2_both_tx_activated) && (ptt_tx_2)) {
            digitalWrite (ptt_tx_2, ptt_line_active_state);
          }
        #endif
         //mydelay(configuration.ptt_lead_time[configuration.current_tx-1]);
        #ifdef FEATURE_SEQUENCER
          sequencer_ptt_inactive_time = 0;
        #endif  
      }
    #endif //FEATURE_SO2R_BASE

    ptt_line_activated = 1;

    #ifdef FEATURE_SO2R_BASE
      so2r_set_rx();
    #endif

