K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
  if (ptt_input_pin){
    if ((digitalRead(ptt_input_pin) == ptt_input_pin_active_state)){
      if (!manual_ptt_invoke){
        manual_ptt_invoke = 1;
        manual_ptt_invoke_ptt_input_pin = 1;
        ptt_key();
        return; 
      }
    } else {
      if ((manual_ptt_invoke) && (manual_ptt_invoke_ptt_input_pin)){
        manual_ptt_invoke = 0;
        manual_ptt_invoke_ptt_input_pin = 0;
        if (!key_state){
          ptt_unkey();
        }
      }
    }  
  }


  #if !defined(FEATURE_WINKEY_EMULATION)
    if (key_state) {
      ptt_time = millis();
    } else {
      if ((ptt_line_activated) && (manual_ptt_invoke == 0)) {
        //if ((millis() - ptt_time) > ptt_tail_time) {
        if (last_sending_mode == MANUAL_SENDING) {
          #ifndef OPTION_INCLUDE_PTT_TAIL_FOR_MANUAL_SENDING

            // PTT Tail Time: N     PTT Hang Time: Y

            if ((millis() - ptt_time) >= ((configuration.length_wordspace*ptt_hang_time_wordspace_units)*float(1200/configuration.wpm)) ) {
              ptt_unkey();
            }          
          #else //ndef OPTION_INCLUDE_PTT_TAIL_FOR_MANUAL_SENDING
            #ifndef OPTION_EXCLUDE_PTT_HANG_TIME_FOR_MANUAL_SENDING

              // PTT Tail Time: Y     PTT Hang Time: Y

              if ((millis() - ptt_time) >= (((configuration.length_wordspace*ptt_hang_time_wordspace_units)*float(1200/configuration.wpm))+configuration.ptt_tail_time[configuration.current_tx-1])) {       
                ptt_unkey();
              }
            #else //OPTION_EXCLUDE_PTT_HANG_TIME_FOR_MANUAL_SENDING
            if ((millis() - ptt_time) >= configuration.ptt_tail_time[configuration.current_tx-1]) {  


              // PTT Tail Time: Y    PTT Hang Time: N

              ptt_unkey();
            }
            #endif //OPTION_EXCLUDE_PTT_HANG_TIME_FOR_MANUAL_SENDING
          #endif //ndef OPTION_INCLUDE_PTT_TAIL_FOR_MANUAL_SENDING
        } else { // automatic sending
          if (((millis() - ptt_time) > configuration.ptt_tail_time[configuration.current_tx-1]) && ( !configuration.ptt_buffer_hold_active || ((!send_buffer_bytes) && configuration.ptt_buffer_hold_active) || (pause_sending_buffer))){
            ptt_unkey();
          }
        }
      }
    }
  #else //FEATURE_WINKEY_EMULATION

    if (key_state) {
      ptt_time = millis();
    } else {
      if ((ptt_line_activated) && (manual_ptt_invoke == 0)) {
        //if ((millis() - ptt_time) > ptt_tail_time) {
        if (last_sending_mode == MANUAL_SENDING) {
          #ifndef OPTION_INCLUDE_PTT_TAIL_FOR_MANUAL_SENDING

            // PTT Tail Time: N     PTT Hang Time: Y

            if ((millis() - ptt_time) >= ((configuration.length_wordspace*ptt_hang_time_wordspace_units)*float(1200/configuration.wpm)) ) {
              ptt_unkey();
            }          
          #else //ndef OPTION_INCLUDE_PTT_TAIL_FOR_MANUAL_SENDING
            #ifndef OPTION_EXCLUDE_PTT_HANG_TIME_FOR_MANUAL_SENDING

              // PTT Tail Time: Y     PTT Hang Time: Y
              
            if (winkey_host_open){
              if ((millis() - ptt_time) >= (((configuration.length_wordspace*ptt_hang_time_wordspace_units)*float(1200/configuration.wpm))+ (int(winkey_session_ptt_tail) * 10) + (3 * (1200/configuration.wpm)) )) {       
                ptt_unkey();
              }
            } else { 
              if ((millis() - ptt_time) >= (((configuration.length_wordspace*ptt_hang_time_wordspace_units)*float(1200/configuration.wpm))+configuration.ptt_tail_time[configuration.current_tx-1])) {       
                ptt_unkey();
              }
            }



            #else //OPTION_EXCLUDE_PTT_HANG_TIME_FOR_MANUAL_SENDING
            if (winkey_host_open){
              if ((millis() - ptt_time) >= ((int(winkey_session_ptt_tail) * 10) + (3 * (1200/configuration.wpm)))) {  

                // PTT Tail Time: Y    PTT Hang Time: N

                ptt_unkey();
              }
            } else {
              if ((millis() - ptt_time) >= configuration.ptt_tail_time[configuration.current_tx-1]) {  


                // PTT Tail Time: Y    PTT Hang Time: N

                ptt_unkey();
              }
            }





            #endif //OPTION_EXCLUDE_PTT_HANG_TIME_FOR_MANUAL_SENDING
          #endif //ndef OPTION_INCLUDE_PTT_TAIL_FOR_MANUAL_SENDING
        } else { // automatic sending
          if (winkey_host_open){
            if (((millis() - ptt_time) > ((int(winkey_session_ptt_tail) * 10) + (3 * (1200/configuration.wpm)))) && ( !configuration.ptt_buffer_hold_active || ((!send_buffer_bytes) && configuration.ptt_buffer_hold_active) || (pause_sending_buffer))) {
              ptt_unkey();
            }
          } else {
            if (((millis() - ptt_time) > configuration.ptt_tail_time[configuration.current_tx-1]) && ( !configuration.ptt_buffer_hold_active || ((!send_buffer_bytes) && configuration.ptt_buffer_hold_active) || (pause_sending_buffer))){
              ptt_unkey();
            }            
          }  
        }
      }
    }
  #endif //FEATURE_WINKEY_EMULATION  

}

//-------------------------------------------------------------------------------------------------------
void write_settings_to_eeprom(int initialize_eeprom) {

  #if (!defined(ARDUINO_SAM_DUE) && \
   !defined(ARDUINO_ARCH_MBED) && \
   !defined(ARDUINO_RASPBERRY_PI_PICO_W) && \
   !defined(ARDUINO_RASPBERRY_PI_PICO)) || \
   (defined(ARDUINO_SAM_DUE) && \
   defined(FEATURE_EEPROM_E24C1024))

    if (initialize_eeprom) {
        //configuration.magic_number = eeprom_magic_number;
        EEPROM.write(0, eeprom_magic_number);
#ifdef FEATURE_MEMORIES
        initialize_eeprom_memories();
#endif  //FEATURE_MEMORIES  
    }
      const byte* p = (const byte*)(const void*)&configuration;
      unsigned int i;
      int ee = 1;  // starting point of configuration struct
      for (i = 0; i < sizeof(configuration); i++){
        EEPROM.write(ee++, *p++);  
      }
      #if defined(HARDWARE_ESP32_DEV)
      EEPROM.commit();;
      #endif       

      async_eeprom_write = 1;  // initiate an asynchronous eeprom write
  
  #endif //!defined(ARDUINO_SAM_DUE) || (defined(ARDUINO_SAM_DUE) && defined(FEATURE_EEPROM_E24C1024))

    #if defined(ARDUINO_RASPBERRY_PI_PICO_W) || defined(ARDUINO_RASPBERRY_PI_PICO)
      #if defined(DEBUG_EEPROM)
        debug_serial_port->println(F("write_settings_to_eeprom: ARDUINO_RASPBERRY_PI_PICO"));
      #endif
      EEPROM.write(0,eeprom_magic_number);
      EEPROM.commit();
      EEPROM.put(1, configuration);
      EEPROM.commit();
    #endif

    config_dirty = 0;
  }

//-------------------------------------------------------------------------------------------------------

void service_async_eeprom_write(){

