K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
  // This writes one byte out to EEPROM each time it is called

  static byte last_async_eeprom_write_status = 0;
  static int ee = 0;
  static unsigned int i = 0;
  static const byte* p;

  if ((async_eeprom_write) && (!send_buffer_bytes) && (!ptt_line_activated) && (!dit_buffer) && (!dah_buffer) && (paddle_pin_read(paddle_left) == HIGH)  && (paddle_pin_read(paddle_right) == HIGH)) {  
    if (last_async_eeprom_write_status){ // we have an ansynchronous write to eeprom in progress


      #if defined(_BOARD_PIC32_PINGUINO_) || defined(ARDUINO_SAMD_VARIANT_COMPLIANCE) || defined(HARDWARE_ESP32_DEV) //SP5IOU 20210802
        if (EEPROM.read(ee) != *p) {
          EEPROM.write(ee, *p);
        }
        ee++;
        p++;
      #if defined(HARDWARE_ESP32_DEV) //SP5IOU 20220123
        EEPROM.commit();
      #endif
      #else
        EEPROM.update(ee++, *p++);
      #endif

      if (i < sizeof(configuration)){
        #if defined(DEBUG_ASYNC_EEPROM_WRITE)
          debug_serial_port->print(F("service_async_eeprom_write: write: "));
          debug_serial_port->println(i);
        #endif       
        i++;
      } else { // we're done
        async_eeprom_write = 0;
        last_async_eeprom_write_status = 0;
        #if defined(ARDUINO_SAMD_VARIANT_COMPLIANCE) || defined(HARDWARE_ESP32_DEV) //SP5IOU 20220123
          EEPROM.commit();
        #endif       

        #if defined(DEBUG_ASYNC_EEPROM_WRITE)
          debug_serial_port->println(F("service_async_eeprom_write: complete"));
        #endif    
      }

    } else { // we don't have one in progress - initialize things

      p = (const byte*)(const void*)&configuration;
      ee = 1;  // starting point of configuration struct
      i = 0;
      last_async_eeprom_write_status = 1;
      #if defined(DEBUG_ASYNC_EEPROM_WRITE)
        debug_serial_port->println(F("service_async_eeprom_write: init"));
      #endif
    }
  }

}

//-------------------------------------------------------------------------------------------------------

int read_settings_from_eeprom() {

  // returns 0 if eeprom had valid settings, returns 1 if eeprom needs initialized

  #if defined(DEBUG_FORCE_RESET)
    return 1;
  #endif
  
  #if !defined(ARDUINO_SAM_DUE) || (defined(ARDUINO_SAM_DUE) && defined(FEATURE_EEPROM_E24C1024))

    #if defined(DEBUG_EEPROM_READ_SETTINGS)
      debug_serial_port->println(F("read_settings_from_eeprom: start"));
    #endif

    if (EEPROM.read(0) == eeprom_magic_number){

      #if defined(ARDUINO_RASPBERRY_PI_PICO_W) || defined(ARDUINO_RASPBERRY_PI_PICO)

        #if defined(DEBUG_EEPROM_READ_SETTINGS)
          debug_serial_port->println(F("read_settings_from_eeprom: ARDUINO_RASPBERRY_PI_PICO"));
        #endif
        EEPROM.get(1, configuration);
      #else
        byte* p = (byte*)(void*)&configuration;
        unsigned int i;
        int ee = 1; // starting point of configuration struct
        for (i = 0; i < sizeof(configuration); i++){
          #if defined(DEBUG_EEPROM_READ_SETTINGS)
            debug_serial_port->print(F("read_settings_from_eeprom: read: i:"));
            debug_serial_port->print(i);
            debug_serial_port->print(F(":"));
            debug_serial_port->print(EEPROM.read(ee));
            debug_serial_port->println();
          #endif
          *p++ = EEPROM.read(ee++);
        }
      #endif
    
      #ifndef FEATURE_SO2R_BASE
        switch_to_tx_silent(configuration.current_tx);
      #endif

      config_dirty = 0;

      #if defined(DEBUG_EEPROM_READ_SETTINGS)
        debug_serial_port->println(F("read_settings_from_eeprom: read complete"));
      #endif
      return 0;
    } else {
    #if defined DEBUG_SETUP
    debug_serial_port->println(F("Went here 10"));
    #endif
      #if defined(DEBUG_EEPROM_READ_SETTINGS)
        debug_serial_port->println(F("read_settings_from_eeprom: eeprom needs initialized"));
      #endif      
      return 1;
    }
  
  #endif //!defined(ARDUINO_SAM_DUE) || (defined(ARDUINO_SAM_DUE) && defined(FEATURE_EEPROM_E24C1024))

  #if defined(DEBUG_EEPROM_READ_SETTINGS)
    debug_serial_port->println(F("read_settings_from_eeprom: bypassed read - no eeprom"));
  #endif
     #if defined DEBUG_SETUP
    debug_serial_port->println(F("went here 11"));
    #endif
 
  return 1;

}

//-------------------------------------------------------------------------------------------------------

void check_dit_paddle()
{



  byte pin_value = 0;
  byte dit_paddle = 0;
  #ifdef OPTION_DIT_PADDLE_NO_SEND_ON_MEM_RPT
    static byte memory_rpt_interrupt_flag = 0;
  #endif

  if (configuration.paddle_mode == PADDLE_NORMAL) {
    dit_paddle = paddle_left;
  } else {
    dit_paddle = paddle_right;
  }

  pin_value = paddle_pin_read(dit_paddle);

  
  #if defined(FEATURE_USB_MOUSE) || defined(FEATURE_USB_KEYBOARD)
    if (usb_dit) {pin_value = 0;}
  #endif   
  
  #ifdef OPTION_DIT_PADDLE_NO_SEND_ON_MEM_RPT
    if (pin_value && memory_rpt_interrupt_flag) {
      memory_rpt_interrupt_flag = 0;
      sending_mode = MANUAL_SENDING;
      loop_element_lengths(3,0,configuration.wpm);
      dit_buffer = 0;
    }
  #endif
  
  #ifdef OPTION_DIT_PADDLE_NO_SEND_ON_MEM_RPT
    if ((pin_value == 0) && (memory_rpt_interrupt_flag == 0)) {
  #else
    if (pin_value == 0) {
  #endif
    #ifdef FEATURE_DEAD_OP_WATCHDOG
      if (dit_buffer == 0) {
        dit_counter++;
        dah_counter = 0;
      }
    #endif
    dit_buffer = 1;

    #if defined(OPTION_WINKEY_SEND_BREAKIN_STATUS_BYTE) && defined(FEATURE_WINKEY_EMULATION)
      if (!winkey_interrupted && winkey_host_open && !winkey_breakin_status_byte_inhibit){
        send_winkey_breakin_byte_flag = 1;
        // winkey_port_write(0xc2|winkey_sending|winkey_xoff); // 0xc2 - BREAKIN bit set high
        // winkey_interrupted = 1;

        // tone(sidetone_line,1000);
        // mydelay(500);
        // noTone(sidetone_line);

        dit_buffer = 0;
      }   
    #endif //defined(OPTION_WINKEY_SEND_BREAKIN_STATUS_BYTE) && defined(FEATURE_WINKEY_EMULATION) 


    #ifdef FEATURE_SLEEP
      last_activity_time = millis(); 
    #endif //FEATURE_SLEEP
    #ifdef FEATURE_LCD_BACKLIGHT_AUTO_DIM
      last_active_time = millis(); 
    #endif //FEATURE_LCD_BACKLIGHT_AUTO_DIM
    manual_ptt_invoke = 0;
    #ifdef FEATURE_MEMORIES
      if (repeat_memory < 255) {
        repeat_memory = 255;
        #ifdef OPTION_DIT_PADDLE_NO_SEND_ON_MEM_RPT
          dit_buffer = 0;
          while (!paddle_pin_read(dit_paddle)) {vTaskDelay(1 / portTICK_PERIOD_MS);};
          memory_rpt_interrupt_flag = 1;
        #endif
      }
    #endif
    clear_send_buffer();
  }



