K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
  void send_chars(char* buffer){

    int x = 0;

    while(buffer[x] != 0){
      send_char(buffer[x++],0);
    }
  }

#endif

//-------------------------------------------------------------------------------------------------------

#ifdef FEATURE_COMMAND_MODE
void command_mode() {

  keyer_machine_mode = KEYER_COMMAND_MODE;
  
  #ifdef DEBUG_COMMAND_MODE
    debug_serial_port->println(F("command_mode: entering"));
  #endif

  #ifdef OPTION_WATCHDOG_TIMER
    wdt_disable();
  #endif //OPTION_WATCHDOG_TIMER

  char weight_deci[] = "00";
  byte looping;
  byte button_that_was_pressed = 0;
  byte paddle_hit = 0;
  unsigned long last_element_time = 0;
  unsigned long cw_char;
  byte stay_in_command_mode = 1;
  byte speed_mode_before = speed_mode;
  speed_mode = SPEED_NORMAL;                 // put us in normal speed mode (life is too short to do command mode in QRSS)
  byte keyer_mode_before = configuration.keyer_mode;
  char c[4];
  if ((configuration.keyer_mode != IAMBIC_A) && (configuration.keyer_mode != IAMBIC_B) && (configuration.keyer_mode != ULTIMATIC)) {
  //if ((configuration.keyer_mode != IAMBIC_A) && (configuration.keyer_mode != IAMBIC_B)) {
    configuration.keyer_mode = IAMBIC_B;                   // we got to be in iambic mode (life is too short to make this work in bug mode)
  }

  // command_mode_disable_tx = 0;  //Removed disable TX state every time Command Mode is entered - now set to actual key_tx status on CM entry (WD9DMP)

  boop_beep();
  #ifdef command_mode_active_led
    if (command_mode_active_led) {digitalWrite(command_mode_active_led,HIGH);}
  #endif //command_mode_active_led

  #ifdef FEATURE_DISPLAY
    lcd_scroll_box_clear();
    if (LCD_COLUMNS < 9){
      lcd_center_print_timed("Cmd Mode", 0, default_display_msg_delay);
    } else {
      lcd_center_print_timed("Command Mode", 0, default_display_msg_delay);
    }
  #endif 

  #if defined(FEATURE_WINKEY_EMULATION) && defined(OPTION_WINKEY_SEND_BREAKIN_STATUS_BYTE)
    winkey_breakin_status_byte_inhibit = 1;
  #endif

  while (stay_in_command_mode) {
    vTaskDelay(1 / portTICK_PERIOD_MS);
    cw_char = 0;
    looping = 1;
    while (looping) {
      vTaskDelay(1 / portTICK_PERIOD_MS);
      int8_t button_temp = button_array.Pressed();

          #ifdef FEATURE_DISPLAY
            service_display();
          #endif

      #ifdef FEATURE_POTENTIOMETER
        if (configuration.pot_activated) {
          check_potentiometer();
        }
      #endif
      
      #ifdef FEATURE_ROTARY_ENCODER
        check_rotary_encoder();
      #endif //FEATURE_ROTARY_ENCODER    

      check_paddles();

      if (dit_buffer) {
        sending_mode = MANUAL_SENDING;
        send_dit();
        dit_buffer = 0;
        paddle_hit = 1;
        cw_char = (cw_char * 10) + 1;
        last_element_time = millis();
      }
      if (dah_buffer) {
        sending_mode = MANUAL_SENDING;
        send_dah();
        dah_buffer = 0;
        paddle_hit = 1;
        cw_char = (cw_char * 10) + 2;
        last_element_time = millis();
      }
      if ((paddle_hit) && (millis() > (last_element_time + (float(600/configuration.wpm) * length_letterspace)))) {
        #ifdef DEBUG_GET_CW_INPUT_FROM_USER
          debug_serial_port->println(F("get_cw_input_from_user: hit length_letterspace"));
        #endif
        looping = 0;
      }
      if (button_temp >=0 ){  // check for a button press
        looping = 0;
        cw_char = 9;
        mydelay(50);
        button_that_was_pressed = button_temp;
        while (button_array.Held(button_that_was_pressed)) {vTaskDelay(1 / portTICK_PERIOD_MS);}
      }

      #if defined(FEATURE_SERIAL)
        configuration.keyer_mode = keyer_mode_before;
        check_serial();
        if ((configuration.keyer_mode != IAMBIC_A) && (configuration.keyer_mode != IAMBIC_B) && (configuration.keyer_mode != ULTIMATIC)  && (configuration.keyer_mode != SINGLE_PADDLE)) {
          configuration.keyer_mode = IAMBIC_B;                   
        }
      #endif

    }               //while (looping)
// end new code

    #ifdef DEBUG_COMMAND_MODE
      debug_serial_port->print(F("command_mode: cwchar: "));
      debug_serial_port->println(cw_char);
    #endif
    if (cw_char > 0) {              // do the command      
      switch (cw_char) {
        case 12: // A - Iambic mode
          configuration.keyer_mode = IAMBIC_A;
          keyer_mode_before = IAMBIC_A;
          configuration.dit_buffer_off = 0;
          configuration.dah_buffer_off = 0;
          config_dirty = 1;
          #ifdef FEATURE_DISPLAY
            lcd_center_print_timed("Iambic A", 0, default_display_msg_delay);
          #endif
          #if defined(FEATURE_COMMAND_MODE_ENHANCED_CMD_ACKNOWLEDGEMENT) 
            send_chars((char*)command_a_iambic_a);  
          #else               
            send_char(command_mode_acknowledgement_character, 0);
          #endif  
          break;

        case 2111: // B - Iambic mode
          configuration.keyer_mode = IAMBIC_B;
          keyer_mode_before = IAMBIC_B;
          configuration.dit_buffer_off = 0;
          configuration.dah_buffer_off = 0;          
          config_dirty = 1;
          #ifdef FEATURE_DISPLAY
            lcd_center_print_timed("Iambic B", 0, default_display_msg_delay);
          #endif          
          #if defined(FEATURE_COMMAND_MODE_ENHANCED_CMD_ACKNOWLEDGEMENT) 
            send_chars((char*)command_b_iambic_b);  
          #else               
            send_char(command_mode_acknowledgement_character, 0);
          #endif  
          break;

        case 2121: // C - Single paddle mode
          configuration.keyer_mode = SINGLE_PADDLE;
          keyer_mode_before = SINGLE_PADDLE;
          config_dirty = 1;
          #ifdef FEATURE_DISPLAY
            if (LCD_COLUMNS < 9){
              lcd_center_print_timed("Sngl Pdl", 0, default_display_msg_delay);
            } else {
              lcd_center_print_timed("Single Paddle", 0, default_display_msg_delay);
            }
          #endif
          #if defined(FEATURE_COMMAND_MODE_ENHANCED_CMD_ACKNOWLEDGEMENT) 
            send_chars((char*)command_c_single_paddle);  
          #else               
            send_char(command_mode_acknowledgement_character, 0);
          #endif  
          break;          
        case 1:    // E - announce spEed
	        #ifdef FEATURE_DISPLAY
            #if defined(OPTION_ADVANCED_SPEED_DISPLAY)
              lcd_center_print_timed("Speed", 0, default_display_msg_delay);
              lcd_center_print_timed(String(configuration.wpm) + " wpm - " + (configuration.wpm*5) + " cpm ", 1, default_display_msg_delay);
              if (LCD_ROWS > 2) {
	              lcd_center_print_timed(String(1200/configuration.wpm) + ":" + (((1200/configuration.wpm)*configuration.dah_to_dit_ratio)/100) + "ms 1:" + (float(configuration.dah_to_dit_ratio)/100.00), 2, default_display_msg_delay);
	            }
            #else                                                                       // OPTION_ADVANCED_SPEED_DISPLAY_DISPLAY
              lcd_center_print_timed("Speed " + String(configuration.wpm) + " wpm", 0, default_display_msg_delay);
            #endif                                                                      // OPTION_ADVANCED_SPEED_DISPLAY_DISPLAY
          #endif                                                                        // FEATURE_DISPLAY
          mydelay(250);
          sprintf(c, "%d", configuration.wpm);
          send_char(c[0],KEYER_NORMAL);
          send_char(c[1],KEYER_NORMAL);
          break;
        #ifndef OPTION_NO_ULTIMATIC
        case 211: // D - Ultimatic mode
          configuration.keyer_mode = ULTIMATIC;
          keyer_mode_before = ULTIMATIC;
          configuration.dit_buffer_off = 1;
          configuration.dah_buffer_off = 1;           
          config_dirty = 1;
          #ifdef FEATURE_DISPLAY
            if (LCD_COLUMNS < 9) {
              lcd_center_print_timed("Ultimatc", 0, default_display_msg_delay);
            } else {
              lcd_center_print_timed("Ultimatic", 0, default_display_msg_delay);
            }          
          #endif                    
          #if defined(FEATURE_COMMAND_MODE_ENHANCED_CMD_ACKNOWLEDGEMENT) 
            send_chars((char*)command_d_ultimatic);  
          #else               
            send_char(command_mode_acknowledgement_character, 0);
          #endif  
          break; 
          #endif //OPTION_NO_ULTIMATIC
        #if !defined(OPTION_SIDETONE_DIGITAL_OUTPUT_NO_SQUARE_WAVE)
          case 1121: command_sidetone_freq_adj(); break;                    // F - adjust sidetone frequency
        #endif

	  case 221: // G - switch to buG mode
          configuration.keyer_mode = BUG;
          keyer_mode_before = BUG;
          config_dirty = 1;
          #ifdef FEATURE_DISPLAY
            lcd_center_print_timed("Bug", 0, default_display_msg_delay);
          #endif          
          send_char(command_mode_acknowledgement_character, 0);
          break;  

