K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
        case 2: command_tuning_mode(); break;                             // T - tuning mode
        #ifdef FEATURE_POTENTIOMETER
          case 1112:  // V - toggle pot active
            if (configuration.pot_activated) {
              configuration.pot_activated = 0; 
              #if defined(FEATURE_COMMAND_MODE_ENHANCED_CMD_ACKNOWLEDGEMENT) 
                send_chars((char*)command_v_potentiometer_off); 
              #endif
              #ifdef FEATURE_DISPLAY
                if (LCD_COLUMNS > 14) {
                  lcd_center_print_timed("Pot Deactivated", 0, default_display_msg_delay);                  
                } else {
                  lcd_center_print_timed("Pot Off", 0, default_display_msg_delay);
                }
              #endif             
            } else {
              configuration.pot_activated = 1;
              #if defined(FEATURE_COMMAND_MODE_ENHANCED_CMD_ACKNOWLEDGEMENT) 
                send_chars((char*)command_v_potentiometer_on); 
              #endif              
              #ifdef FEATURE_DISPLAY
                if (LCD_COLUMNS > 13){
                  lcd_center_print_timed("Pot Activated", 0, default_display_msg_delay);
                } else {
                  lcd_center_print_timed("Pot On", 0, default_display_msg_delay);
                }
              #endif 
            }
            config_dirty = 1;
            #if !defined(FEATURE_COMMAND_MODE_ENHANCED_CMD_ACKNOWLEDGEMENT) 
              send_char(command_mode_acknowledgement_character, 0);
            #endif
            break; 
        #endif

	  case 122: // W - change wpm
          command_speed_mode(COMMAND_SPEED_MODE_KEYER_WPM); 
          break;   

    #ifdef FEATURE_MEMORIES
      case 2122: command_set_mem_repeat_delay(); break; // Y - set memory repeat delay
    #endif  
 
	  case 2112: stay_in_command_mode = 0; break;     // X - exit command mode
        #ifdef FEATURE_AUTOSPACE
          case 2211: // Z - Autospace
            if (configuration.autospace_active) {
              configuration.autospace_active = 0;
              config_dirty = 1;
              #ifdef FEATURE_DISPLAY
                if (LCD_COLUMNS < 9){
                  lcd_center_print_timed("AutoSOff", 0, default_display_msg_delay);
                } else {
                  lcd_center_print_timed("Autospace Off", 0, default_display_msg_delay);
                }              
                send_char(command_mode_acknowledgement_character, 0);
              #else
                send_char('O',KEYER_NORMAL);
                send_char('F',KEYER_NORMAL);
                send_char('F',KEYER_NORMAL);
              #endif
            } else {
              configuration.autospace_active = 1;
              config_dirty = 1;
              #ifdef FEATURE_DISPLAY
                if (LCD_COLUMNS < 9){
                  lcd_center_print_timed("AutoS On", 0, default_display_msg_delay);
                } else {
                  lcd_center_print_timed("Autospace On", 0, default_display_msg_delay);
                }  
                send_char(command_mode_acknowledgement_character, 0);
              #else            
                send_char('O',KEYER_NORMAL);
                send_char('N',KEYER_NORMAL);
              #endif
            }
            break;
        #endif
//        #ifdef FEATURE_MEMORIES
//          case 12222: play_memory(0); break;
//          case 11222: play_memory(1); break;
//          case 11122: play_memory(2); break;
//          case 11112: play_memory(3); break;
//          case 11111: play_memory(4); break;
//        #endif

        #ifdef FEATURE_MEMORIES
          case 12222:
            if (number_of_memories > 0) {
              #ifdef FEATURE_DISPLAY
                lcd_center_print_timed("Memory #1", 0, default_display_msg_delay);
                #ifdef OPTION_DISPLAY_MEMORY_CONTENTS_COMMAND_MODE
                  command_display_memory(0);
                #endif                                                           // OPTION_DISPLAY_MEMORY_CONTENTS_COMMAND_MODE
              #endif                                                             // FEATURE_DISPLAY
              play_memory(0);
            } else {
              #ifdef FEATURE_DISPLAY
                if (LCD_COLUMNS > 17) lcd_center_print_timed("Invalid memory #1", 0, default_display_msg_delay);
                else if (LCD_COLUMNS > 13) lcd_center_print_timed("Invalid mem #1", 0, default_display_msg_delay);
              #endif                                                             // FEATURE_DISPLAY
              beep_boop();
            }
            break;

          case 11222:
            if (number_of_memories > 1) {
              #ifdef FEATURE_DISPLAY
                lcd_center_print_timed("Memory #2", 0, default_display_msg_delay);
                #ifdef OPTION_DISPLAY_MEMORY_CONTENTS_COMMAND_MODE
                  command_display_memory(1);
                #endif                                                           // OPTION_DISPLAY_MEMORY_CONTENTS_COMMAND_MODE
              #endif                                                             // FEATURE_DISPLAY
              play_memory(1);
            } else {
              #ifdef FEATURE_DISPLAY
                if (LCD_COLUMNS > 17) lcd_center_print_timed("Invalid memory #2", 0, default_display_msg_delay);
                else if (LCD_COLUMNS > 13) lcd_center_print_timed("Invalid mem #2", 0, default_display_msg_delay);
              #endif                                                             // FEATURE_DISPLAY
              beep_boop();
            }
            break;

	  case 11122:
            if (number_of_memories > 2) {
              #ifdef FEATURE_DISPLAY
                lcd_center_print_timed("Memory #3", 0, default_display_msg_delay);
                #ifdef OPTION_DISPLAY_MEMORY_CONTENTS_COMMAND_MODE
                  command_display_memory(2);
                #endif                                                           // OPTION_DISPLAY_MEMORY_CONTENTS_COMMAND_MODE
              #endif                                                             // FEATURE_DISPLAY
              play_memory(2);
            } else {
              #ifdef FEATURE_DISPLAY
                if (LCD_COLUMNS > 17) lcd_center_print_timed("Invalid memory #3", 0, default_display_msg_delay);
                else if (LCD_COLUMNS > 13) lcd_center_print_timed("Invalid mem #3", 0, default_display_msg_delay);
              #endif                                                             // FEATURE_DISPLAY
              beep_boop();
            }
            break;

	  case 11112:
            if (number_of_memories > 3) {
              #ifdef FEATURE_DISPLAY
                lcd_center_print_timed("Memory #4", 0, default_display_msg_delay);
                #ifdef OPTION_DISPLAY_MEMORY_CONTENTS_COMMAND_MODE
                  command_display_memory(3);
                #endif                                                           // OPTION_DISPLAY_MEMORY_CONTENTS_COMMAND_MODE
              #endif                                                             // FEATURE_DISPLAY
              play_memory(3);
            } else {
              #ifdef FEATURE_DISPLAY
                if (LCD_COLUMNS > 17) lcd_center_print_timed("Invalid memory #4", 0, default_display_msg_delay);
                else if (LCD_COLUMNS > 13) lcd_center_print_timed("Invalid mem #4", 0, default_display_msg_delay);
              #endif                                                             // FEATURE_DISPLAY
              beep_boop();
            }
            break;

	  case 11111:
            if (number_of_memories > 4) {
              #ifdef FEATURE_DISPLAY
                lcd_center_print_timed("Memory #5", 0, default_display_msg_delay);
                #ifdef OPTION_DISPLAY_MEMORY_CONTENTS_COMMAND_MODE
                  command_display_memory(4);
                #endif                                                           // OPTION_DISPLAY_MEMORY_CONTENTS_COMMAND_MODE
              #endif                                                             // FEATURE_DISPLAY
              play_memory(4);
            } else {
              #ifdef FEATURE_DISPLAY
                if (LCD_COLUMNS > 17) lcd_center_print_timed("Invalid memory #5", 0, default_display_msg_delay);
                else if (LCD_COLUMNS > 13) lcd_center_print_timed("Invalid mem #5", 0, default_display_msg_delay);
              #endif                                                             // FEATURE_DISPLAY
              beep_boop();
            }
            break;
        #endif                                                                   // FEATURE_MEMORIES

