K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
    case 21112: // - : enable / disable PTT                                                               
      if (configuration.ptt_disabled){
        configuration.ptt_disabled = 0; 
      } else {
        configuration.ptt_disabled = 1; 
      }
      config_dirty = 1;
      send_char(command_mode_acknowledgement_character, 0);
      break;

	case 121212:send_char(75,KEYER_NORMAL);send_char(51,KEYER_NORMAL);send_char(78,KEYER_NORMAL);send_char(71,KEYER_NORMAL);send_char(32,KEYER_NORMAL);
                    send_char(55,KEYER_NORMAL);send_char(51,KEYER_NORMAL);send_char(32,KEYER_NORMAL);send_char(69,KEYER_NORMAL);send_char(69,KEYER_NORMAL);
                    break;   

        #ifdef FEATURE_ALPHABET_SEND_PRACTICE // enhanced by Fred, VK2EFL
          case 111:   // S - Alphabet Send Practice
            #ifdef FEATURE_DISPLAY
               if (LCD_COLUMNS < 9){
                 lcd_center_print_timed("SendPrct", 0, default_display_msg_delay);
               } else {
                 lcd_center_print_timed("Send Practice", 0, default_display_msg_delay);
                 if (LCD_ROWS > 1){
                   lcd_center_print_timed("Cmd button to exit", 1, default_display_msg_delay);
                 }
               }
            #endif
            beep();
            command_alphabet_send_practice();
            stay_in_command_mode = 0;
            break;
        #endif                                //FEATURE_ALPHABET_SEND_PRACTICE
 
        #ifdef FEATURE_COMMAND_MODE_PROGRESSIVE_5_CHAR_ECHO_PRACTICE
          case 112:  // U - 5 Character Echo Practice
            command_progressive_5_char_echo_practice();
            stay_in_command_mode = 0;
            break;
        #endif //FEATURE_COMMAND_MODE_PROGRESSIVE_5_CHAR_PRACTICE

        case 112211:                                           // ? - status
          #ifdef FEATURE_DISPLAY
            lcd_center_print_timed("Status", 0, default_display_msg_delay);
            lcd_center_print_timed("wpm  " + String(configuration.wpm), 1, default_display_msg_delay);
            mydelay(250);
          #endif                                                         // FEATURE_DISPLAY

          sprintf(c, "%d", configuration.wpm);
          send_char(c[0],KEYER_NORMAL);
          send_char(c[1],KEYER_NORMAL);
          send_char(' ' ,KEYER_NORMAL);

          switch(keyer_mode_before) {
            case IAMBIC_A:
              #ifdef FEATURE_DISPLAY
                lcd_center_print_timed("mode  Iambic A", 1, default_display_msg_delay);
                mydelay(250);
              #endif                                                     // FEATURE_DISPLAY
              send_char('A',KEYER_NORMAL);
              break;
            case IAMBIC_B:
              #ifdef FEATURE_DISPLAY
                lcd_center_print_timed("mode  Iambic B", 1, default_display_msg_delay);
                mydelay(250);
              #endif                                                     // FEATURE_DISPLAY
              send_char('B',KEYER_NORMAL);
              break;
            case SINGLE_PADDLE:
              #ifdef FEATURE_DISPLAY
                lcd_center_print_timed("mode  Single Pdl", 1, default_display_msg_delay);
                mydelay(250);
              #endif                                                     // FEATURE_DISPLAY
              send_char('S',KEYER_NORMAL);
              break;

            #ifndef OPTION_NO_ULTIMATIC
            case ULTIMATIC:
              #ifdef FEATURE_DISPLAY
                lcd_center_print_timed("mode  Ultimatic", 1, default_display_msg_delay);
                mydelay(250);
              #endif                                                     // FEATURE_DISPLAY
              send_char('U',KEYER_NORMAL);
              break;
            #endif //OPTION_NO_ULTIMATIC
            case BUG:
              #ifdef FEATURE_DISPLAY
                lcd_center_print_timed("mode  Bug", 1, default_display_msg_delay);
                mydelay(250);
              #endif                                                     // FEATURE_DISPLAY
              send_char('G',KEYER_NORMAL);
              break;
          }                                                            // switch(keyer_mode_before)
          send_char(' ',KEYER_NORMAL);
          send_char(' ',KEYER_NORMAL);

          #ifdef FEATURE_DISPLAY
            lcd_center_print_timed("weighting  " + String(configuration.weighting), 1, default_display_msg_delay);
            mydelay(250);
          #endif                                                       // FEATURE_DISPLAY
          sprintf(c, "%d", configuration.weighting);
          send_char(c[0],KEYER_NORMAL);
          send_char(c[1],KEYER_NORMAL);
          send_char(' ',KEYER_NORMAL);

          #ifdef FEATURE_DISPLAY
            strcpy(weight_deci, "00");                                                      // reset the two character array
            if ((configuration.dah_to_dit_ratio % 100) != 0) {                              // test if it is X.00
              weight_deci[0] = ((configuration.dah_to_dit_ratio % 100) / 10) + '0';         // for cases where decimal part is 10 to 99
              weight_deci[1] = (configuration.dah_to_dit_ratio % 10) + '0';                 // get the single digit units part
            }                                                                               // end if ((configuration.dah_to_dit_ratio % 100) != 0)
            lcd_center_print_timed("dah:dit  " + String(configuration.dah_to_dit_ratio / 100) + "." + weight_deci, 1, default_display_msg_delay);
            mydelay(250);
          #endif                                                                            // FEATURE_DISPLAY
          sprintf(c, "%d", configuration.dah_to_dit_ratio);
          send_char(c[0],KEYER_NORMAL);
          send_char('.',KEYER_NORMAL);
          send_char(c[1],KEYER_NORMAL);
          send_char(c[2],KEYER_NORMAL);
          send_char(' ',KEYER_NORMAL);    
          break;

        case 9: // button was hit
                // Serial.print(F("Button - "));
                // Serial.println(button_that_was_pressed);

