K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
          #if defined(FEATURE_MEMORIES)
            if (button_that_was_pressed == 0){  // button 0 was hit - exit
              stay_in_command_mode = 0;
            } else {
              program_memory(button_that_was_pressed - 1); // a button other than 0 was pressed - program a memory
            }
          #else 
            stay_in_command_mode = 0;
          #endif
          break;                           
        default: // unknown command, send a ?
          #ifdef FEATURE_DISPLAY
            if (LCD_COLUMNS < 9){
              lcd_center_print_timed("???", 0, default_display_msg_delay); 
            } else {
              lcd_center_print_timed("Unknown command", 0, default_display_msg_delay); 
            }         
          #endif
          send_char('?',KEYER_NORMAL); 
          break;                                   
      }
    }
  }
  beep_boop();
  #if defined(FEATURE_WINKEY_EMULATION) && defined(OPTION_WINKEY_SEND_BREAKIN_STATUS_BYTE)
    winkey_breakin_status_byte_inhibit = 0;
  #endif  

  #ifdef command_mode_active_led
    if (command_mode_active_led) {digitalWrite(command_mode_active_led,LOW);}
  #endif //command_mode_active_led

  keyer_machine_mode = KEYER_NORMAL;
  //configuration.wpm = speed_wpm_before;  
  speed_mode = speed_mode_before;   // go back to whatever speed mode we were in before
  configuration.keyer_mode = keyer_mode_before;

  #ifdef DEBUG_COMMAND_MODE
    if (command_mode_disable_tx) {
      debug_serial_port->print(F("command_mode: command_mode_disable_tx set"));
    }
  #endif //DEBUG_COMMAND_MODE

  #if defined(FEATURE_PADDLE_ECHO)
    paddle_echo_buffer = 0;
  #endif

  #ifdef OPTION_WATCHDOG_TIMER
    wdt_enable(WDTO_4S);
  #endif //OPTION_WATCHDOG_TIMER

}
#endif //FEATURE_COMMAND_MODE

//-------------------------------------------------------------------------------------------------------

int read_memory(byte memory_number, char memory_char[LCD_COLUMNS]) {
  #if defined(FEATURE_DISPLAY) && defined(FEATURE_MEMORIES)
    byte eeprom_byte_read = 0;
    //static char memory_char[LCD_COLUMNS] = {};              // an array of char to hold the retrieved memory from EEPROM    
    int y,j,k;
    int fill_char;                                  // a flag that is set if we need to fill the char array with spaces
 
    y = k = j = fill_char = 0;
    for(y = (memory_start(memory_number)); y < (memory_start(memory_number)) + LCD_COLUMNS; y++) {
      eeprom_byte_read = EEPROM.read(y);                    // read memory characters from EEPROM
      if (eeprom_byte_read == 255) {
        fill_char = 1;           // if it is the 'end of stored memory' character set a flag
        k++;   // capture end for string length fucntions
      }
      if (!fill_char) memory_char[j] = eeprom_byte_read;    // save the retrieved character in the character array
      else memory_char[j] = ' ';                               // else fill the rest of the array with spaces            
      j++;                                                  // move to the next character to be stored in the array
    }    // end for loop
    static int len = j-k-3; // account for increments on both number, terminator
    if (len < 0) return 0;
    else return len; // send string length back to caller to avoid the trailing spaces                   
  #endif  // FEATURE_DISPLAY
} 

void command_display_memory(byte memory_number) {  
  char tmp_str[LCD_COLUMNS] = {};
  read_memory(memory_number, tmp_str);
  lcd_center_print_timed(tmp_str, 1, default_display_msg_delay); // write the retrieved char array to line 2 of LCD display
}
// end command_display_memory

//-------------------------------------------------------------------------------------------------------

#if defined(FEATURE_COMMAND_MODE_PROGRESSIVE_5_CHAR_ECHO_PRACTICE) && defined(FEATURE_COMMAND_MODE)
void command_progressive_5_char_echo_practice() {

  byte loop1 = 1;
  byte loop2 = 0;
  byte x = 0;
  byte user_send_loop = 0;
  String cw_to_send_to_user(10);
  char incoming_char = ' ';
  String user_sent_cw = "";
  byte paddle_hit = 0;
  unsigned long last_element_time = 0;
  unsigned long cw_char;
  byte speed_mode_before = speed_mode;
  byte keyer_mode_before = configuration.keyer_mode;
  byte progressive_step_counter;
  byte practice_mode;
  char word_buffer[10];

  speed_mode = SPEED_NORMAL;                 // put us in normal speed mode 
  if ((configuration.keyer_mode != IAMBIC_A) && (configuration.keyer_mode != IAMBIC_B)) {
    configuration.keyer_mode = IAMBIC_B;                   // we got to be in iambic mode (life is too short to make this work in bug mode)
  }  
  randomSeed(millis());

  #ifdef FEATURE_DISPLAY                   // enhanced by Fred, VK2EFL
    lcd_scroll_box_clear();
    if (LCD_COLUMNS > 17){
      lcd_center_print_timed("Receive / Transmit", 0, default_display_msg_delay);
      lcd_center_print_timed("5 Char Echo Practice", 1, default_display_msg_delay);
      if (LCD_ROWS > 2){
        lcd_center_print_timed("Cmd button to exit", 2, default_display_msg_delay);
      }
    } else {
      if (LCD_COLUMNS < 9){
        lcd_center_print_timed("RXTX 5Ch", 0, default_display_msg_delay);
        if (LCD_ROWS > 1){
          lcd_center_print_timed("EchoPrct", 1, default_display_msg_delay);
        }           
      } else {
        lcd_center_print_timed("RX / TX 5 Char", 0, default_display_msg_delay);
        if (LCD_ROWS > 1){
          lcd_center_print_timed("Echo Practice", 1, default_display_msg_delay);
        }        
      }
    }
    service_display();
  #else
    send_char('E',0);
    send_char('C',0);
    send_char('H',0);
    send_char('O',0);
    send_char(' ',0);
    send_char(' ',0);
    send_char(' ',0);
    beep();
    beep();
  #endif 

  while (loop1) {
    vTaskDelay(1 / portTICK_PERIOD_MS);
    // if (practice_mode_called == ECHO_MIXED){
    //   practice_mode = random(ECHO_2_CHAR_WORDS,ECHO_QSO_WORDS+1);
    // } else {
    //   practice_mode = practice_mode_called;
    // }

    // progressive_step_counter = 255;
    
    // switch (practice_mode){
    //   case CALLSIGN_INTERNATIONAL:
    //   case CALLSIGN_US:
    //   case CALLSIGN_EUROPEAN:
    //   case CALLSIGN_CANADA:
    //     cw_to_send_to_user = generate_callsign(practice_mode);
    //     break;
    //   case ECHO_PROGRESSIVE_5:
        cw_to_send_to_user = (char)random(65,91);
        cw_to_send_to_user.concat((char)random(65,91));
        cw_to_send_to_user.concat((char)random(65,91));
        cw_to_send_to_user.concat((char)random(65,91));
        cw_to_send_to_user.concat((char)random(65,91));
        progressive_step_counter = 1;
    //     break; 
    //   case ECHO_2_CHAR_WORDS: 
    //     //word_index = random(0,s2_size);  // min parm is inclusive, max parm is exclusive
    //     strcpy_P(word_buffer, (char*)pgm_read_dword(&(s2_table[random(0,s2_size)])));
    //     cw_to_send_to_user = word_buffer;
    //     break;
    //   case ECHO_3_CHAR_WORDS: 
    //     //word_index = random(0,s3_size);  // min parm is inclusive, max parm is exclusive
    //     strcpy_P(word_buffer, (char*)pgm_read_dword(&(s3_table[random(0,s3_size)])));
    //     cw_to_send_to_user = word_buffer;
    //     break;
    //   case ECHO_4_CHAR_WORDS: 
    //     //word_index = random(0,s4_size);  // min parm is inclusive, max parm is exclusive
    //     strcpy_P(word_buffer, (char*)pgm_read_dword(&(s4_table[random(0,s4_size)])));
    //     cw_to_send_to_user = word_buffer;
    //     break;    
    //   case ECHO_NAMES: 
    //     //word_index = random(0,name_size);  // min parm is inclusive, max parm is exclusive
    //     strcpy_P(word_buffer, (char*)pgm_read_dword(&(name_table[random(0,name_size)])));
    //     cw_to_send_to_user = word_buffer;
    //     break; 
    //   case ECHO_QSO_WORDS: 
    //     //word_index = random(0,qso_size);  // min parm is inclusive, max parm is exclusive
    //     strcpy_P(word_buffer, (char*)pgm_read_dword(&(qso_table[random(0,qso_size)])));
    //     cw_to_send_to_user = word_buffer;
    //     break; 
    // } //switch (practice_mode)
    
    loop2 = 1;
    while (loop2) {
      vTaskDelay(1 / portTICK_PERIOD_MS);
      user_send_loop = 1;
      user_sent_cw = "";
      cw_char = 0;
      x = 0;

      // send the CW to the user
      while ((x < (cw_to_send_to_user.length())) && (x < progressive_step_counter)) {
        vTaskDelay(1 / portTICK_PERIOD_MS);
        send_char(cw_to_send_to_user[x],KEYER_NORMAL);
        // test
        // port_to_use->print(cw_to_send_to_user[x]);
        //
        x++;
      }
      //port_to_use->println();

      while (user_send_loop) {
        vTaskDelay(1 / portTICK_PERIOD_MS);
        // get their paddle input

