K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
  }
  while (paddle_pin_read(paddle_left) == LOW || paddle_pin_read(paddle_right) == LOW || analogbuttonread(0) ) {vTaskDelay(1 / portTICK_PERIOD_MS);}  // wait for all lines to go high
          #if defined HARDWARE_ESP32_DEV //SP5IOU 20220123
            s_noTone(sidetone_line);
          #else
            noTone(sidetone_line);
          #endif
}
#endif                                                        //FEATURE_COMMAND_MODE

//-------------------------------------------------------------------------------------------------------
#ifdef FEATURE_COMMAND_MODE
void command_speed_mode(byte mode) {

  byte looping = 1;
  #ifndef FEATURE_DISPLAY
    static char c[4];
  #endif
  //static String wpm_string;
  
  if (mode == COMMAND_SPEED_MODE_KEYER_WPM){
    #ifdef FEATURE_DISPLAY
      if (LCD_COLUMNS < 9){
        lcd_center_print_timed("AdjSpeed", 0, default_display_msg_delay);
      } else {
        lcd_center_print_timed("Adjust Speed", 0, default_display_msg_delay); 
      }
    #endif
    keyer_machine_mode = KEYER_COMMAND_MODE_SPEED_OVERRIDE;
  } else {
    #ifdef FEATURE_DISPLAY
      if (LCD_COLUMNS < 9){
        lcd_center_print_timed("CmdSpeed", 0, default_display_msg_delay);
      } else {
        lcd_center_print_timed("Cmd Mode Speed", 0, default_display_msg_delay); 
      }    
    #endif  
  }         
  
  while (looping) {
    vTaskDelay(1 / portTICK_PERIOD_MS);
    send_dit();
    if ((paddle_pin_read(paddle_left) == LOW)) {
      if (mode == COMMAND_SPEED_MODE_KEYER_WPM) {
        #ifdef OPTION_SWAP_PADDLE_PARAMETER_CHANGE_DIRECTION
	  speed_change(-1);
	#else
	  speed_change(1);
	#endif                                      // OPTION_SWAP_PADDLE_PARAMETER_CHANGE_DIRECTION
      } else {
      #ifdef OPTION_SWAP_PADDLE_PARAMETER_CHANGE_DIRECTION
        speed_change_command_mode(-1);
      #else
        speed_change_command_mode(1);
      #endif                                        // OPTION_SWAP_PADDLE_PARAMETER_CHANGE_DIRECTION
      }                                             // endif (mode == COMMAND_SPEED_MODE_KEYER_WPM)
    }                                               // end while looping
    if ((paddle_pin_read(paddle_right) == LOW)) {
      if (mode == COMMAND_SPEED_MODE_KEYER_WPM) {
        #ifdef OPTION_SWAP_PADDLE_PARAMETER_CHANGE_DIRECTION
          speed_change(1);
	#else
          speed_change(-1);
	#endif                                      // OPTION_SWAP_PADDLE_PARAMETER_CHANGE_DIRECTION
      } else {
        #ifdef OPTION_SWAP_PADDLE_PARAMETER_CHANGE_DIRECTION
          speed_change_command_mode(1);
	#else
          speed_change_command_mode(-1);
	#endif                                      // OPTION_SWAP_PADDLE_PARAMETER_CHANGE_DIRECTION
      }
    }
    while ((paddle_pin_read(paddle_left) == LOW && paddle_pin_read(paddle_right) == LOW) || (analogbuttonread(0) ))  // if paddles are squeezed or button0 pressed - exit
    {
      vTaskDelay(1 / portTICK_PERIOD_MS);
      looping = 0;
    }

    #ifdef OPTION_WATCHDOG_TIMER
      wdt_reset();
    #endif  //OPTION_WATCHDOG_TIMER

  }

  keyer_machine_mode = KEYER_COMMAND_MODE;

  dit_buffer = 0;
  dah_buffer = 0;

  while (paddle_pin_read(paddle_left) == LOW || paddle_pin_read(paddle_right) == LOW || analogbuttonread(0) ) {vTaskDelay(1 / portTICK_PERIOD_MS);}  // wait for all lines to go high
  #ifndef FEATURE_DISPLAY
    // announce speed in CW
    if (mode == COMMAND_SPEED_MODE_KEYER_WPM){
      sprintf(c, "%d", configuration.wpm);
    } else {
      sprintf(c, "%d", configuration.wpm_command_mode);
    }  
    send_char(' ',KEYER_NORMAL);
    send_char(c[0],KEYER_NORMAL);
    send_char(c[1],KEYER_NORMAL);    
  #endif

}
#endif //FEATURE_COMMAND_MODE
	
//------------------------------------------------------------------
	
#ifndef FEATURE_DISPLAY
void send_tx() {

  send_char('T',KEYER_NORMAL);
  send_char('X',KEYER_NORMAL);
}
#endif

//------------------------------------------------------------------

void switch_to_tx_silent(byte tx) {
  switch (tx) {
   case 1: if ((ptt_tx_1) || (tx_key_line_1)) { configuration.current_ptt_line = ptt_tx_1; current_tx_key_line = tx_key_line_1; configuration.current_tx = 1; config_dirty = 1; } break;
   case 2: if ((ptt_tx_2) || (tx_key_line_2)) { configuration.current_ptt_line = ptt_tx_2; current_tx_key_line = tx_key_line_2; configuration.current_tx = 2; config_dirty = 1; } break;
   case 3: if ((ptt_tx_3) || (tx_key_line_3)) { configuration.current_ptt_line = ptt_tx_3; current_tx_key_line = tx_key_line_3; configuration.current_tx = 3; config_dirty = 1; } break;
   case 4: if ((ptt_tx_4) || (tx_key_line_4)) { configuration.current_ptt_line = ptt_tx_4; current_tx_key_line = tx_key_line_4; configuration.current_tx = 4; config_dirty = 1; } break;
   case 5: if ((ptt_tx_5) || (tx_key_line_5)) { configuration.current_ptt_line = ptt_tx_5; current_tx_key_line = tx_key_line_5; configuration.current_tx = 5; config_dirty = 1; } break;
   case 6: if ((ptt_tx_6) || (tx_key_line_6)) { configuration.current_ptt_line = ptt_tx_6; current_tx_key_line = tx_key_line_6; configuration.current_tx = 6; config_dirty = 1; } break;
  }
  
}

//------------------------------------------------------------------
void switch_to_tx(byte tx)
{
  #ifdef FEATURE_MEMORIES
  repeat_memory = 255;
  #endif

  #ifdef FEATURE_DISPLAY        
  switch (tx) {
   case 1: if ((ptt_tx_1) || (tx_key_line_1)) { switch_to_tx_silent(1); lcd_center_print_timed("TX 1", 0, default_display_msg_delay); } break;
   case 2: if ((ptt_tx_2) || (tx_key_line_2)) { switch_to_tx_silent(2); lcd_center_print_timed("TX 2", 0, default_display_msg_delay); } break;
   case 3: if ((ptt_tx_3) || (tx_key_line_3)) { switch_to_tx_silent(3); lcd_center_print_timed("TX 3", 0, default_display_msg_delay); } break;
   case 4: if ((ptt_tx_4) || (tx_key_line_4)) { switch_to_tx_silent(4); lcd_center_print_timed("TX 4", 0, default_display_msg_delay); } break;
   case 5: if ((ptt_tx_5) || (tx_key_line_5)) { switch_to_tx_silent(5); lcd_center_print_timed("TX 5", 0, default_display_msg_delay); } break;
   case 6: if ((ptt_tx_6) || (tx_key_line_6)) { switch_to_tx_silent(6); lcd_center_print_timed("TX 6", 0, default_display_msg_delay); } break;
  }
  #else
  switch (tx) {
   case 1: if ((ptt_tx_1) || (tx_key_line_1)) { switch_to_tx_silent(1); send_tx(); send_char('1',KEYER_NORMAL); } break;
   case 2: if ((ptt_tx_2) || (tx_key_line_2)) { switch_to_tx_silent(2); send_tx(); send_char('2',KEYER_NORMAL); } break;
   case 3: if ((ptt_tx_3) || (tx_key_line_3)) { switch_to_tx_silent(3); send_tx(); send_char('3',KEYER_NORMAL); } break;
   case 4: if ((ptt_tx_4) || (tx_key_line_4)) { switch_to_tx_silent(4); send_tx(); send_char('4',KEYER_NORMAL); } break;
   case 5: if ((ptt_tx_5) || (tx_key_line_5)) { switch_to_tx_silent(5); send_tx(); send_char('5',KEYER_NORMAL); } break;
   case 6: if ((ptt_tx_6) || (tx_key_line_6)) { switch_to_tx_silent(6); send_tx(); send_char('6',KEYER_NORMAL); } break;
  }
  #endif
}

//------------------------------------------------------------------

#if defined(FEATURE_MEMORIES) && defined(FEATURE_BUTTONS)
void check_the_memory_buttons()
{

  byte analogbuttontemp = button_array.Pressed();
  if ((analogbuttontemp > 0) && (analogbuttontemp < (number_of_memories + 1)) && ((millis() - button_last_add_to_send_buffer_time) > 400)) {
    add_to_send_buffer(SERIAL_SEND_BUFFER_MEMORY_NUMBER);
    add_to_send_buffer(analogbuttontemp - 1);
    button_last_add_to_send_buffer_time = millis();
  }
}
#endif

//------------------------------------------------------------------

void initialize_analog_button_array() {
#ifdef FEATURE_BUTTONS  
  
