K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
}

//-------------------------------------------------------------------------------------------------------

void beep()
{
  #if !defined(OPTION_SIDETONE_DIGITAL_OUTPUT_NO_SQUARE_WAVE)
    // #if defined(FEATURE_SINEWAVE_SIDETONE)
    //   tone(sidetone_line, hz_high_beep);
    //   mydelay(200);
    //   noTone(sidetone_line);
    // #else
    #if defined(HARDWARE_ESP32_DEV) //SP5IOU 20220123
      #ifdef FEATURE_M5STACK_CORE2a
        M5.Speaker.tone(hz_high_beep, 200);
      #else  
        s_tone(sidetone_line, hz_high_beep, 200);
      #endif
    #endif
  #else
    if (sidetone_line) {
      digitalWrite(sidetone_line, sidetone_line_active_state);
      mydelay(200);
      digitalWrite(sidetone_line, sidetone_line_inactive_state);
    }
  #endif
}

//-------------------------------------------------------------------------------------------------------

void boop()
{
    #if !defined(OPTION_SIDETONE_DIGITAL_OUTPUT_NO_SQUARE_WAVE)
        #if defined(HARDWARE_ESP32_DEV) //SP5IOU 20220123
            #ifdef FEATURE_M5STACK_CORE2a
                M5.Speaker.tone(hz_low_beep, 100);
            #else
                s_tone(sidetone_line,hz_low_beep,100);                                              // generate a tone on the speaker pin
            #endif
        #else  
            tone(sidetone_line, hz_low_beep, 0);
            mydelay(100);
            noTone(sidetone_line);
        #endif

    #else
        if (sidetone_line) {
        digitalWrite(sidetone_line, sidetone_line_active_state);
        mydelay(100);
        digitalWrite(sidetone_line, sidetone_line_inactive_state);
        }
    #endif    
}

//-------------------------------------------------------------------------------------------------------

void beep_boop()
{
    #if !defined(OPTION_SIDETONE_DIGITAL_OUTPUT_NO_SQUARE_WAVE)
        #if defined(HARDWARE_ESP32_DEV) //SP5IOU 20220123
            #ifdef FEATURE_M5STACK_CORE2a
                M5.Speaker.tone(hz_high_beep, 100);
                M5.Speaker.tone(hz_low_beep, 100);
            #else
                s_tone(sidetone_line,hz_high_beep,100);                                              // generate a tone on the speaker pin
                s_tone(sidetone_line,hz_low_beep,100);                                              // generate a tone on the speaker pin
            #endif
        #else  
            tone(sidetone_line, hz_high_beep);
            mydelay(100);
            tone(sidetone_line, hz_low_beep);
            mydelay(100);
            noTone(sidetone_line);
        #endif
    #else
            if (sidetone_line) {
            digitalWrite(sidetone_line, sidetone_line_active_state);
            mydelay(200);
            digitalWrite(sidetone_line, sidetone_line_inactive_state);
            }
    #endif     
}

//-------------------------------------------------------------------------------------------------------

void boop_beep()
{
  #if !defined(OPTION_SIDETONE_DIGITAL_OUTPUT_NO_SQUARE_WAVE)
    #if defined(HARDWARE_ESP32_DEV) //SP5IOU 20220123
        #ifdef FEATURE_M5STACK_CORE2a
            M5.Speaker.tone(hz_low_beep, 100);
            M5.Speaker.tone(hz_high_beep, 100);
        #else
            s_tone(sidetone_line,hz_low_beep,100);                                              // generate a tone on the speaker pin
            s_tone(sidetone_line,hz_high_beep,100);                                              // generate a tone on the speaker pin
        #endif
     #else  
        tone(sidetone_line, hz_low_beep);
        mydelay(100);
        tone(sidetone_line, hz_high_beep);
        mydelay(100);
        noTone(sidetone_line);
    #endif
  #else
    if (sidetone_line) {
      digitalWrite(sidetone_line, sidetone_line_active_state);
      mydelay(200);
      digitalWrite(sidetone_line, sidetone_line_inactive_state);
    }
  #endif         
}



//-------------------------------------------------------------------------------------------------------
void send_the_dits_and_dahs(char const * cw_to_send){


  /* American Morse - Special Symbols

    ~  long dah (4 units)

    =  very long dah (5 units)

    &  an extra space (1 unit)

  */ 

  //debug_serial_port->println(F("send_the_dits_and_dahs()"));

  sending_mode = AUTOMATIC_SENDING;


  #if defined(FEATURE_SERIAL) && !defined(OPTION_DISABLE_SERIAL_PORT_CHECKING_WHILE_SENDING_CW)
    dump_current_character_flag = 0;
  #endif  

  #if defined(FEATURE_FARNSWORTH)
    //float additional_intercharacter_time_ms;
  #endif

  for (int x = 0;x < 12;x++){
    switch(cw_to_send[x]){
      case '.': send_dit(); break;
      case '-': send_dah(); break;
      #if defined(FEATURE_AMERICAN_MORSE)  // this is a bit of a hack, but who cares!  :-)
      case '~': 

        being_sent = SENDING_DAH;
        tx_and_sidetone_key(1);
        if ((tx_key_dah) && (key_tx)) {digitalWrite(tx_key_dah,tx_key_dit_and_dah_pins_active_state);}
        loop_element_lengths((float(4.0)*(float(configuration.weighting)/50)),configuration.keying_compensation,configuration.wpm);
        if ((tx_key_dah) && (key_tx)) {digitalWrite(tx_key_dah,tx_key_dit_and_dah_pins_inactive_state);}
        tx_and_sidetone_key(0);
        loop_element_lengths((4.0-(3.0*(float(configuration.weighting)/50))),(-1.0*configuration.keying_compensation),configuration.wpm);
        break;

      case '=': 
        being_sent = SENDING_DAH;
        tx_and_sidetone_key(1);
        if ((tx_key_dah) && (key_tx)) {digitalWrite(tx_key_dah,tx_key_dit_and_dah_pins_active_state);}
        loop_element_lengths((float(5.0)*(float(configuration.weighting)/50)),configuration.keying_compensation,configuration.wpm);
        if ((tx_key_dah) && (key_tx)) {digitalWrite(tx_key_dah,tx_key_dit_and_dah_pins_inactive_state);}
        tx_and_sidetone_key(0);
        loop_element_lengths((4.0-(3.0*(float(configuration.weighting)/50))),(-1.0*configuration.keying_compensation),configuration.wpm);
        break;

      case '&': 
        loop_element_lengths((4.0-(3.0*(float(configuration.weighting)/50))),(-1.0*configuration.keying_compensation),configuration.wpm);
        break;            
      #endif //FEATURE_AMERICAN_MORSE
      default: 
        //return; 
        x = 12;
        break;
    }

    if ((dit_buffer || dah_buffer || sending_mode == AUTOMATIC_SENDING_INTERRUPTED) && (keyer_machine_mode != BEACON)){
      dit_buffer = 0;
      dah_buffer = 0;
      //debug_serial_port->println(F("send_the_dits_and_dahs: AUTOMATIC_SENDING_INTERRUPTED"));
      //return;
      x = 12;
    }
    #if defined(FEATURE_SERIAL)
      check_serial();
      #if !defined(OPTION_DISABLE_SERIAL_PORT_CHECKING_WHILE_SENDING_CW)
        if (dump_current_character_flag){
          x = 12;
        }
      #endif
    #endif

    #ifdef OPTION_WATCHDOG_TIMER
      wdt_reset();
    #endif  //OPTION_WATCHDOG_TIMER

