K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
          }  //switch (cw_char)
        
        #endif      
      } 
    }
  }

}

//-------------------------------------------------------------------------------------------------------

int uppercase (int charbytein)
{
  if (((charbytein > 96) && (charbytein < 123)) || ((charbytein > 223) && (charbytein < 255))) {
    charbytein = charbytein - 32;
  }
  if (charbytein == 158) { charbytein = 142; }  // ž -> Ž
  if (charbytein == 154) { charbytein = 138; }  // š -> Š
  
  return charbytein;
}

//-------------------------------------------------------------------------------------------------------
#if defined(FEATURE_SERIAL)
#ifdef FEATURE_COMMAND_LINE_INTERFACE
void serial_qrss_mode()
{
  byte looping = 1;
  byte incoming_serial_byte;
  byte numbers[4];
  byte numberindex = 0;
  String numberstring;
  byte error =0;

  while (looping) {
    vTaskDelay(1 / portTICK_PERIOD_MS);
    if (primary_serial_port->available() == 0) {        // wait for the next keystroke
      if (keyer_machine_mode == KEYER_NORMAL) {          // might as well do something while we're waiting
        check_paddles();
        service_dit_dah_buffers();
        //check_the_memory_buttons();
      }
    } else {

      incoming_serial_byte = primary_serial_port->read();
      if ((incoming_serial_byte > 47) && (incoming_serial_byte < 58)) {    // ascii 48-57 = "0" - "9")
        numberstring = numberstring + incoming_serial_byte;
        numbers[numberindex] = incoming_serial_byte;
//        primary_serial_port->write("numberindex:");
//        primary_serial_port->print(numberindex,DEC);
//        primary_serial_port->write("     numbers:");
//        primary_serial_port->println(numbers[numberindex],DEC);
        numberindex++;
        if (numberindex > 2)
          {
            looping = 0;
            error = 1;
          }
      } else {
        if (incoming_serial_byte == 13) {   // carriage return - get out
          looping = 0;
        } else {                 // bogus input - error out
          looping = 0;
          error = 1;
        }
      }
    }
  }

  if (error) {
    primary_serial_port->println(F("Error..."));
    while (primary_serial_port->available() > 0) { 
      vTaskDelay(1 / portTICK_PERIOD_MS);
      incoming_serial_byte = primary_serial_port->read(); 
    }  // clear out buffer
    return;
  } else {
    primary_serial_port->print(F("Setting keyer to QRSS Mode. Dit length: "));
    primary_serial_port->print(numberstring);
    primary_serial_port->println(F(" seconds"));
    int y = 1;
    int set_dit_length = 0;
    for (int x = (numberindex - 1); x >= 0 ; x = x - 1) {
      set_dit_length = set_dit_length + ((numbers[x]-48) * y);
      y = y * 10;
    }
    qrss_dit_length = set_dit_length;
    speed_mode = SPEED_QRSS;
  }

}
#endif
#endif
//-------------------------------------------------------------------------------------------------------

void service_send_buffer(byte no_print)
{
  // send one character out of the send buffer

  #ifdef DEBUG_LOOP
    debug_serial_port->println(F("loop: entering service_send_buffer"));
  #endif       

  static unsigned long timed_command_end_time;
  static byte timed_command_in_progress = 0;

  #if defined(DEBUG_SERVICE_SEND_BUFFER)

    byte no_bytes_flag = 0;

    if (send_buffer_bytes > 0){
      debug_serial_port->print(F("service_send_buffer: enter:"));
      for (int x = 0;x < send_buffer_bytes;x++){
        debug_serial_port->write(send_buffer_array[x]);
        debug_serial_port->print(F("["));
        debug_serial_port->print(send_buffer_array[x]);
        debug_serial_port->print(F("]"));
      }
      debug_serial_port->println();        
    } else {
      no_bytes_flag = 1;
    }
    Serial.flush();
  #endif


  if (service_tx_inhibit_and_pause() == 1){
    #if defined(DEBUG_SERVICE_SEND_BUFFER)
      debug_serial_port->println(F("service_send_buffer: tx_inhib"));
    #endif
    return;
    
  }


  #ifdef FEATURE_MEMORIES
    play_memory_prempt = 0;
  #endif


  if (send_buffer_status == SERIAL_SEND_BUFFER_NORMAL) {
    if ((send_buffer_bytes) && (pause_sending_buffer == 0)) {
      #ifdef FEATURE_SLEEP
        last_activity_time = millis(); 
      #endif //FEATURE_SLEEP
      #ifdef FEATURE_LCD_BACKLIGHT_AUTO_DIM
        last_active_time = millis(); 
      #endif //FEATURE_LCD_BACKLIGHT_AUTO_DIM

      if ((send_buffer_array[0] > SERIAL_SEND_BUFFER_SPECIAL_START) && (send_buffer_array[0] < SERIAL_SEND_BUFFER_SPECIAL_END)) {

        #if defined(DEBUG_SERVICE_SEND_BUFFER)
          debug_serial_port->println(F("service_send_buffer: SERIAL_SEND_BUFFER_SPECIAL"));
        #endif


        if (send_buffer_array[0] == SERIAL_SEND_BUFFER_HOLD_SEND) {

          #if defined(DEBUG_SERVICE_SEND_BUFFER)
            debug_serial_port->println(F("service_send_buffer: SERIAL_SEND_BUFFER_HOLD_SEND"));
          #endif

          send_buffer_status = SERIAL_SEND_BUFFER_HOLD;
          remove_from_send_buffer();
        }

        if (send_buffer_array[0] == SERIAL_SEND_BUFFER_HOLD_SEND_RELEASE) {

          #if defined(DEBUG_SERVICE_SEND_BUFFER)
            debug_serial_port->println(F("service_send_buffer: SERIAL_SEND_BUFFER_HOLD_SEND_RELEASE"));
          #endif

          remove_from_send_buffer();
        }

        if (send_buffer_array[0] == SERIAL_SEND_BUFFER_MEMORY_NUMBER) {

          #if defined(DEBUG_SERVICE_SEND_BUFFER)
            debug_serial_port->println(F("service_send_buffer: SERIAL_SEND_BUFFER_MEMORY_NUMBER"));
          #endif

          #ifdef DEBUG_SEND_BUFFER
            debug_serial_port->println(F("service_send_buffer: SERIAL_SEND_BUFFER_MEMORY_NUMBER"));
          #endif
          #ifdef FEATURE_WINKEY_EMULATION
            if (winkey_sending && winkey_host_open) {
              #if !defined(OPTION_WINKEY_UCXLOG_SUPRESS_C4_STATUS_BYTE)
                winkey_port_write(0xc0|winkey_sending|winkey_xoff,0);
              #endif
              winkey_interrupted = 1;
             }
          #endif
          remove_from_send_buffer();
          if (send_buffer_bytes) {
            if (send_buffer_array[0] < number_of_memories) {
              #ifdef FEATURE_MEMORIES
                play_memory(send_buffer_array[0]);
              #endif
            }
            remove_from_send_buffer();
          }
        }

        if (send_buffer_array[0] == SERIAL_SEND_BUFFER_WPM_CHANGE) {  // two bytes for wpm
          //remove_from_send_buffer();
          #if defined(DEBUG_SERVICE_SEND_BUFFER)
            debug_serial_port->println(F("service_send_buffer: SERIAL_SEND_BUFFER_WPM_CHANGE"));
          #endif
          if (send_buffer_bytes > 2) {
            #if defined(DEBUG_SERVICE_SEND_BUFFER)
              debug_serial_port->println(F("service_send_buffer: SERIAL_SEND_BUFFER_WPM_CHANGE: send_buffer_bytes>2"));
            #endif
            remove_from_send_buffer();
            #ifdef FEATURE_WINKEY_EMULATION
              if ((winkey_host_open) && (winkey_speed_state == WINKEY_UNBUFFERED_SPEED)){
                winkey_speed_state = WINKEY_BUFFERED_SPEED;
                #if defined(DEBUG_SERVICE_SEND_BUFFER)
                  debug_serial_port->println(F("service_send_buffer: winkey_speed_state = WINKEY_BUFFERED_SPEED"));
                #endif
                winkey_last_unbuffered_speed_wpm = configuration.wpm;
              }
            #endif
            configuration.wpm = send_buffer_array[0] * 256;
            remove_from_send_buffer();
            configuration.wpm = configuration.wpm + send_buffer_array[0];
            remove_from_send_buffer();
            
            #ifdef FEATURE_LED_RING
              update_led_ring();
            #endif //FEATURE_LED_RING            
            
          } else {
            #if defined(DEBUG_SERVICE_SEND_BUFFER)
              debug_serial_port->println(F("service_send_buffer:SERIAL_SEND_BUFFER_WPM_CHANGE < 2"));
            #endif
          }

          #if defined(DEBUG_SERVICE_SEND_BUFFER)
            debug_serial_port->print(F("service_send_buffer: SERIAL_SEND_BUFFER_WPM_CHANGE: exit send_buffer_bytes:"));
            debug_serial_port->println(send_buffer_bytes);
          #endif

