K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
        #ifdef FEATURE_DISPLAY
          if (lcd_send_echo) {
            display_scroll_print_char(send_buffer_array[0]);
            service_display();
          }
        #endif //FEATURE_DISPLAY

        #if defined(DEBUG_SERVICE_SEND_BUFFER)
          debug_serial_port->print(F("service_send_buffer: send_char:"));
          debug_serial_port->write(send_buffer_array[0]);
          debug_serial_port->println();
          Serial.flush();
        #endif

        send_char(send_buffer_array[0],KEYER_NORMAL);  //****************

        #ifdef FEATURE_WINKEY_EMULATION
          if ((primary_serial_port_mode == SERIAL_WINKEY_EMULATION) && (winkey_serial_echo) && (winkey_host_open) && (!no_print) && (!cw_send_echo_inhibit)){
            #if defined(OPTION_WINKEY_ECHO_7C_BYTE)
              if (send_buffer_array[0] > 30) {winkey_port_write(send_buffer_array[0],0);}
            #else
              if ((send_buffer_array[0]!= 0x7C) && (send_buffer_array[0] > 30)) {winkey_port_write(send_buffer_array[0],0);}
            #endif
          }
        #endif //FEATURE_WINKEY_EMULATION

        if (!pause_sending_buffer){

          #if defined(DEBUG_SERVICE_SEND_BUFFER)
            debug_serial_port->println(F("service_send_buffer: after send_char: remove_from_send_buffer"));
            if (no_bytes_flag){
              debug_serial_port->println(F("service_send_buffer: no_bytes_flag"));
            }
            Serial.flush();
          #endif

          if (!((send_buffer_array[0] > SERIAL_SEND_BUFFER_SPECIAL_START) && (send_buffer_array[0] < SERIAL_SEND_BUFFER_SPECIAL_END))){ // this is a friggin hack to fix something I can't explain with SO2R - Goody 20191217
            remove_from_send_buffer();

          #if defined(DEBUG_SERVICE_SEND_BUFFER)
            debug_serial_port->println(F("service_send_buffer: after send_char: remove_from_send_buffer"));
            if (no_bytes_flag){
              debug_serial_port->println(F("service_send_buffer: no_bytes_flag"));
            }
            Serial.flush();
          #endif


          } else {

          #if defined(DEBUG_SERVICE_SEND_BUFFER)
            debug_serial_port->println(F("service_send_buffer: snagged errant remove_from_send_buffer"));
            Serial.flush();
          #endif
          }

        }
      }
    }  //if ((send_buffer_bytes) && (pause_sending_buffer == 0))

  } else {   //if (send_buffer_status == SERIAL_SEND_BUFFER_NORMAL)

    if (send_buffer_status == SERIAL_SEND_BUFFER_TIMED_COMMAND) {    // we're in a timed command

      if ((timed_command_in_progress == SERIAL_SEND_BUFFER_TIMED_KEY_DOWN) && (millis() > timed_command_end_time)) {
        sending_mode = AUTOMATIC_SENDING;
        tx_and_sidetone_key(0);
        timed_command_in_progress = 0;
        send_buffer_status = SERIAL_SEND_BUFFER_NORMAL;

        #if defined(DEBUG_SERVICE_SEND_BUFFER)
          debug_serial_port->println(F("service_send_buffer: SERIAL_SEND_BUFFER_TIMED_KEY_DOWN->SERIAL_SEND_BUFFER_NORMAL"));
        #endif

      }

      if ((timed_command_in_progress == SERIAL_SEND_BUFFER_TIMED_WAIT) && (millis() > timed_command_end_time)) {
        timed_command_in_progress = 0;
        send_buffer_status = SERIAL_SEND_BUFFER_NORMAL;

        #if defined(DEBUG_SERVICE_SEND_BUFFER)
          debug_serial_port->println(F("service_send_buffer: SERIAL_SEND_BUFFER_TIMED_WAIT->SERIAL_SEND_BUFFER_NORMAL"));
        #endif

      }

    }

    if (send_buffer_status == SERIAL_SEND_BUFFER_HOLD) {  // we're in a send hold ; see if there's a SERIAL_SEND_BUFFER_HOLD_SEND_RELEASE in the buffer
      if (send_buffer_bytes == 0) {
        send_buffer_status = SERIAL_SEND_BUFFER_NORMAL;  // this should never happen, but what the hell, we'll catch it here if it ever does happen
      } else {
        for (int z = 0; z < send_buffer_bytes; z++) {
          if (send_buffer_array[z] ==  SERIAL_SEND_BUFFER_HOLD_SEND_RELEASE) {
            send_buffer_status = SERIAL_SEND_BUFFER_NORMAL;
            z = send_buffer_bytes;
          }
        }
      }
    }

  }  //if (send_buffer_status == SERIAL_SEND_BUFFER_NORMAL)

  //if the paddles are hit, dump the buffer
  check_paddles();
  if (((dit_buffer || dah_buffer) && (send_buffer_bytes)) && (keyer_machine_mode != BEACON)) {

    #if defined(DEBUG_SERVICE_SEND_BUFFER)
      debug_serial_port->println(F("service_send_buffer: buffer dump"));
    #endif

    clear_send_buffer();
    send_buffer_status = SERIAL_SEND_BUFFER_NORMAL;
    dit_buffer = 0;
    dah_buffer = 0;    
    #ifdef FEATURE_MEMORIES
      repeat_memory = 255;
    #endif
    #ifdef FEATURE_WINKEY_EMULATION
      if (winkey_sending && winkey_host_open) {
        winkey_port_write(0xc2|winkey_sending|winkey_xoff,0); // 0xc2 - BREAKIN bit set high
        winkey_interrupted = 1;
      }
    #endif
  }

}

//-------------------------------------------------------------------------------------------------------
void clear_send_buffer()
{
  #ifdef FEATURE_WINKEY_EMULATION
    winkey_xoff=0;
  #endif 
  send_buffer_bytes = 0;
}

//-------------------------------------------------------------------------------------------------------
void remove_from_send_buffer()
{
  
  #ifdef FEATURE_WINKEY_EMULATION
    if ((send_buffer_bytes < winkey_xon_threshold) && winkey_xoff && winkey_host_open) {
      winkey_xoff=0;
      winkey_port_write(0xc0|winkey_sending|winkey_xoff,0); //send status /XOFF
    }
  #endif
  
  if (send_buffer_bytes) {
    send_buffer_bytes--;
  }
  if (send_buffer_bytes) {
    for (int x = 0;x < send_buffer_bytes;x++) {
      send_buffer_array[x] = send_buffer_array[x+1];
    }
    #if defined(FEATURE_WINKEY_EMULATION) && defined(OPTION_WINKEY_FREQUENT_STATUS_REPORT)
      winkey_port_write(0xc0|winkey_sending|winkey_xoff,0);
    #endif
  }

  #if defined(DEBUG_SERVICE_SEND_BUFFER)
    debug_serial_port->print(F("remove_from_send_buffer: send_buffer_bytes:"));
    debug_serial_port->println(send_buffer_bytes);
    debug_serial_port->print(F("send_buffer:"));
    for (int x = 0;x < send_buffer_bytes;x++){
      debug_serial_port->write(send_buffer_array[x]);
      debug_serial_port->print(F("["));
      debug_serial_port->print(send_buffer_array[x]);
      debug_serial_port->print(F("]"));
    }
    debug_serial_port->println();    
  #endif

