K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
  // 2 - speed
  if (configuration.wpm > 99) {
    winkey_port_write(99,1);
  } else {
    byte_to_send = configuration.wpm;
    winkey_port_write(byte_to_send,1);
  }

  // 3 - sidetone
  switch(configuration.hz_sidetone) {
    case WINKEY_SIDETONE_1 : winkey_port_write(1,1); break;
    case WINKEY_SIDETONE_2 : winkey_port_write(2,1); break;
    case WINKEY_SIDETONE_3 : winkey_port_write(3,1); break;
    case WINKEY_SIDETONE_4 : winkey_port_write(4,1); break;
    case WINKEY_SIDETONE_5 : winkey_port_write(5,1); break;
    case WINKEY_SIDETONE_6 : winkey_port_write(6,1); break;
    case WINKEY_SIDETONE_7 : winkey_port_write(7,1); break;
    case WINKEY_SIDETONE_8 : winkey_port_write(8,1); break;
    case WINKEY_SIDETONE_9 : winkey_port_write(9,1); break;
    case WINKEY_SIDETONE_10 : winkey_port_write(10,1); break;
    default: winkey_port_write(5,1); break;
  }

  // 4 - weight
  winkey_port_write(configuration.weighting,1);

  // 5 - ptt lead
  if (configuration.ptt_lead_time[configuration.current_tx-1] < 256){
    winkey_port_write(configuration.ptt_lead_time[configuration.current_tx-1]/10,1);
  } else {
    winkey_port_write(255,1);
  }

  // 6 - ptt tail
  //if (configuration.ptt_tail_time[configuration.current_tx-1] < 256){
    //winkey_port_write((configuration.ptt_tail_time[configuration.current_tx-1] - (3*int(1200/configuration.wpm)))/10,1);
    winkey_port_write(winkey_session_ptt_tail,1);
  // } else {
  //   winkey_port_write(winkey_port_write(255,1);
  // }

  // 7 - pot min wpm
  #ifdef FEATURE_POTENTIOMETER
    winkey_port_write(pot_wpm_low_value,1);
  #else
    winkey_port_write(15,1);
  #endif

  // 8 - pot wpm range
  #ifdef FEATURE_POTENTIOMETER
    winkey_port_write(pot_wpm_high_value - pot_wpm_low_value,1);
  #else
    winkey_port_write(20,1);
  #endif

  // 9 - 1st extension
  winkey_port_write(first_extension_time,1);

  // 10 - compensation
  winkey_port_write(configuration.keying_compensation,1);

  // 11 - farnsworth wpm
  #ifdef FEATURE_FARNSWORTH
    winkey_port_write(configuration.wpm_farnsworth,1);
  #else
    winkey_port_write(zero,1);
  #endif

  // 12 - paddle setpoint
  winkey_port_write(50,1);  // default value

  // 13 - dah to dit ratio
  winkey_port_write(50,1);  // TODO -backwards calculate

  // 14 - pin config
  #ifdef OPTION_WINKEY_2_SUPPORT
    byte_to_send = 0;
    if (configuration.current_ptt_line != 0) {byte_to_send = byte_to_send | 1;}
    if ((configuration.sidetone_mode == SIDETONE_ON) || (configuration.sidetone_mode == SIDETONE_PADDLE_ONLY)) {byte_to_send = byte_to_send | 2;}
    if (current_tx_key_line == tx_key_line_1) {byte_to_send = byte_to_send | 4;}
    if (current_tx_key_line == tx_key_line_2) {byte_to_send = byte_to_send | 8;}
    #ifndef FEATURE_SO2R_BASE
      if (wk2_both_tx_activated) {byte_to_send = byte_to_send | 12;}
    #endif

    #ifndef OPTION_NO_ULTIMATIC
    if (ultimatic_mode == ULTIMATIC_DIT_PRIORITY) {byte_to_send = byte_to_send | 128;}
    if (ultimatic_mode == ULTIMATIC_DAH_PRIORITY) {byte_to_send = byte_to_send | 64;}  
    #endif

    if (ptt_hang_time_wordspace_units == 1.33) {byte_to_send = byte_to_send | 16;}
    if (ptt_hang_time_wordspace_units == 1.66) {byte_to_send = byte_to_send | 32;}
    if (ptt_hang_time_wordspace_units == 2.0) {byte_to_send = byte_to_send | 48;}
    winkey_port_write(byte_to_send,1);
  #else
    winkey_port_write(5,1); // default value
  #endif

  // 15 - pot range
  #ifdef OPTION_WINKEY_2_SUPPORT
    winkey_port_write(zero,1);
  #else
    winkey_port_write(0xFF,1);
  #endif

}
#endif


//-------------------------------------------------------------------------------------------------------

#if defined(FEATURE_SERIAL) && defined(FEATURE_WINKEY_EMULATION) && defined(OPTION_WINKEY_2_SUPPORT)

void winkey_eeprom_download() {
  
  byte zero = 0;
  unsigned int x = 0;
  unsigned int bytes_sent = 0;
  
  winkey_port_write(0xA5,1); // 01 magic byte
  winkey_admin_get_values_command(); // 02-16
  
  winkey_port_write(byte(configuration.wpm),1); // 17 cmdwpm
  bytes_sent = 17;
  
  //pad the rest with zeros    
  for (x = 0;x < (256-bytes_sent); x++) {
    winkey_port_write(zero,1);
  }  
}
#endif //defined(FEATURE_SERIAL) && defined(FEATURE_WINKEY_EMULATION) && defined(OPTION_WINKEY_2_SUPPORT)


//-------------------------------------------------------------------------------------------------------

#ifdef FEATURE_WINKEY_EMULATION
void winkey_port_write(byte byte_to_send,byte override_filter){

  #ifdef DEBUG_WINKEY_PORT_WRITE
  if ((byte_to_send > 4) && (byte_to_send < 31)){
    boop();
    mydelay(500);
    boop();
    mydelay(500);
    boop();
    //return;
  }
  #endif

  if (((byte_to_send > 4) && (byte_to_send < 31)) && (!override_filter)){
    #ifdef DEBUG_WINKEY
      debug_serial_port->print(F("Winkey Port TX: FILTERED: "));    
      if ((byte_to_send > 31) && (byte_to_send < 127)){
        debug_serial_port->write(byte_to_send);
      } else {
        debug_serial_port->print(F("."));
      }
      debug_serial_port->print(F(" ["));
      debug_serial_port->print(byte_to_send);
      debug_serial_port->print(F("] [0x"));
      debug_serial_port->print(byte_to_send,HEX);
      debug_serial_port->println(F("]"));
    #endif
    return;
  }

  primary_serial_port->write(byte_to_send);
  #ifdef DEBUG_WINKEY
    debug_serial_port->print(F("Winkey Port TX: "));    
    if ((byte_to_send > 31) && (byte_to_send < 127)){
      debug_serial_port->write(byte_to_send);
    } else {
      debug_serial_port->print(F("."));
    }
    debug_serial_port->print(F(" ["));
    debug_serial_port->print(byte_to_send);
    debug_serial_port->print(F("] [0x"));
    debug_serial_port->print(byte_to_send,HEX);
    debug_serial_port->println(F("]"));
  #endif
}

#endif //FEATURE_WINKEY_EMULATION

//-------------------------------------------------------------------------------------------------------

#ifdef FEATURE_WINKEY_EMULATION
void service_winkey(byte action) {
   
  static byte winkey_status = WINKEY_NO_COMMAND_IN_PROGRESS;
  static int winkey_parmcount = 0;
  static unsigned long winkey_last_activity;
  byte status_byte_to_send;
  static byte winkey_paddle_echo_space_sent = 1;

