K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
        byte serial_buffer_position_to_overwrite;

        if (winkey_buffer_pointer > 0) {
          serial_buffer_position_to_overwrite = send_buffer_bytes - (winkey_buffer_counter - winkey_buffer_pointer) - 1;
          if ((send_buffer_bytes) && (serial_buffer_position_to_overwrite < send_buffer_bytes )) {

            #ifdef DEBUG_WINKEY
              debug_serial_port->print(F("service_winkey:serial_buffer_position_to_overwrite:"));
              debug_serial_port->print(serial_buffer_position_to_overwrite);
              debug_serial_port->print(F(":"));
              debug_serial_port->write(incoming_serial_byte);
              debug_serial_port->println();
            #endif //DEBUG_WINKEY 
            send_buffer_array[serial_buffer_position_to_overwrite] = incoming_serial_byte;
          }
          winkey_buffer_pointer++;
        } else {

          add_to_send_buffer(incoming_serial_byte);

          #ifdef DEBUG_WINKEY
            debug_serial_port->print(F("service_winkey:add_to_send_buffer:"));
            debug_serial_port->write(incoming_serial_byte);
            debug_serial_port->print(F(" send_buffer_bytes:"));
            debug_serial_port->println(send_buffer_bytes);
          #endif //DEBUG_WINKEY 

          #if defined(OPTION_WINKEY_INTERRUPTS_MEMORY_REPEAT) && defined(FEATURE_MEMORIES)
            play_memory_prempt = 1;
            repeat_memory = 255;
          #endif
          winkey_buffer_counter++;

        }

        if (!winkey_sending) {
          #ifdef DEBUG_WINKEY
            debug_serial_port->println(F("service_winkey:status byte:starting to send"));
          #endif //DEBUG_WINKEY          
          winkey_sending=0x04;
          #if !defined(OPTION_WINKEY_UCXLOG_SUPRESS_C4_STATUS_BYTE)
            winkey_port_write(0xc4|winkey_sending|winkey_xoff,0);  // tell the client we're starting to send
          #endif //OPTION_WINKEY_UCXLOG_SUPRESS_C4_STATUS_BYTE
          #ifdef FEATURE_MEMORIES
            repeat_memory = 255;
          #endif
        }
      } else {
        
        #ifdef OPTION_WINKEY_STRICT_HOST_OPEN
          if ((winkey_host_open) || (incoming_serial_byte == 0)) {
        #endif
        
        switch (incoming_serial_byte) {
          case 0x00:
            winkey_status = WINKEY_ADMIN_COMMAND;
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:ADMIN_CMD"));
            #endif //DEBUG_WINKEY
            break;
          case 0x01:
            winkey_status = WINKEY_SIDETONE_FREQ_COMMAND;
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:WINKEY_SIDETONE_FREQ_COMMAND"));
            #endif //DEBUG_WINKEY               
            break;
          case 0x02:  // speed command - unbuffered
            winkey_status = WINKEY_UNBUFFERED_SPEED_COMMAND;
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:WINKEY_UNBUFFERED_SPEED_COMMAND"));
            #endif //DEBUG_WINKEY               
            break;
          case 0x03:  // weighting
            winkey_status = WINKEY_WEIGHTING_COMMAND;
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:WINKEY_WEIGHTING_COMMAND"));
            #endif //DEBUG_WINKEY               
            break;
          case 0x04: // PTT lead and tail time
            winkey_status = WINKEY_PTT_TIMES_PARM1_COMMAND;
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:WINKEY_PTT_TIMES_PARM1_COMMAND"));
            #endif //DEBUG_WINKEY               
            break;
          case 0x05:     // speed pot set
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:WINKEY_SET_POT_PARM1_COMMAND"));
            #endif //DEBUG_WINKEY
            winkey_status = WINKEY_SET_POT_PARM1_COMMAND;
            break;
          case 0x06:
            winkey_status = WINKEY_PAUSE_COMMAND;
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:WINKEY_PAUSE_COMMAND"));
            #endif //DEBUG_WINKEY               
            break;
          case 0x07:
            #ifdef FEATURE_POTENTIOMETER
              winkey_port_write(((pot_value_wpm()-pot_wpm_low_value)|128),0);
            #else
              winkey_port_write((byte(configuration.wpm-pot_wpm_low_value)|128),0);
            #endif
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:report pot"));
            #endif //DEBUG_WINKEY               
            break;
          case 0x08:    // backspace command
            if (send_buffer_bytes) {
              send_buffer_bytes--;
            }
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:backspace"));
            #endif //DEBUG_WINKEY               
            break;
          case 0x09:
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:WINKEY_SET_PINCONFIG_COMMAND"));
            #endif //DEBUG_WINKEY             
            winkey_status = WINKEY_SET_PINCONFIG_COMMAND;
            break;
          case 0x0a:                 // 0A - clear buffer - no parms
            // #ifdef DEBUG_WINKEY
            //   debug_serial_port->println(F("service_winkey:0A clear buff"));
            // #endif //DEBUG_WINKEY             
            clear_send_buffer();
            if (winkey_sending) {
              //clear_send_buffer();
              winkey_sending = 0;
              winkey_port_write(0xc0|winkey_sending|winkey_xoff,0);
            }
            pause_sending_buffer = 0;
            winkey_buffer_counter = 0;
            winkey_buffer_pointer = 0;
            #if !defined(OPTION_DISABLE_SERIAL_PORT_CHECKING_WHILE_SENDING_CW)
              loop_element_lengths_breakout_flag = 0;
            #endif
            #ifdef FEATURE_MEMORIES
              repeat_memory = 255;
            #endif
            sending_mode = AUTOMATIC_SENDING;
            manual_ptt_invoke = 0;
            tx_and_sidetone_key(0); 
            winkey_speed_state = WINKEY_UNBUFFERED_SPEED;
            configuration.wpm = winkey_last_unbuffered_speed_wpm;   
            #ifdef DEBUG_WINKEY
              debug_serial_port->print(F("service_winkey:0A clearbuff send_buffer_bytes:"));
              debug_serial_port->println(send_buffer_bytes);
            #endif //DEBUG_WINKEY 
            break;
          case 0x0b:
            winkey_status = WINKEY_KEY_COMMAND;
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:WINKEY_KEY_COMMAND"));
            #endif //DEBUG_WINKEY              
            break;
          case 0x0c:
            winkey_status = WINKEY_HSCW_COMMAND;
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:WINKEY_HSCW_COMMAND"));
            #endif //DEBUG_WINKEY                 
            break;
          case 0x0d:
            winkey_status = WINKEY_FARNSWORTH_COMMAND;
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:WINKEY_FARNSWORTH_COMMAND"));
            #endif //DEBUG_WINKEY                 
            break;
          case 0x0e:
            winkey_status = WINKEY_SETMODE_COMMAND;
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:WINKEY_SETMODE_COMMAND"));
            #endif //DEBUG_WINKEY                 
            break;
          case 0x0f:  // bulk load of defaults
            winkey_status = WINKEY_LOAD_SETTINGS_PARM_1_COMMAND;
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:WINKEY_LOAD_SETTINGS_PARM_1_COMMAND"));
            #endif //DEBUG_WINKEY                 
            break;
          case 0x10:
            winkey_status = WINKEY_FIRST_EXTENSION_COMMAND;
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:WINKEY_FIRST_EXTENSION_COMMAND"));
            #endif //DEBUG_WINKEY                 
            break;
          case 0x11:
            winkey_status = WINKEY_KEYING_COMPENSATION_COMMAND;
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:WINKEY_KEYING_COMPENSATION_COMMAND"));
            #endif //DEBUG_WINKEY                 
            break;
          case 0x12:
            winkey_status = WINKEY_UNSUPPORTED_COMMAND;
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:0x12unsupport"));
            #endif //DEBUG_WINKEY     
            winkey_parmcount = 1;
            break;
          case 0x13:  // NULL command
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:0x13null"));
            #endif //DEBUG_WINKEY               
            break;
          case 0x14:
            winkey_status = WINKEY_SOFTWARE_PADDLE_COMMAND;
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:WINKEY_SOFTWARE_PADDLE_COMMAND"));
            #endif //DEBUG_WINKEY                 
            break;
          case 0x15:  // report status
            #ifndef OPTION_WINKEY_IGNORE_FIRST_STATUS_REQUEST //--------------------
              status_byte_to_send = 0xc0|winkey_sending|winkey_xoff;
              if (send_buffer_status == SERIAL_SEND_BUFFER_TIMED_COMMAND) {
                status_byte_to_send = status_byte_to_send | 16;
              }
              winkey_port_write(status_byte_to_send,0);
              #ifdef DEBUG_WINKEY
                debug_serial_port->print(F("service_winkey:0x15 rpt status:"));
                debug_serial_port->println(status_byte_to_send);
              #endif //DEBUG_WINKEY  
            #else //OPTION_WINKEY_IGNORE_FIRST_STATUS_REQUEST ------------------------
              if (ignored_first_status_request){
                status_byte_to_send = 0xc0|winkey_sending|winkey_xoff;
                if (send_buffer_status == SERIAL_SEND_BUFFER_TIMED_COMMAND) {
                  status_byte_to_send = status_byte_to_send | 16;
                }
                winkey_port_write(status_byte_to_send,0);
                #ifdef DEBUG_WINKEY
                debug_serial_port->print(F("service_winkey:0x15 rpt status:"));
                debug_serial_port->println(status_byte_to_send);
                #endif //DEBUG_WINKEY 
                } else {
                  ignored_first_status_request = 1;
                  #ifdef DEBUG_WINKEY
                  debug_serial_port->println(F("service_winkey:ignored first 0x15 status request"));
                  #endif //DEBUG_WINKEY                
                }
            #endif //OPTION_WINKEY_IGNORE_FIRST_STATUS_REQUEST -------------------- 

            break;
          case 0x16:  // Pointer operation
            winkey_status = WINKEY_POINTER_COMMAND;
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:WINKEY_POINTER_COMMAND"));
            #endif //DEBUG_WINKEY                 
            break;
          case 0x17:  // dit to dah ratio
            winkey_status = WINKEY_DAH_TO_DIT_RATIO_COMMAND;
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:WINKEY_DAH_TO_DIT_RATIO_COMMAND"));
            #endif //DEBUG_WINKEY                 
            break;
          // start of buffered commands ------------------------------
          case 0x18:   //buffer PTT on/off
            winkey_status = WINKEY_BUFFFERED_PTT_COMMMAND;
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:WINKEY_BUFFFERED_PTT_COMMMAND"));
            #endif //DEBUG_WINKEY            
            break;
          case 0x19:
            winkey_status = WINKEY_KEY_BUFFERED_COMMAND;
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:WINKEY_KEY_BUFFERED_COMMAND"));
            #endif //DEBUG_WINKEY            
            break;
          case 0x1a:
            winkey_status = WINKEY_WAIT_BUFFERED_COMMAND;
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:WINKEY_WAIT_BUFFERED_COMMAND"));
            #endif //DEBUG_WINKEY            
            break;
          case 0x1b:
            winkey_status = WINKEY_MERGE_COMMAND;
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:WINKEY_MERGE_COMMAND"));
            #endif //DEBUG_WINKEY            
            break;
          case 0x1c:      // speed command - buffered
             winkey_status = WINKEY_BUFFERED_SPEED_COMMAND;
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:WINKEY_BUFFERED_SPEED_COMMAND"));
            #endif //DEBUG_WINKEY             
            break;
          case 0x1d:
            winkey_status = WINKEY_BUFFERED_HSCW_COMMAND;
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:WINKEY_BUFFERED_HSCW_COMMAND"));
            #endif //DEBUG_WINKEY            
            break;
          case 0x1e:  // cancel buffered speed command - buffered

            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:WINKEY_CANCEL_BUFFERED_SPEED_COMMAND"));
            #endif //DEBUG_WINKEY     

            if (winkey_speed_state == WINKEY_BUFFERED_SPEED){
              add_to_send_buffer(SERIAL_SEND_BUFFER_WPM_CHANGE);
              add_to_send_buffer(0);
              add_to_send_buffer((byte)winkey_last_unbuffered_speed_wpm);
              winkey_speed_state = WINKEY_UNBUFFERED_SPEED;
              #ifdef DEBUG_WINKEY
                debug_serial_port->println(F("service_winkey:winkey_speed_state = WINKEY_UNBUFFERED_SPEED"));
              #endif //DEBUG_WINKEY 
            } else {
              #ifdef DEBUG_WINKEY
                debug_serial_port->println(F("service_winkey:WINKEY_CANCEL_BUFFERED_SPEED_COMMAND: no action"));
              #endif //DEBUG_WINKEY         
            }       
            winkey_status = WINKEY_NO_COMMAND_IN_PROGRESS;
            break;
          case 0x1f:  // buffered NOP - no need to do anything
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:1F NOP"));
            #endif //DEBUG_WINKEY          
            break;

          #ifdef OPTION_WINKEY_EXTENDED_COMMANDS_WITH_DOLLAR_SIGNS
            case 36:
              winkey_status = WINKEY_EXTENDED_COMMAND;
              beep();
              #ifdef DEBUG_WINKEY
                debug_serial_port->println(F("service_winkey:WINKEY_EXTENDED_COMMAND"));
              #endif //DEBUG_WINKEY  
              break;
          #endif //OPTION_WINKEY_EXTENDED_COMMANDS_WITH_DOLLAR_SIGNS
        } //switch (incoming_serial_byte)
        
        #ifdef OPTION_WINKEY_STRICT_HOST_OPEN
        } //if ((winkey_host_open) || (incoming_serial_byte == 0))
        #endif
        
