K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
              for (uint8_t i=0; i<sizeof(device_info); i++) {
                winkey_port_write(device_info[i], 1);
              }

              static const byte *name = (byte *)SO2R_DEVICE_NAME;
              for (uint8_t i=0; i<sizeof(SO2R_DEVICE_NAME); i++) {
                winkey_port_write(name[i], 1);
              }

              static const byte *version = (byte *)CODE_VERSION;
              for (uint8_t i=0; i<sizeof(CODE_VERSION); i++) {
                winkey_port_write(version[i], 1);
              }
              winkey_status = WINKEY_NO_COMMAND_IN_PROGRESS;
              break;

            case 0xFF: // No-op
              debug_serial_port->println(F("service_winkey:NO-OP"));
              winkey_status = WINKEY_NO_COMMAND_IN_PROGRESS;
              break;

          #endif //FEATURE_SO2R_BASE

          default:
            winkey_status = WINKEY_NO_COMMAND_IN_PROGRESS;
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:ADMIN_CMD->NOCMD"));
            #endif //DEBUG_WINKEY             
            break;
          }
      } else {
        if (winkey_status == WINKEY_ADMIN_COMMAND_ECHO) {
          #ifdef DEBUG_WINKEY
            debug_serial_port->println(F("service_winkey:ADMIN_CMD echoabyte."));
          #endif //DEBUG_WINKEY  
          winkey_port_write(incoming_serial_byte,1);
          winkey_status = WINKEY_NO_COMMAND_IN_PROGRESS;
        }
      }

      if (winkey_status == WINKEY_KEYING_COMPENSATION_COMMAND) {
        #ifdef DEBUG_WINKEY
          debug_serial_port->println(F("service_winkey:ADMIN_CMD WINKEY_KEYING_COMPENSATION_COMMAND byte"));
        #endif //DEBUG_WINKEY         
        configuration.keying_compensation = incoming_serial_byte;
        winkey_status = WINKEY_NO_COMMAND_IN_PROGRESS;
      }

      if (winkey_status == WINKEY_FIRST_EXTENSION_COMMAND) {
        #ifdef DEBUG_WINKEY
          debug_serial_port->println(F("service_winkey:ADMIN_COMMAND WINKEY_FIRST_EXTENSION_COMMAND byte"));
        #endif //DEBUG_WINKEY              
        first_extension_time = incoming_serial_byte;
        #ifdef DEBUG_WINKEY_PROTOCOL_USING_CW
          send_char('X',KEYER_NORMAL);
        #endif
        winkey_status = WINKEY_NO_COMMAND_IN_PROGRESS;
      }

      if (winkey_status == WINKEY_PAUSE_COMMAND) {
        if (incoming_serial_byte) {
          #ifdef DEBUG_WINKEY
            debug_serial_port->println(F("service_winkey:ADMIN_CMD WINKEY_PAUSE_COMMANDpause"));
          #endif //DEBUG_WINKEY           
          pause_sending_buffer = 1;
        } else {
          #ifdef DEBUG_WINKEY
            debug_serial_port->println(F("service_winkey:ADMIN_CMD WINKEY_PAUSE_COMMANDunpause"));
          #endif //DEBUG_WINKEY             
          pause_sending_buffer = 0;
        }
        winkey_status = WINKEY_NO_COMMAND_IN_PROGRESS;
      }

      if (winkey_status ==  WINKEY_KEY_COMMAND) {
        #ifdef FEATURE_MEMORIES
        repeat_memory = 255;
        #endif
        sending_mode = AUTOMATIC_SENDING;
        if (incoming_serial_byte) {
          tx_and_sidetone_key(1);
        } else {
          tx_and_sidetone_key(0);
        }
        winkey_status = WINKEY_NO_COMMAND_IN_PROGRESS;
      }

      if (winkey_status ==  WINKEY_DAH_TO_DIT_RATIO_COMMAND) {
        winkey_dah_to_dit_ratio_command(incoming_serial_byte);
        winkey_status = WINKEY_NO_COMMAND_IN_PROGRESS;
      }

      if (winkey_status == WINKEY_WEIGHTING_COMMAND) {
        winkey_weighting_command(incoming_serial_byte);
        winkey_status = WINKEY_NO_COMMAND_IN_PROGRESS;
      }

      if (winkey_status == WINKEY_PTT_TIMES_PARM1_COMMAND) {
        winkey_ptt_times_parm1_command(incoming_serial_byte);
        winkey_status = WINKEY_PTT_TIMES_PARM2_COMMAND;
      } else {
        if (winkey_status == WINKEY_PTT_TIMES_PARM2_COMMAND) {
          winkey_ptt_times_parm2_command(incoming_serial_byte);
          winkey_status = WINKEY_NO_COMMAND_IN_PROGRESS;
        }
      }

      if (winkey_status == WINKEY_SET_POT_PARM1_COMMAND) {
        winkey_set_pot_parm1_command(incoming_serial_byte);
        winkey_status = WINKEY_SET_POT_PARM2_COMMAND;
      } else {
        if (winkey_status == WINKEY_SET_POT_PARM2_COMMAND) {
          winkey_set_pot_parm2_command(incoming_serial_byte);
          winkey_status = WINKEY_SET_POT_PARM3_COMMAND;
        } else {
          if (winkey_status == WINKEY_SET_POT_PARM3_COMMAND) {  // third parm is max read value from pot, depending on wiring
            winkey_set_pot_parm3_command(incoming_serial_byte); // WK2 protocol just ignores this third parm
            winkey_status = WINKEY_NO_COMMAND_IN_PROGRESS;      // this is taken care of in winkey_set_pot_parm3()
          }
        }
      }

      if (winkey_status ==  WINKEY_SETMODE_COMMAND) {
        winkey_setmode_command(incoming_serial_byte);
        winkey_status = WINKEY_NO_COMMAND_IN_PROGRESS;
      }

      if (winkey_status ==  WINKEY_SOFTWARE_PADDLE_COMMAND) {
        #ifdef FEATURE_MEMORIES
        repeat_memory = 255;
        #endif
        switch (incoming_serial_byte) {
          case 0: winkey_dit_invoke = 0; winkey_dah_invoke = 0; break;
          case 1: winkey_dit_invoke = 0; winkey_dah_invoke = 1; break;
          case 2: winkey_dit_invoke = 1; winkey_dah_invoke = 0; break;
          case 3: winkey_dah_invoke = 1; winkey_dit_invoke = 1; break;
        }
        winkey_status = WINKEY_NO_COMMAND_IN_PROGRESS;
      }

      if (winkey_status ==  WINKEY_SIDETONE_FREQ_COMMAND) {
        winkey_sidetone_freq_command(incoming_serial_byte);
        winkey_status = WINKEY_NO_COMMAND_IN_PROGRESS;
      }
       if (winkey_status ==  WINKEY_ADMIN_PADDLE_A2D_PARM_3) {
        #ifdef DEBUG_WINKEY
          debug_serial_port->println("service_winkey:ADMIN_COMMAND WINKEY_ADMIN_PADDLE_A2D_PARM_3 byte");
        #endif //DEBUG_WINKEY         
        winkey_status = WINKEY_NO_COMMAND_IN_PROGRESS;
      }    

      if (winkey_status ==  WINKEY_ADMIN_PADDLE_A2D_PARM_2) {
        #ifdef DEBUG_WINKEY
          debug_serial_port->println("service_winkey:ADMIN_COMMAND WINKEY_ADMIN_PADDLE_A2D_PARM_2 byte");
        #endif //DEBUG_WINKEY                
        winkey_status = WINKEY_ADMIN_PADDLE_A2D_PARM_3;
      }

      if (winkey_status ==  WINKEY_ADMIN_PADDLE_A2D_PARM_1) {
        winkey_status = WINKEY_ADMIN_PADDLE_A2D_PARM_2;
        #ifdef DEBUG_WINKEY
          debug_serial_port->println("service_winkey:ADMIN_COMMAND WINKEY_ADMIN_PADDLE_A2D_PARM_1 byte");
        #endif //DEBUG_WINKEY        
      }      

    } // else (winkey_status == WINKEY_NO_COMMAND_IN_PROGRESS)
  }  // if (action == SERVICE_SERIAL_BYTE

  
