K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
    case '^':                           // ^ - toggle send CW send immediately
       if (cli_wait_for_cr_to_send_cw) {
         cli_wait_for_cr_to_send_cw = 0;
         port_to_use->println(F("\r\nSend CW immediately"));
       } else {
         cli_wait_for_cr_to_send_cw = 1;
         port_to_use->println(F("\r\nWait for CR to send CW"));
       }
      break;
    #ifdef FEATURE_CMOS_SUPER_KEYER_IAMBIC_B_TIMING
      case '&':
        port_to_use->print(F("\r\nCMOS Super Keyer Timing O"));
        if (configuration.cmos_super_keyer_iambic_b_timing_on) {
          configuration.cmos_super_keyer_iambic_b_timing_on = 0;
          port_to_use->println(F("ff"));        
        } else {
          configuration.cmos_super_keyer_iambic_b_timing_on = 1;
          port_to_use->println(F("n"));
          configuration.keyer_mode = IAMBIC_B;
        }
        config_dirty = 1;
        break;
      case '%':
        user_input_temp = serial_get_number_input(2,-1,100,port_to_use, RAISE_ERROR_MSG);
        if ((user_input_temp >= 0) && (user_input_temp < 100)) {
          configuration.cmos_super_keyer_iambic_b_timing_percent = user_input_temp;
          port_to_use->println(F("\r\nCMOS Super Keyer Timing Set."));
        }
        config_dirty = 1;
        break;
    #endif //FEATURE_CMOS_SUPER_KEYER_IAMBIC_B_TIMING
    case '.':
      port_to_use->print(F("\r\nDit Buffer O"));
      if (configuration.dit_buffer_off) {
        configuration.dit_buffer_off = 0;
        port_to_use->println(F("n"));
      } else {
        configuration.dit_buffer_off = 1;
        port_to_use->println(F("ff"));
      }
      config_dirty = 1;
      break;
    case '-':
      port_to_use->print(F("\r\nDah Buffer O"));
      if (configuration.dah_buffer_off) {
        configuration.dah_buffer_off = 0;
        port_to_use->println(F("n"));
      } else {
        configuration.dah_buffer_off = 1;
        port_to_use->println(F("ff"));
      }
      config_dirty = 1;    
      break;
    case ';':
      if (cw_send_echo_inhibit){
        cw_send_echo_inhibit = 0;
      } else {
        cw_send_echo_inhibit = 1;
      }
      break;
    #ifdef FEATURE_QLF
      case '{':
        port_to_use->print(F("\r\nQLF: O"));
        if (qlf_active){
            qlf_active = 0;
            port_to_use->println(F("ff"));
          } else {
            qlf_active = 1;
            port_to_use->println(F("n"));
          }
        break;
    #endif //FEATURE_QLF

    case '>':
      send_serial_number(0,1,1);
      break;
    case '<': 
      send_serial_number(0,0,1);
      break;
    case '(':
      send_serial_number(1,0,1);
      break;
    case ')':
      send_serial_number(1,1,1);
      break;
    case '[':
      user_input_temp = serial_get_number_input(2,-1,21,port_to_use,RAISE_ERROR_MSG);
      if ((user_input_temp >= 0) && (user_input_temp < 21)) {
        configuration.paddle_interruption_quiet_time_element_lengths = user_input_temp;
        port_to_use->println(F("\r\nPaddle Interruption Quiet Time set."));
      }
      config_dirty = 1;      
      break;
    #if !defined(OPTION_EXCLUDE_MILL_MODE)
      case '@':
        switch(configuration.cli_mode){
          case CLI_NORMAL_MODE:
            configuration.cli_mode = CLI_MILL_MODE_KEYBOARD_RECEIVE;
            port_to_use->println(F("\r\nMill Mode On"));
            break;
          case CLI_MILL_MODE_PADDLE_SEND:
          case CLI_MILL_MODE_KEYBOARD_RECEIVE:
            configuration.cli_mode = CLI_NORMAL_MODE;
            port_to_use->println(F("\r\nMill Mode Off"));
            break;  
        }  
        config_dirty = 1;
        break;
    #endif // !defined(OPTION_EXCLUDE_MILL_MODE)
    case '"':
      port_to_use->print(F("\r\nPTT Buffered Character Hold O"));
      if (configuration.ptt_buffer_hold_active){
        configuration.ptt_buffer_hold_active = 0;
        port_to_use->println(F("ff"));
      } else {
        configuration.ptt_buffer_hold_active = 1;
        port_to_use->println(F("n"));
      }
      config_dirty = 1;
      break;
    case ']':
      port_to_use->print(F("\r\nPTT "));
      if (configuration.ptt_disabled){
        configuration.ptt_disabled = 0;
        port_to_use->print(F("En"));
      } else {
        configuration.ptt_disabled = 1;
        ptt_unkey();
        port_to_use->print(F("Dis"));
      }
      port_to_use->println(F("abled"));
      config_dirty = 1;
      break;

    #if defined(FEATURE_BEACON_SETTING)
    case '_':
        port_to_use->print(F("\r\nBeacon Mode At Boot Up "));
        if (!configuration.beacon_mode_on_boot_up){
          configuration.beacon_mode_on_boot_up = 1;
          port_to_use->print(F("En"));
        } else {
          configuration.beacon_mode_on_boot_up = 0;
          port_to_use->print(F("Dis"));
        }
        port_to_use->println(F("abled"));
        config_dirty = 1;
        break;
    #endif  


    #if !defined(OPTION_EXCLUDE_EXTENDED_CLI_COMMANDS) 
    case ':':
      cli_extended_commands(port_to_use);
      break;    
    #endif 

    default: port_to_use->println(F("\r\nUnknown command")); break;
  }

}
#endif //defined(FEATURE_SERIAL) && defined(FEATURE_COMMAND_LINE_INTERFACE)


//---------------------------------------------------------------------

#if defined(FEATURE_SERIAL) && defined(FEATURE_COMMAND_LINE_INTERFACE) && !defined(OPTION_EXCLUDE_EXTENDED_CLI_COMMANDS)
void cli_extended_commands(PRIMARY_SERIAL_CLS * port_to_use)
{
  byte incoming_serial_byte = 0;
  byte looping = 1;
  String userinput = "";

  while (looping) {
    vTaskDelay(1 / portTICK_PERIOD_MS);
    if (port_to_use->available() == 0) {        // wait for the next keystroke
      if (keyer_machine_mode == KEYER_NORMAL) {          // might as well do something while we're waiting
        check_paddles();
        service_dit_dah_buffers();
        service_send_buffer(PRINTCHAR);

        check_ptt_tail();
        #ifdef FEATURE_POTENTIOMETER
          if (configuration.pot_activated) {
            check_potentiometer();
          }
        #endif
        
        #ifdef FEATURE_ROTARY_ENCODER
          check_rotary_encoder();
        #endif //FEATURE_ROTARY_ENCODER        
        #ifdef FEATURE_DISPLAY
          mydelay(10);  // service FreeRTOS watching timer while in loop
        #endif
      }
    } else {
      incoming_serial_byte = port_to_use->read();
      port_to_use->write(incoming_serial_byte);
      if ((incoming_serial_byte == 8) || (incoming_serial_byte == 127)){   // backspace / DEL
        userinput.remove(userinput.length()-1,1);
      }        
#if !defined(FEATURE_WIFI) //SP5IOU 20220129
      incoming_serial_byte = uppercase(incoming_serial_byte);
#endif
      if ((incoming_serial_byte > 31) && (incoming_serial_byte < 127)) {
        userinput.concat((char)incoming_serial_byte);
      }
      if (incoming_serial_byte == 13 || incoming_serial_byte == 10) {   // carriage return - get out
        looping = 0;
      }
    }
  } //while (looping)
#if defined(FEATURE_WIFI) //SP5IOU 20220128
  String userinputNoUpper = userinput;
  userinput.toUpperCase();
  if (userinput.startsWith("WIFI ")) { cli_wifi(port_to_use, userinputNoUpper.substring(5)); return; }
 else { userinput.toUpperCase();}
#endif
  if (userinput.startsWith("EEPROMDUMP")){cli_eeprom_dump(port_to_use);return;}
  if (userinput.startsWith("TIMING")){cli_timing_print(port_to_use);return;}
  if (userinput.startsWith("PL ")){cli_timing_command(port_to_use,userinput.substring(3),COMMAND_PL);return;}
  if (userinput.startsWith("PT ")){cli_timing_command(port_to_use,userinput.substring(3),COMMAND_PT);return;}
  #if defined(FEATURE_SEQUENCER)
    if (userinput.startsWith("PA ")){cli_timing_command(port_to_use,userinput.substring(3),COMMAND_PA);return;}
    if (userinput.startsWith("PI ")){cli_timing_command(port_to_use,userinput.substring(3),COMMAND_PI);return;}
  #endif //FEATURE_SEQUENCER
  #if defined(FEATURE_SD_CARD_SUPPORT)
    if (userinput.startsWith("SAVEEEPROM ")){sd_card_save_eeprom_to_file(port_to_use,userinput.substring(11));return;}
    if (userinput.startsWith("LOADEEPROM ")){sd_card_load_eeprom_from_file(port_to_use,userinput.substring(11));return;}
    if (userinput.startsWith("PRINTLOG")){sd_card_print_file(port_to_use,"/keyer/keyer.log");return;}
    if (userinput.startsWith("CLEARLOG")){sd_card_clear_log_file(port_to_use,"/keyer/keyer.log");return;}
    if (userinput.startsWith("LS ")){cli_sd_ls_command(port_to_use,userinput.substring(3));return;}
    if (userinput.startsWith("CAT ")){sd_card_print_file(port_to_use,userinput.substring(4));return;}    
  #endif // defined(FEATURE_SD_CARD_SUPPORT)

  #if defined(FEATURE_PADDLE_ECHO)
    if (userinput.startsWith("PF ")){cli_paddle_echo_factor(port_to_use,userinput.substring(3));return;}
  #endif // defined(FEATURE_PADDLE_ECHO)

