K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
String generate_callsign(byte callsign_mode) {

  static String callsign(10);
  char nextchar;
  char word_buffer[10];

  callsign = "";

  if (callsign_mode == CALLSIGN_INTERNATIONAL){
    if (random(1,101) < 96) {
      // start with a letter 96% of the time
      nextchar = random(65,91);
      callsign = callsign + nextchar;
      if (random(1,101) < 20) {   // randomly add second prefix letter 20% of the time
        nextchar = random(65,91);
        callsign = callsign + nextchar;
      }
    } else {
      // start with a number
      nextchar = random(49,58);    // generate the number
      callsign = callsign + nextchar;
      nextchar = random(65,91);   // must add a letter next
      callsign = callsign + nextchar;
    }
  } //CALLSIGN_INTERNATIONAL

  if (callsign_mode == CALLSIGN_US){
    switch (random(1,5)) {
      case 1: callsign = "K"; break;
      case 2: callsign = "W"; break;
      case 3: callsign = "N"; break;
      case 4: callsign = "A"; break;
    }
    if (callsign == "A") {                   // if the first letter is A, we definitely need a second letter before the number
      nextchar = random(65,91);
      callsign = callsign + nextchar;
    } else {
      // randomly add a second letter for K, W, N prefixes
      if (random(1,101) < 51) {
        nextchar = random(65,91);
        callsign = callsign + nextchar;
      }
    }
  } //CALLSIGN_US

  if (callsign_mode == CALLSIGN_CANADA){
    strcpy_P(word_buffer, (char*)pgm_read_dword(&(canadian_prefix_table[random(0,canadian_prefix_size)])));
    callsign = word_buffer;
  }

  if (callsign_mode == CALLSIGN_EUROPEAN){

    strcpy_P(word_buffer, (char*)pgm_read_dword(&(eu_prefix_table[random(0,eu_prefix_size)])));
    callsign = word_buffer;
  }

  if (callsign_mode != CALLSIGN_CANADA){
    nextchar = random(48,58);               // generate the number
    callsign = callsign + nextchar;
  }


  nextchar = random(65,91);               // generate first letter after number
  callsign = callsign + nextchar;
  if ((random(1,101) < 40) || (callsign_mode == CALLSIGN_CANADA)) {                  // randomly put a second character after the number
    nextchar = random(65,91);
    callsign = callsign + nextchar;
    if ((random(1,101) < 96) || (callsign_mode == CALLSIGN_CANADA)) {              // randomly put a third character after the number
      nextchar = random(65,91);
      callsign = callsign + nextchar;
    }
  }

  if (random(1,101) < 10) {                // randomly put a slash something on the end like /QRP or /#
    if (random(1,101) < 25) {
      callsign = callsign + "/QRP";
    } else {
       nextchar = random(48,58);
       callsign = callsign + "/" + nextchar;
    }
  }

  return callsign;
}

#endif //FEATURE_TRAINING_COMMAND_LINE_INTERFACE
//---------------------------------------------------------------------
// #if defined(FEATURE_SERIAL) && defined(FEATURE_TRAINING_COMMAND_LINE_INTERFACE) && defined(FEATURE_COMMAND_LINE_INTERFACE)
// void paqso_practice(PRIMARY_SERIAL_CLS * port_to_use){
  
//   // VT100 emulation in Linux: screen /dev/ttyACM1 115200 term vt100
  
//   #define CONTEST_PRACTICE_IDLE 0
//   #define CONTEST_PRACTICE_CQ_SENT 1
//   #define CONTEST_PRACTICE_REPORT_SENT 2
 
//   #define FIELD_CALLSIGN 0
//   #define FIELD_NR 1
//   #define FIELD_SECTION 2
  
//   byte overall_state = CONTEST_PRACTICE_IDLE;
//   byte loop1 = 1;
//   byte user_input_buffer[10];
//   byte user_input_buffer_characters = 0;
//   byte incoming_char = 0;
//   byte process_user_input_buffer = 0;
//   unsigned long escape_flag_time = 0;
//   String callsign;
//   String nr;
//   String section;
//   byte cq_answered = 0;
//   unsigned long transition_time = 0;
//   byte current_field = FIELD_CALLSIGN;

//   int previous_sidetone = configuration.hz_sidetone;
//   int previous_wpm = configuration.wpm;
//   int caller_sidetone = 0;
//   int caller_wpm_delta = 0;

//   while (port_to_use->available() > 0) {  // clear out the buffer if anything is there
//   vTaskDelay(1 / portTICK_PERIOD_MS);
//     port_to_use->read();
//   }  

//   term.init();
//   term.cls(); 
//   term.position(0,0);  
//   term.println(F("\nPA QSO Party Practice\n"));
//   term.println(F("This requires VT100 emulation!\n"));
//   term.println(F("F1 - Call CQ"));
//   term.println(F("F2 - Exchange"));
//   term.println(F("F3 - TU"));
//   term.println(F("Insert - Callsign + Exchange"));
//   term.println(F("\\ - Exit\n"));
//   term.println(F("Callsign  NR  Section"));
//   term.println(F("-------- ---- -------\n\n"));    
  
//   while (loop1){
//      vTaskDelay(1 / portTICK_PERIOD_MS);
//     // get user keyboard input
//     if (port_to_use->available()){      
//       user_input_buffer[user_input_buffer_characters] = toupper(port_to_use->read());
//       switch(user_input_buffer[user_input_buffer_characters]){                    
//         case 27: //escape
//           escape_flag_time = millis();
//           user_input_buffer_characters++;
//         case 13: //return
//         case 32: //space
//           process_user_input_buffer = 1;
//           break;
//         case 127:
//         case 8: //backspace
//           if (user_input_buffer_characters > 0){user_input_buffer_characters--;}
//           port_to_use->write(27);
//           port_to_use->write(91);
//           port_to_use->write(49);
//           port_to_use->write(68);
//           break;
          
//         default:
//           if (!(((user_input_buffer[user_input_buffer_characters-1] == 27) && (user_input_buffer[user_input_buffer_characters] == 79) && (user_input_buffer_characters>0)) ||
//           ((user_input_buffer[user_input_buffer_characters-2] == 27) && (user_input_buffer[user_input_buffer_characters-1] == 79) && (user_input_buffer_characters>1)))){
//             port_to_use->write(user_input_buffer[user_input_buffer_characters]);
//           }
//           user_input_buffer_characters++;
//           break;                 
//       } //switch(user_input_buffer[user_input_buffer_characters])
//       if (user_input_buffer_characters == 10){process_user_input_buffer = 1;}
        
