K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
//   configuration.hz_sidetone = previous_sidetone;
//   configuration.wpm = previous_wpm;
//   send_buffer_bytes = 0;
// }  
// #endif

//---------------------------------------------------------------------
	    
#if defined(FEATURE_SERIAL) && defined(FEATURE_TRAINING_COMMAND_LINE_INTERFACE) && defined(FEATURE_COMMAND_LINE_INTERFACE)
void serial_cw_practice(PRIMARY_SERIAL_CLS * port_to_use) {


  byte menu_loop = 1;
  byte menu_loop2 = 1;
  char incoming_char = ' ';

  check_serial_override = 1;

  byte previous_key_tx_state = key_tx;
  key_tx = 0;
  
  while(menu_loop){
  
    while (port_to_use->available() > 0) {  // clear out the buffer if anything is there
      vTaskDelay(1 / portTICK_PERIOD_MS);
      port_to_use->read();
    }  
   
    port_to_use->println(F("\r\n\nCW Training Menu\n"));
    port_to_use->println(F("C - Receive Practice"));
    port_to_use->println(F("I - Keyboard Interactive Receive Practice"));
    port_to_use->println(F("R - Random Groups Receive Practice"));
    port_to_use->println(F("W - Wordsworth Receive Practice"));
    port_to_use->println(F("E - Receive / Transmit Echo Practice"));
    //port_to_use->println(F("2 - PA QSO Party");   // Don't think this is working right / wasn't finished - Goody 2017-05-01
    port_to_use->println(F("\nX - Exit\n"));
    
    menu_loop2 = 1;
    
    while (menu_loop2) {
      vTaskDelay(1 / portTICK_PERIOD_MS);
      if (port_to_use->available()){
        incoming_char = port_to_use->read();
        if ((incoming_char != 10) && (incoming_char != 13)){
          menu_loop2 = 0;
        }
      }
    }
      
    incoming_char = toUpperCase(incoming_char);
    
    switch(incoming_char){
      case 'X': menu_loop = 0; break;
      case 'C': serial_receive_practice_menu(port_to_use,PRACTICE_NON_INTERACTIVE); break;
      case 'I': serial_receive_practice_menu(port_to_use,PRACTICE_INTERACTIVE); break;
      case 'R': serial_random_menu(port_to_use); break;
      case 'W': serial_wordsworth_menu(port_to_use); break;
      case 'E': serial_receive_transmit_echo_menu(port_to_use); break;
      //case '2': paqso_practice(port_to_use); break;
    } //switch(incoming_char)
    
  } //while(menu_loop)
      
  port_to_use->println(F("Exited Training module..."));
  check_serial_override = 0;
  key_tx = previous_key_tx_state;
  paddle_echo_buffer = 0; 
}
#endif

//---------------------------------------------------------------------
	    
#if defined(FEATURE_SERIAL) && defined(FEATURE_TRAINING_COMMAND_LINE_INTERFACE) && defined(FEATURE_COMMAND_LINE_INTERFACE)
void serial_receive_transmit_echo_menu(PRIMARY_SERIAL_CLS * port_to_use) {


  byte menu_loop = 1;
  byte menu_loop2 = 1;
  char incoming_char = ' ';
  
  while(menu_loop) {
  
    while (port_to_use->available() > 0) {  // clear out the buffer if anything is there
      vTaskDelay(1 / portTICK_PERIOD_MS);
      port_to_use->read();
    }  
   
    port_to_use->println(F("\r\n\nReceive / Transmit Echo Practice Menu\n"));
    port_to_use->println(F("I - International Callsigns"));
    port_to_use->println(F("U - US Callsigns"));
    port_to_use->println(F("E - European Callsigns"));
    port_to_use->println(F("C - Canadian Callsigns"));
    port_to_use->println(F("P - Progressive 5 Character Groups"));
    port_to_use->println(F("2 - Two Letter Words"));
    port_to_use->println(F("3 - Three Letter Words"));
    port_to_use->println(F("4 - Four Letter Words"));
    port_to_use->println(F("N - Names"));
    port_to_use->println(F("Q - QSO Words"));
    port_to_use->println(F("M - Mixed\n"));
    port_to_use->println(F("\nX - Exit\n"));
    
    menu_loop2 = 1;
    
    while (menu_loop2) {   
      vTaskDelay(1 / portTICK_PERIOD_MS);
      if (port_to_use->available()){
        incoming_char = port_to_use->read();
        if ((incoming_char != 10) && (incoming_char != 13)) {
          menu_loop2 = 0;
        }
      }
    }
      
    incoming_char = toUpperCase(incoming_char);

    switch(incoming_char) {
      case 'X': menu_loop = 0; break;
      case 'I': receive_transmit_echo_practice(port_to_use,CALLSIGN_INTERNATIONAL); break;
      case 'U': receive_transmit_echo_practice(port_to_use,CALLSIGN_US); break;
      case 'E': receive_transmit_echo_practice(port_to_use,CALLSIGN_EUROPEAN); break;
      case 'C': receive_transmit_echo_practice(port_to_use,CALLSIGN_CANADA); break; 
      case 'P': receive_transmit_echo_practice(port_to_use,ECHO_PROGRESSIVE_5); break;   
      case '2': receive_transmit_echo_practice(port_to_use,ECHO_2_CHAR_WORDS); break;
      case '3': receive_transmit_echo_practice(port_to_use,ECHO_3_CHAR_WORDS); break;
      case '4': receive_transmit_echo_practice(port_to_use,ECHO_4_CHAR_WORDS); break;
      case 'N': receive_transmit_echo_practice(port_to_use,ECHO_NAMES); break;
      case 'M': receive_transmit_echo_practice(port_to_use,ECHO_MIXED); break;
      case 'Q': receive_transmit_echo_practice(port_to_use,ECHO_QSO_WORDS); break;          
    } //switch(incoming_char)

  } // while(menu_loop)
      
  port_to_use->println(F("Exiting receive / transmit echo practice..."));
}
#endif

//---------------------------------------------------------------------

#if defined(FEATURE_SERIAL) && defined(FEATURE_TRAINING_COMMAND_LINE_INTERFACE) && defined(FEATURE_COMMAND_LINE_INTERFACE)
void receive_transmit_echo_practice(PRIMARY_SERIAL_CLS * port_to_use, byte practice_mode_called) {

  byte loop1 = 1;
  byte loop2 = 0;
  byte x = 0;
  byte user_send_loop = 0;
  String cw_to_send_to_user(10);
  char incoming_char = ' ';
  String user_sent_cw = "";
  byte paddle_hit = 0;
  unsigned long last_element_time = 0;
  unsigned long cw_char;
  byte speed_mode_before = speed_mode;
  byte keyer_mode_before = configuration.keyer_mode;
  byte progressive_step_counter;
  byte practice_mode;
  char word_buffer[10];

  speed_mode = SPEED_NORMAL;                 // put us in normal speed mode 
  if ((configuration.keyer_mode != IAMBIC_A) && (configuration.keyer_mode != IAMBIC_B)) {
    configuration.keyer_mode = IAMBIC_B;                   // we got to be in iambic mode (life is too short to make this work in bug mode)
  }  

