K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
//---------------------------------------------------------------------

#if defined(FEATURE_SERIAL) && defined(FEATURE_TRAINING_COMMAND_LINE_INTERFACE) && defined(FEATURE_COMMAND_LINE_INTERFACE)
void random_practice(PRIMARY_SERIAL_CLS * port_to_use,byte random_mode,byte group_size) {

  byte loop1 = 1;
  byte x = 0;
  byte y = 0;
  char incoming_char = ' ';
  char random_character = 0;

  randomSeed(millis());
  port_to_use->println(F("Random group practice\r\n"));

  #ifdef FEATURE_DISPLAY
    #ifndef FEATURE_TFT_DISPLAY
      lcd_scroll_box_clear();
    #endif
    if (LCD_COLUMNS < 9){
      lcd_center_print_timed("RndGroup", 0, default_display_msg_delay);
    } else {
      lcd_center_print_timed("Random Group", 0, default_display_msg_delay);
    }
    if (LCD_ROWS > 1){
      lcd_center_print_timed("Practice", 1, default_display_msg_delay);
    }
    service_display();
  #endif

  while (port_to_use->available() > 0) {  // clear out the buffer if anything is there
    vTaskDelay(1 / portTICK_PERIOD_MS);
    incoming_char = port_to_use->read();
  }

  while (loop1){
    vTaskDelay(1 / portTICK_PERIOD_MS);
    switch(random_mode){
      case RANDOM_LETTER_GROUPS: random_character = random(65,91); break;
      case RANDOM_NUMBER_GROUPS: random_character = random(48,58); break;
      case RANDOM_MIXED_GROUPS: 
        random_character = random(65,101);
        if (random_character > 90) {random_character = random_character - 43;};
        break;
    }

    send_char(random_character,KEYER_NORMAL);
    port_to_use->print(random_character);
    #ifdef FEATURE_DISPLAY
      display_scroll_print_char(random_character);
      service_display();
    #endif


    x++;

    if (x == group_size){
      send_char(' ',KEYER_NORMAL);
      port_to_use->print(F(" "));
      #ifdef FEATURE_DISPLAY
        display_scroll_print_char(' ');
        service_display();
      #endif
      x = 0;
      y++;
    }

    if (y > 4){
      port_to_use->println(F(""));
      y = 0;
    }

    if (port_to_use->available()){
      port_to_use->read();
      loop1 = 0;
    }

    #ifdef FEATURE_BUTTONS
      while ((paddle_pin_read(paddle_left) == LOW) || (paddle_pin_read(paddle_right) == LOW) || (analogbuttonread(0))) {
        loop1 = 0;
      }
    #else 
      while ((paddle_pin_read(paddle_left) == LOW) || (paddle_pin_read(paddle_right) == LOW)) {
        vTaskDelay(1 / portTICK_PERIOD_MS);
        loop1 = 0;
      }    
    #endif //FEATURE_BUTTONS

  } //loop1
  

}
#endif //defined(FEATURE_SERIAL) && defined(FEATURE_TRAINING_COMMAND_LINE_INTERFACE) && defined(FEATURE_COMMAND_LINE_INTERFACE)

//---------------------------------------------------------------------

#if defined(FEATURE_SERIAL) && defined(FEATURE_TRAINING_COMMAND_LINE_INTERFACE) && defined(FEATURE_COMMAND_LINE_INTERFACE)
void serial_wordsworth_menu(PRIMARY_SERIAL_CLS * port_to_use){

  byte menu_loop = 1;
  byte menu_loop2 = 1;
  char incoming_char = ' ';
  byte effective_wpm_factor[] = {100,93,86,81,76,71,68,64,61,58,56,53};
  
  while(menu_loop){
  
    while (port_to_use->available() > 0) {  // clear out the buffer if anything is there
      vTaskDelay(1 / portTICK_PERIOD_MS);
      port_to_use->read();
    }  
    
    port_to_use->println(F("\r\n\nWordsworth Menu\n"));
    port_to_use->println(F("2 - Two Letter Words"));
    port_to_use->println(F("3 - Three Letter Words"));
    port_to_use->println(F("4 - Four Letter Words"));
    port_to_use->println(F("N - Names"));
    port_to_use->println(F("Q - QSO Words"));
    port_to_use->println(F("M - Mixed\n"));
    port_to_use->println(F("O - Set Wordspace"));
    port_to_use->println(F("W - Set WPM"));
    port_to_use->println(F("R - Set Repetition"));
    port_to_use->println(F("\nX - Exit\n"));
    port_to_use->print(F("WPM:"));
    port_to_use->print(configuration.wpm);
    port_to_use->print(F(" Wordspace:"));
    port_to_use->print(configuration.wordsworth_wordspace);
    port_to_use->print(F(" Effective WPM:"));
    port_to_use->print(configuration.wpm * (effective_wpm_factor[configuration.wordsworth_wordspace-1]/100.0),0);
    port_to_use->print(F(" Repetition:"));
    port_to_use->println(configuration.wordsworth_repetition);
    port_to_use->println(F("\r\n\nEnter choice >"));

    menu_loop2 = 1;
    
    while (menu_loop2){
      vTaskDelay(1 / portTICK_PERIOD_MS);
      if (port_to_use->available()){
        incoming_char = port_to_use->read();
        if ((incoming_char != 10) && (incoming_char != 13)){
          menu_loop2 = 0;
        }
      }
    }

    incoming_char = toUpperCase(incoming_char);

    switch(incoming_char){
      case '2': wordsworth_practice(port_to_use,WORDSWORTH_2_CHAR_WORDS); break;
      case '3': wordsworth_practice(port_to_use,WORDSWORTH_3_CHAR_WORDS); break;
      case '4': wordsworth_practice(port_to_use,WORDSWORTH_4_CHAR_WORDS); break;
      case 'N': wordsworth_practice(port_to_use,WORDSWORTH_NAMES); break;
      case 'M': wordsworth_practice(port_to_use,WORDSWORTH_MIXED); break;
      case 'Q': wordsworth_practice(port_to_use,WORDSWORTH_QSO_WORDS); break;
      case 'W': serial_set_wordspace_parameters(port_to_use,WORDSWORTH_WPM); break;
      case 'O': serial_set_wordspace_parameters(port_to_use,WORDSWORTH_WORDSPACE); break;
      case 'R': serial_set_wordspace_parameters(port_to_use,WORDSWORTH_REPETITION); break;
      case 'X': menu_loop = 0; break;        
    } //switch(incoming_char)
    
 
    
  } //while(menu_loop)
      
  port_to_use->println(F("Exiting Wordsworth module..."));


}
#endif //defined(FEATURE_SERIAL) && defined(FEATURE_TRAINING_COMMAND_LINE_INTERFACE) && defined(FEATURE_COMMAND_LINE_INTERFACE)


//---------------------------------------------------------------------

#if defined(FEATURE_SERIAL) && defined(FEATURE_TRAINING_COMMAND_LINE_INTERFACE) && defined(FEATURE_COMMAND_LINE_INTERFACE)
void wordsworth_practice(PRIMARY_SERIAL_CLS * port_to_use,byte practice_type)
{

  byte loop1 = 1;
  byte loop2;
  byte loop3;
  unsigned int word_index;
  char word_buffer[10];
  byte x;
  byte not_printed;
  byte practice_type_called = practice_type;
  byte repetitions;


