K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
    switch(practice_type){
      case CALLSIGN_INTERNATIONAL:
      case CALLSIGN_US:
      case CALLSIGN_EUROPEAN:
      case CALLSIGN_CANADA:  
        cw_to_send_to_user = generate_callsign(practice_type);
        break;
      case PRACTICE_2_CHAR_WORDS: 
        strcpy_P(word_buffer, (char*)pgm_read_dword(&(s2_table[random(0,s2_size)])));
        cw_to_send_to_user = word_buffer;
        #ifdef DEBUG_PRACTICE_SERIAL
          debug_serial_port->print(F("serial_practice_non_interactive: PRACTICE_2_CHAR_WORDS:"));
        #endif
        break;
      case PRACTICE_3_CHAR_WORDS:
        strcpy_P(word_buffer, (char*)pgm_read_dword(&(s3_table[random(0,s3_size)])));
        cw_to_send_to_user = word_buffer;
        #ifdef DEBUG_PRACTICE_SERIAL
          debug_serial_port->print(F("serial_practice_non_interactive: PRACTICE_3_CHAR_WORDS:"));
        #endif        
        break;
      case PRACTICE_4_CHAR_WORDS: 
        strcpy_P(word_buffer, (char*)pgm_read_dword(&(s4_table[random(0,s4_size)])));
        cw_to_send_to_user = word_buffer;
        #ifdef DEBUG_PRACTICE_SERIAL
          debug_serial_port->print(F("serial_practice_non_interactive: PRACTICE_4_CHAR_WORDS:"));
        #endif        
        break;    
      case PRACTICE_NAMES: 
        strcpy_P(word_buffer, (char*)pgm_read_dword(&(name_table[random(0,name_size)])));
        cw_to_send_to_user = word_buffer;
        #ifdef DEBUG_PRACTICE_SERIAL
          debug_serial_port->print(F("serial_practice_non_interactive: PRACTICE_NAMES:"));
        #endif        
        break; 
      case PRACTICE_QSO_WORDS: 
        strcpy_P(word_buffer, (char*)pgm_read_dword(&(qso_table[random(0,qso_size)])));
        cw_to_send_to_user = word_buffer;
        #ifdef DEBUG_PRACTICE_SERIAL
          debug_serial_port->print(F("serial_practice_non_interactive: PRACTICE_QSO_WORDS:"));
        #endif        
        break; 
    } //switch(practice_type)


    cw_to_send_to_user = cw_to_send_to_user + "    ";


    loop2 = 1;
    x = 0;

    while ((loop2) && (x < (cw_to_send_to_user.length()))) {
      vTaskDelay(1 / portTICK_PERIOD_MS);
      send_char(cw_to_send_to_user[x],KEYER_NORMAL);
      #ifdef FEATURE_DISPLAY
        display_scroll_print_char(cw_to_send_to_user[x]);
        service_display();
      #endif  
      x++;
    
      if (port_to_use->available()){
        port_to_use->read();
        loop1 = 0;
        loop2 = 0;
        x = 99;
      }

      #ifdef FEATURE_BUTTONS
        while ((paddle_pin_read(paddle_left) == LOW) || (paddle_pin_read(paddle_right) == LOW) || (analogbuttonread(0))) {
          vTaskDelay(1 / portTICK_PERIOD_MS);
          loop1 = 0;
          loop2 = 0;
          x = 99;
        }
      #else 
        while ((paddle_pin_read(paddle_left) == LOW) || (paddle_pin_read(paddle_right) == LOW)) {
          vTaskDelay(1 / portTICK_PERIOD_MS);
          loop1 = 0;
          loop2 = 0;
          x = 99;
        }    
      #endif //FEATURE_BUTTONS

    } //loop2

    port_to_use->println(cw_to_send_to_user);

  } //loop1


}
#endif //defined(FEATURE_SERIAL) && defined(FEATURE_TRAINING_COMMAND_LINE_INTERFACE) && defined(FEATURE_COMMAND_LINE_INTERFACE)

//---------------------------------------------------------------------

#if defined(FEATURE_SERIAL) && defined(FEATURE_COMMAND_LINE_INTERFACE)
void serial_status(PRIMARY_SERIAL_CLS * port_to_use) {

  port_to_use->println();
  #if defined(FEATURE_AMERICAN_MORSE)
    if (char_send_mode == AMERICAN_MORSE){port_to_use->println(F("American Morse"));}
  #endif 
  #if defined(FEATURE_HELL)
    if (char_send_mode == HELL){port_to_use->println(F("Hellschreiber"));}
  #endif 
  switch (configuration.keyer_mode) {
    case IAMBIC_A: port_to_use->print(F("Iambic A")); break;
    case IAMBIC_B: port_to_use->print(F("Iambic B")); 
      #ifdef FEATURE_CMOS_SUPER_KEYER_IAMBIC_B_TIMING
        port_to_use->print(F(" / CMOS Super Keyer Timing: O"));
        if (configuration.cmos_super_keyer_iambic_b_timing_on) {
          port_to_use->print(F("n "));
          port_to_use->print(configuration.cmos_super_keyer_iambic_b_timing_percent);
          port_to_use->print(F("%"));
        } else {
         port_to_use->print(F("ff"));
        }
      #endif //FEATURE_CMOS_SUPER_KEYER_IAMBIC_B_TIMING
      break;
    case BUG: port_to_use->print(F("Bug")); break;
    case STRAIGHT: port_to_use->print(F("Straight Key")); break;

    #ifndef OPTION_NO_ULTIMATIC
    case ULTIMATIC: 
      port_to_use->print(F("Ultimatic ")); 
      switch(ultimatic_mode){
        // case ULTIMATIC_NORMAL:
        //   port_to_use->print(F("Normal")); 
        //   break;
        case ULTIMATIC_DIT_PRIORITY:
          port_to_use->print(F("Dit Priority")); 
          break;
        case ULTIMATIC_DAH_PRIORITY:
          port_to_use->print(F("Dah Priority")); 
          break;        
      }
    break;
    #endif // OPTION_NO_ULTIMATIC
    case SINGLE_PADDLE: port_to_use->print(F("Single Paddle")); break;

    break;
  }
  port_to_use->println();
  port_to_use->print(F("Buffers: Dit O"));
  if (configuration.dit_buffer_off){
    port_to_use->print(F("ff"));
  } else {
    port_to_use->print(F("n"));
  }
  port_to_use->print(F(" Dah O"));
  if (configuration.dah_buffer_off){
    port_to_use->println(F("ff"));
  } else {
    port_to_use->println(F("n"));
  }
  if (speed_mode == SPEED_NORMAL) {
    port_to_use->print(F("WPM: "));
    port_to_use->println(configuration.wpm,DEC);
    port_to_use->print(F("Command Mode WPM: "));
    port_to_use->println(configuration.wpm_command_mode,DEC);
    #ifdef FEATURE_FARNSWORTH
      port_to_use->print(F("Farnsworth WPM: "));
      if (configuration.wpm_farnsworth < configuration.wpm) {
        port_to_use->println(F("Disabled")); //(WD9DMP)
      } else {
        port_to_use->println(configuration.wpm_farnsworth,DEC);
      }
    #endif //FEATURE_FARNSWORTH
  } else {
    port_to_use->print(F("QRSS Mode Activated - Dit Length: "));
    port_to_use->print(qrss_dit_length,DEC);
    port_to_use->println(F(" seconds"));
  }
  port_to_use->print(F("Sidetone: "));
  switch (configuration.sidetone_mode) {
    case SIDETONE_ON: port_to_use->print(F("On")); break; //(WD9DMP)
    case SIDETONE_OFF: port_to_use->print(F("Off")); break; //(WD9DMP)
    case SIDETONE_PADDLE_ONLY: port_to_use->print(F("Paddle Only")); break;
  }
  port_to_use->print(F(" "));
  port_to_use->print(configuration.hz_sidetone,DEC);
  port_to_use->println(F(" hz"));

  #if defined(FEATURE_SINEWAVE_SIDETONE)
     port_to_use->print(F("Sidetone Volume: "));
     port_to_use->print(map(configuration.sidetone_volume,sidetone_volume_low_limit,sidetone_volume_high_limit,0,100));
     port_to_use->println(F("%"));
     port_to_use->println(configuration.sidetone_volume);
  #endif //FEATURE_SINEWAVE_SIDETONE   

  #ifdef FEATURE_SIDETONE_SWITCH
    port_to_use->print(F("Sidetone Switch: "));
    port_to_use->println(sidetone_switch_value() ? F("On") : F("Off")); //(WD9DMP)
  #endif // FEATURE_SIDETONE_SWITCH
  port_to_use->print(F("Dah to dit: "));
  port_to_use->println((float(configuration.dah_to_dit_ratio)/100));
  port_to_use->print(F("Weighting: "));
  port_to_use->println(configuration.weighting,DEC);
  port_to_use->print(F("Keying Compensation: "));
  port_to_use->print(configuration.keying_compensation,DEC);
  port_to_use->println(F(" mS"));
  port_to_use->print(F("Serial Number: "));  
  port_to_use->println(serial_number,DEC);
  #ifdef FEATURE_POTENTIOMETER
    port_to_use->print(F("Potentiometer WPM: "));
    port_to_use->print(pot_value_wpm(),DEC);
    port_to_use->print(F(" ("));
    if (configuration.pot_activated != 1) {
      port_to_use->print(F("Not "));
    }
    port_to_use->print(F("Activated) Range: "));
    port_to_use->print(pot_wpm_low_value);
    port_to_use->print(F(" - "));
    port_to_use->print(pot_wpm_high_value);
    port_to_use->println(F(" WPM"));
  #endif
  #ifdef FEATURE_AUTOSPACE
    port_to_use->print(F("Autospace O"));
    if (configuration.autospace_active) {
      port_to_use->println(F("n"));
    } else {
      port_to_use->println(F("ff"));
    }
    port_to_use->print(F("Autospace Timing Factor: "));
    port_to_use->println((float)configuration.autospace_timing_factor/(float)100);
  #endif
  port_to_use->print(F("Wordspace: "));
  port_to_use->println(configuration.length_wordspace,DEC);
  port_to_use->print(F("TX: "));
  port_to_use->println(configuration.current_tx);  


  #ifdef FEATURE_QLF
    port_to_use->print(F("QLF: O"));
    if (qlf_active){
      port_to_use->println(F("n"));
    } else {
      port_to_use->println(F("ff"));
    }
  #endif //FEATURE_QLF

  port_to_use->print(F("Quiet Paddle Interrupt: "));
  if (configuration.paddle_interruption_quiet_time_element_lengths > 0){
    port_to_use->println(configuration.paddle_interruption_quiet_time_element_lengths);
  } else {
    port_to_use->println(F("Off"));
  }

  #if !defined(OPTION_EXCLUDE_MILL_MODE)
    port_to_use->print(F("Mill Mode: O"));
    if (configuration.cli_mode == CLI_NORMAL_MODE){
      port_to_use->println(F("ff"));
    } else {
      port_to_use->println(F("n"));
    }
  #endif // !defined(OPTION_EXCLUDE_MILL_MODE)

  port_to_use->print(F("PTT Buffered Character Hold: O"));
  if (configuration.ptt_buffer_hold_active){
    port_to_use->println(F("n"));
  } else {
    port_to_use->println(F("ff"));
  }  

