K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
  uint8_t incoming_serial_byte_buffer[serial_program_memory_buffer_size];
  unsigned int incoming_serial_byte_buffer_size = 0;


  while (looping){
    if (keyer_machine_mode == KEYER_NORMAL) {          // might as well do something while we're waiting
      check_paddles();
      service_dit_dah_buffers();
    }

    while ((port_to_use->available()) && (incoming_serial_byte_buffer_size < serial_program_memory_buffer_size)){  // get serial data if available
      incoming_serial_byte_buffer[incoming_serial_byte_buffer_size] = uppercase(port_to_use->read()); 
      incoming_serial_byte_buffer_size++;
    }

    if (incoming_serial_byte_buffer_size){
      incoming_serial_byte = incoming_serial_byte_buffer[0];
      port_to_use->write(incoming_serial_byte);
      for (unsigned int x = 0;x < (incoming_serial_byte_buffer_size - 1);x++){
        incoming_serial_byte_buffer[x] = incoming_serial_byte_buffer[x+1];
      }
      incoming_serial_byte_buffer_size--;

      if ((memory_1_or_1x_flag) && ((incoming_serial_byte < 48) || (incoming_serial_byte > 57))){  // do we have something other than a number?
        memory_1_or_1x_flag = 0;
        memory_number_entered = 1;
      }

      if (!memory_number_entered) {
        if ((incoming_serial_byte > 47) && (incoming_serial_byte < 58)) {  // do we have a number?
          if (memory_1_or_1x_flag){    // previous byte was a 1, so this is 10-19
            memory_number = incoming_serial_byte - 48 + 10;
            memory_1_or_1x_flag = 0;   // stop collecting bytes
            memory_number_entered = 1;
          } else {
            memory_number = incoming_serial_byte - 48;  // get 0-9.  If 1, it could be 10-19, set flag to check next byte
            if ((memory_number == 1) && (number_of_memories > 9)) {
              memory_1_or_1x_flag = 1;
            } else {
              memory_number_entered = 1;   // single digit, stop collectiing bytes
            }
          }
          // memory number out of range check
          if (memory_number > number_of_memories){
            looping = 0;
            error_flag = 1;
          }
        } else {
          looping = 0;
          error_flag = 1;
        }

      } else {

        if (incoming_serial_byte == 13){  // we got a carriage return
          looping = 0;
          EEPROM.write((memory_start(memory_number-1)+memory_index),255);
        } else {  // looking for memory data
          memory_data_entered = 1;
          #if !defined(OPTION_SAVE_MEMORY_NANOKEYER)
            while ((port_to_use->available()) && (incoming_serial_byte_buffer_size < serial_program_memory_buffer_size)){  // get serial data if available
              incoming_serial_byte_buffer[incoming_serial_byte_buffer_size] = uppercase(port_to_use->read()); 
              incoming_serial_byte_buffer_size++;
            }  
          #endif           
          EEPROM.write((memory_start(memory_number-1)+memory_index),incoming_serial_byte);
          #if !defined(OPTION_SAVE_MEMORY_NANOKEYER)
            while ((port_to_use->available()) && (incoming_serial_byte_buffer_size < serial_program_memory_buffer_size)){  // get serial data if available
              incoming_serial_byte_buffer[incoming_serial_byte_buffer_size] = uppercase(port_to_use->read()); 
              incoming_serial_byte_buffer_size++;
            }   
          #endif              
          #ifdef DEBUG_EEPROM
            debug_serial_port->print(F("serial_program_memory: wrote "));
            debug_serial_port->print(incoming_serial_byte);
            debug_serial_port->print(F(" to location "));
            debug_serial_port->println((memory_start(memory_number-1)+memory_index));
          #endif
          memory_index++;
          if ((memory_start(memory_number-1) + memory_index) > (memory_end(memory_number-1)-2)) {    // are we at last memory location?
            looping = 0;
            EEPROM.write((memory_start(memory_number-1)+memory_index),255);
            port_to_use->println(F("Memory full, truncating."));
          }
        }
      } //
    }
  }

  if ((memory_number_entered) && (memory_data_entered) && (!error_flag)){
    #if defined(HARDWARE_ESP32_DEV)
      EEPROM.commit(); //SP5IOU 20220129
    #endif
    port_to_use->print(F("\n\rWrote memory "));
    port_to_use->println(memory_number);
  } else {
    port_to_use->println(F("\n\rError"));
  }

  #if defined(ARDUINO_SAMD_VARIANT_COMPLIANCE)
    EEPROM.commit();
  #endif

}

#endif


//---------------------------------------------------------------------

#if defined(FEATURE_MEMORIES) && defined(FEATURE_COMMAND_MODE)
void command_program_memory()
{
  int cw_char;
  cw_char = get_cw_input_from_user(0);            // get another cw character from the user to find out which memory number
  #ifdef DEBUG_COMMAND_MODE
  debug_serial_port->print(F("command_program_memory: cw_char: "));
  debug_serial_port->println(cw_char);
  #endif
  if (cw_char > 0) {
    if ((cw_char == 12222) && (number_of_memories > 9)) { // we have a 1, this could be 1 or 1x
      cw_char = get_cw_input_from_user((1200/configuration.wpm)*14);  // give the user some time to enter a second digit
      switch (cw_char) {
        case 0: program_memory(0); break;    // we didn't get anything, it's a 1   
        case 22222: program_memory(9); break; 
        case 12222: program_memory(10); break;
        case 11222: program_memory(11); break;
        case 11122: program_memory(12); break;
        case 11112: program_memory(13); break;
        case 11111: program_memory(14); break;
        case 21111: program_memory(15); break;
        default: send_char('?',KEYER_NORMAL); break;
      }
    } else {    
      switch (cw_char) {
        case 12222: program_memory(0); break;      // 1 = memory 0
        case 11222: program_memory(1); break;
        case 11122: program_memory(2); break;
        case 11112: program_memory(3); break;
        case 11111: program_memory(4); break;
        case 21111: program_memory(5); break;
        case 22111: program_memory(6); break;
        case 22211: program_memory(7); break;
        case 22221: program_memory(8); break;
        //case 22222: program_memory(9); break;
        default: send_char('?',KEYER_NORMAL); break;
      }
    }
  }
}
#endif //FEATURE_COMMAND_MODE

