K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
  //write terminating 255 at end
  #ifdef DEBUG_MEMORY_WRITE
    debug_serial_port->println(F("program_memory: writing memory termination"));
  #endif

  EEPROM.write((memory_start(memory_number) + memory_location_index),255);

  #ifdef OPTION_PROG_MEM_TRIM_TRAILING_SPACES
    for (int x = (memory_location_index-1); x > 0; x--) {
      if (EEPROM.read((memory_start(memory_number) + x)) == 32) {
        EEPROM.write((memory_start(memory_number) + x),255);
      } else {
        x = 0;
      }
    }
  #endif

  #ifdef FEATURE_DISPLAY
    lcd_center_print_timed("Done", LCD_ROWS-2, default_display_msg_delay);
  #endif

  play_memory(memory_number);
}
#endif

//---------------------------------------------------------------------

#ifdef FEATURE_MEMORIES
int memory_start(byte memory_number) {
  return (memory_area_start + (memory_number * ((memory_area_end - memory_area_start) / number_of_memories)));
}
#endif

//---------------------------------------------------------------------

#ifdef FEATURE_MEMORIES
int memory_end(byte memory_number) {
  return (memory_start(memory_number) - 1 + ((memory_area_end - memory_area_start)/number_of_memories));
}
#endif

// used for MCP23017 and COMPASS devices
#if defined (FEATURE_MCP23017_EXPANDER) || defined (FEATURE_COMPASS)
#include <Wire.h>
void initialize_i2c(void) {   
  #ifdef USE_WIRE1 
    Wire1.begin(I2CDEV_SDA_PIN, I2CDEV_SCL_PIN);   // Touch has 1 instance set in library so we get 2nd
  #else
    Wire.begin(I2CDEV_SDA_PIN, I2CDEV_SCL_PIN);   // Touch has 1 instance set in library so we get 2nd
  #endif
}
#endif

#ifdef FEATURE_COMPASS
  //-----------------------------------------------------------
  // Read I2C compass and temperature
  // Use Memory F12 to store declination to present true north.
  //-----------------------------------------------------------
  #include "IST8310.h"
  #include <math.h>
  #include <Wire.h>

  IST8310 ist8310;

    float convert_to_rad(float declination) { 
    debug_serial_port->print("Declination in Rad: "); debug_serial_port->println(declination * (M_PI/180));
    return (declination * (M_PI/180));
  }

  // compute and display the heading info
  void process_compass(bool force_update, bool ignore_dec) {
    static char declination_str[6];
    static  float last_declination = -1.0f;  // -1 to force an update on first run
    int declination_memory_number = DECLINATION_MEMORY-1;
    int x;
    
    // Store declination into the designated memory location (default is 12)
    if (declination != last_declination || force_update) {  // grid or digits changed, store new value
      // See if there is any valid declination info we can use.  Try to use value in config structure. Use config file declination if not blank    
      if (configuration.declination == 0 || force_update) { // find a good data souce in priority order
        //debug_serial_port->print(F("Process Declination for Memory "));debug_serial_port->print(DECLINATION_MEMORY);
        char tmp_dec_str[LCD_COLUMNS] = {};
        int tmp_dec_str_len = read_memory(DECLINATION_MEMORY-1, tmp_dec_str);
        tmp_dec_str[tmp_dec_str_len] = '\0';  // replace the 255 with null
        strupr(tmp_dec_str);

        //debug_serial_port->print(F(" - configuration.declination = ")); debug_serial_port->print(configuration.declination);
        //debug_serial_port->print(F(" - string = ")); debug_serial_port->print(tmp_dec_str); 
        //debug_serial_port->print(F(" - length (20 max!)= ")); debug_serial_port->println(tmp_dec_str_len); 
  
        if (tmp_dec_str_len != 0 || force_update) {  // not an empty memory, check to see if it is a number (X, or x.y)
          float tmp_f = atof(tmp_dec_str);          
          //debug_serial_port->print(F("Memory is not empty, check if string is a valid number = ")); debug_serial_port->println(tmp_f);             
          if (tmp_f != 0) {  // use memoryX
            //debug_serial_port->print(F("Memory has a valid number = ")); debug_serial_port->println(tmp_f);        
            declination = tmp_f;
          } else {  // value is 0 from user
            if (force_update ) {
              declination = 0.0f;
              //debug_serial_port->print(F("Memory is 0.0 entered by user. New declination = ")); debug_serial_port->println(declination);
            } else {  // use default in config
              if (DECLINATION && tmp_dec_str_len == 0) {
                declination = DECLINATION;
                //debug_serial_port->print(F("Memory has an invalid number. Use config file. New declination = ")); debug_serial_port->println(declination);
              } else {
                declination = 0.0f;
                //debug_serial_port->print(F("Memory is set to 0.00. New declination = ")); debug_serial_port->println(declination);
              }
            }
          }
        }  // finished with memory
        configuration.declination = declination;
        config_dirty = 1;
        //debug_serial_port->print(F("Final declination = ")); debug_serial_port->println(declination);
      } else {  // if not a user entered memeory and we have a value in the EEPROM, use it                
        declination = configuration.declination;
        //debug_serial_port->print(F("Declination stored in structure not 0 so use it = ")); debug_serial_port->println(declination);
      }
      sprintf(declination_str, "%3.2f", declination);
      debug_serial_port->print("Declination = ");debug_serial_port->println(declination_str);
      uint8_t dec_len =  strlen(declination_str);
      for (x = 0; x < dec_len; x++) {  // write to memory
        EEPROM.write((memory_start(declination_memory_number)+x), (byte) uppercase(declination_str[x]));
        if ((memory_start(declination_memory_number)+x) == memory_end(declination_memory_number)) {    // are we at last memory location?
          x = dec_len;
        }
      }
      EEPROM.write((memory_start(declination_memory_number)+x),255);   // write terminating 255
      //debug_serial_port->print(F("\nWrote Declination to Keyboard Memory ")); debug_serial_port->println(memory_number+1);
      config_dirty = 1;
      #if defined(HARDWARE_ESP32_DEV)
        EEPROM.commit();
      #endif
      last_declination = declination;
      ist8310.set_declination_offset_radians(convert_to_rad(declination));   // convert in deg min format to rad and apply offset
    }
    update_icons();
  }  // end memories changed

  void initialize_compass() {
    debug_serial_port->println(F("Trying to setup IST8310"));
    #ifdef USE_WIRE1 
      bool success = ist8310.setup(&Wire1, debug_serial_port);
    #else
      bool success = ist8310.setup(&Wire, debug_serial_port);
    #endif
    if (!success) {
        debug_serial_port->println(F("Failed to setup IST8310"));
    }

