K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
    success = ist8310.calibration();
    if (!success) {
        debug_serial_port->println(F("Failed to calibrate IST8310"));
    } else {
      debug_serial_port->println(F("Sucessfully calibrated IST8310"));
    }

    ist8310.set_flip_x_y(false);
    //declination = configuration.declination;
    // +0.2607521902 at Maltby WA (+14deg 58minutes)
    // -0.1887865056 at College Park, MD, USA. This value gets added to the magnetic heading to report the true heading;
    // See http://www.magnetic-declination.com/
    //ist8310.set_declination_offset_radians(convert_to_rad(declination));   // convert in deg min format to rad and apply offset
  }

  void check_compass() {
    static uint32_t last_measure = 0;
    int delay_time = 5000;

    if (update_heading_display_flag)
      delay_time = 500;
    else 
      delay_time = 5000;
    
    if (millis() > last_measure + delay_time) {
      bool success = ist8310.update();
      if (!success)
      {
          debug_serial_port->println(F("Failed to update IST8310"));
      } else {
          //Vec3f* mag_latest_val = ist8310.get_magnetometer();          
          //debug_serial_port->printf("Mag (x, y, z): (%f, %f, %f)\n", mag_latest_val->x, mag_latest_val->y, mag_latest_val->z);
          heading = ist8310.get_heading_degrees();
          //debug_serial_port->printf("Heading: %3.2f degrees (declination = %3.2f)\n", heading, declination);  // 0 degrees at true north (or magnetic north if declination is 0)
          if (update_heading_display_flag) display_heading();
          process_compass(false,false);
      }  
      last_measure = millis(); 
    }
  }
#endif  // FEATURE_COMPASS

// if the compass and tft is enabled, allow button or keyboard to pop up a window to show heading and declination
void display_heading(void) {
  #if defined(FEATURE_COMPASS)
    static char last_heading[LCD_COLUMNS] = {};
    static char last_dec[LCD_COLUMNS] = {};
    char h_str[LCD_COLUMNS];
    
    popup(true);
    lcd.fillRect(SCROLL_BOX_LEFT_SIDE, SCROLL_BOX_TOP, SCROLL_BOX_WIDTH, SCROLL_BOX_HEIGHT, TFT_BLUE);

    sprintf(h_str, "Heading: %3.2f deg", heading);
    strcpy(last_heading, h_str);
    lcd.setFreeFont(TFT_FONT_MEDIUM);
    lcd.setTextColor(TFT_BLACK, TFT_BLACK);
    lcd.drawString(last_heading, 10, 40);
    lcd.setTextColor(TFT_WHITE, TFT_BLUE);                                    
    lcd.drawString(h_str, 10, 40);
    
    sprintf(h_str, "(dec is %3.2f deg)", declination);
    strcpy(last_dec, h_str);
    lcd.setFreeFont(TFT_FONT_MEDIUM);
    lcd.setTextColor(TFT_BLACK, TFT_BLACK);
    lcd.drawString(last_dec, 10, 70);
    lcd.setTextColor(TFT_WHITE, TFT_BLUE);                                    
    lcd.drawString(h_str, 10, 70);

    update_heading_display_flag = true;
  #endif                                  
}

//---------------------------------------------------------------------
// Paddle and Key Interrupt Handlers
/*-----------------------------------------------------------*/

#if defined(HARDWARE_ESP32_DEV) && !defined(FEATURE_MCP23017_EXPANDER)
//---------------------------------------------------------------------
static void IRAM_ATTR left_paddle_intr_handler(void *arg)
{
    paddle_left_state = gpio_get_level((gpio_num_t) paddle_left); 
}

//---------------------------------------------------------------------
static void IRAM_ATTR right_paddle_intr_handler(void *arg)
{
    paddle_right_state = gpio_get_level((gpio_num_t) paddle_right);   
}

//---------------------------------------------------------------------
#ifdef FEATURE_STRAIGHT_KEY
  static void IRAM_ATTR straight_key_intr_handler(void *arg)
  {
      straight_key_state = gpio_get_level((gpio_num_t) pin_straight_key);       
  }
#endif

//---------------------------------------------------------------------
void init_ESP32_GPIO_key_pins(void) {        
    // Setup CPU side GPIO interrupts for paddle pins
    gpio_install_isr_service(0);
    gpio_set_direction((gpio_num_t) paddle_left, GPIO_MODE_INPUT);
    gpio_set_pull_mode((gpio_num_t) paddle_left, GPIO_PULLUP_ONLY);  // no internal pullup on pin 34,35
    gpio_set_intr_type((gpio_num_t) paddle_left, GPIO_INTR_ANYEDGE);
    gpio_isr_handler_add((gpio_num_t) paddle_left, left_paddle_intr_handler, (void *)(gpio_num_t) paddle_left);

    gpio_set_direction((gpio_num_t) paddle_right, GPIO_MODE_INPUT);
    gpio_set_pull_mode((gpio_num_t) paddle_right, GPIO_PULLUP_ONLY);  // no internal pullup on pin 34,35
    gpio_set_intr_type((gpio_num_t) paddle_right, GPIO_INTR_ANYEDGE);
    gpio_isr_handler_add((gpio_num_t) paddle_right, right_paddle_intr_handler, (void *)(gpio_num_t) paddle_right);

    #ifdef FEATURE_STRAIGHT_KEY
      // Setup CPU side GPIO interrupt for straight key 
      gpio_set_direction((gpio_num_t) pin_straight_key, GPIO_MODE_INPUT);
      gpio_set_pull_mode((gpio_num_t) pin_straight_key, GPIO_PULLUP_ONLY);  // no pullup on pin 35
      gpio_set_intr_type((gpio_num_t) pin_straight_key, GPIO_INTR_ANYEDGE);
      gpio_isr_handler_add((gpio_num_t) pin_straight_key, straight_key_intr_handler, (void *)(gpio_num_t) pin_straight_key);
    #endif
    // Now any pin state change will call the handler.
}
#endif

//---------------------------------------------------------------------
#if defined(FEATURE_MCP23017_EXPANDER) && defined(HARDWARE_ESP32_DEV)
#define BIT_PADDLE_LEFT	  ( 1 << 0)
#define BIT_PADDLE_RIGHT	( 1 << 1)    
#define BIT_STRAIGHT_KEY	( 1 << 2)
#include "freertos/FreeRTOS.h"
#include <freertos/event_groups.h>
//------ For Port Expander Only ---------------------------------------------------------------
static void IRAM_ATTR paddle_intr_handler(void *arg)
{
    // On interrupt set bit in event group
    BaseType_t hp_task, xResult;
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    if (xEventGroupSetBitsFromISR(Key_Events,  BIT_PADDLE_LEFT | BIT_PADDLE_RIGHT | BIT_STRAIGHT_KEY, &hp_task) != pdFAIL) {        
      #if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)        
        portYIELD_FROM_ISR(hp_task);
      #else
        portYIELD_FROM_ISR();
      #endif
    }
}

//-------------------------------------------------------------------
IRAM_ATTR void read_io_handler(void *pvParameters)
{
    //EventBits_t e_bits;
    uint8_t bits = 0;
    mydelay(100);
    while (1)
    {
        if (xEventGroupWaitBits(Key_Events, BIT_PADDLE_LEFT | BIT_PADDLE_RIGHT | BIT_STRAIGHT_KEY, pdTRUE, pdFALSE, portMAX_DELAY)) {            
            bits = mcp23017.readPort(MCP23017Port::A);
            paddle_left_state = bits & (1 << paddle_left);  // mask left paddle                                    
            paddle_right_state = bits & (1 << paddle_right);  // mask right paddle                         
            #ifdef FEATURE_STRAIGHT_KEY
                straight_key_state = bits & (1 << pin_straight_key);  // mask right paddle                             
            #endif
            bits = 0x00;
        }
        vTaskDelay(1 / portTICK_PERIOD_MS);
    } 
}

//-------------------------------------------------------------------

  void init_MCP23017(void) {
    BaseType_t xReturned;

