K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
      //     upload 8 charaters to the lcd
      lcd.createChar(0, U_umlaut); //     German
      lcd.createChar(1, O_umlaut); //     German, Swedish
      lcd.createChar(2, A_umlaut); //     German, Swedish 
      lcd.createChar(3, AE_capital); //   Danish, Norwegian
      lcd.createChar(4, OE_capital); //   Danish, Norwegian
      lcd.createChar(5, empty); //        For some reason this one needs to display nothing - otherwise it will display in pauses on serial interface
      lcd.createChar(6, AA_capital); //   Danish, Norwegian, Swedish
      lcd.createChar(7, Ntilde); //       Spanish
      lcd.clear(); // you have to ;o)
    #endif //OPTION_DISPLAY_NON_ENGLISH_EXTENSIONS

    if (LCD_COLUMNS < 9) {
      lcd_center_print_timed("K3NGKeyr", 0, 4000);
    } else {
      #ifdef FEATURE_TFT_DISPLAY  
        lcd.setTextDatum(MC_DATUM);
        lcd.drawString("K3NG Keyer", SCROLL_BOX_CENTER, SCROLL_BOX_ROW1, 4);
        #ifdef FEATURE_BT_KEYBOARD
          lcd.drawString("BT Keyboard Search..", SCROLL_BOX_CENTER, SCROLL_BOX_ROW3, 4);
        #endif
        lcd.drawString("V:" + String(CODE_VERSION), SCROLL_BOX_CENTER, SCROLL_BOX_ROW5, 4);
        mydelay(100);
      #else
        lcd_center_print_timed("K3NG Keyer", 0, 4000);
        lcd_center_print_timed("BT Keyboard Search..", 1, 4000);
        if (LCD_ROWS > 3) lcd_center_print_timed("V:" + String(CODE_VERSION), 3, 4000);      // display the code version on the fourth line of the display
      #endif

      #ifdef OPTION_PERSONALIZED_STARTUP_SCREEN 
        if (LCD_ROWS == 2) {
          lcd_center_print_timed(custom_startup_field, 1, 4000);    // display the custom field on the second line of the display, maximum field length is the number of columns
        } else if (LCD_ROWS > 2) {
          #ifdef FEATURE_TFT_DISPLAY  
            lcd.setTextDatum(MC_DATUM);
            lcd.drawString(custom_startup_field, SCROLL_BOX_CENTER, SCROLL_BOX_ROW4);
            lcd.setTextDatum(MY_DATUM);
          #else
            lcd_center_print_timed("hi", 1, 4000);                    // display 'hi' on the 2nd line anyway
            lcd_center_print_timed(custom_startup_field, 2, 4000);    // display the custom field on the third line of the display, maximum field length is the number of columns
          #endif
	      }
      #endif // OPTION_PERSONALIZED_STARTUP_SCREEN      
    }

    #if defined(FEATURE_WIFI) //SP5IOU 20220129
        mydelay(1000);
        char IPString[18];
        sprintf(IPString, "%03d.%03d.%03d.%03d", configuration.ip[0], configuration.ip[1], configuration.ip[2], configuration.ip[3]);
        lcd_center_print_timed(IPString, 0, 4000);
    #endif //SP5IOU 20220129

  #endif //FEATURE_DISPLAY

  if (keyer_machine_mode != BEACON) {
    #ifndef OPTION_DO_NOT_SAY_HI
      // sound out HI
      // store current setting (compliments of DL2SBA - http://dl2sba.com/ )
      byte oldKey = key_tx;
      byte oldSideTone = configuration.sidetone_mode;
      key_tx = 0;
      configuration.sidetone_mode = SIDETONE_ON;     
      send_char('H',KEYER_NORMAL);
      send_char('I',KEYER_NORMAL);
      configuration.sidetone_mode = oldSideTone;
      key_tx = oldKey;
    #endif //OPTION_DO_NOT_SAY_HI
    #ifdef OPTION_BLINK_HI_ON_PTT
      blink_ptt_dits_and_dahs(".... ..");
    #endif
  }
}

int print_memory(byte memory_number, char *mem_string) {
  #ifdef FEATURE_TOUCH_DISPLAY    
    int i = 0;
    for (int y = (memory_start(memory_number)); (y < memory_end(memory_number)+1); y++) {
      mem_string[i] = (char) EEPROM.read(y);  // read byte    
      if (mem_string[i] == 255 || i > (sizeof(popup_text)-20)) {  // 255 is end of string in EEPROM, return to caller    
        if (i == 0) { // if first byte == 255 then memory is blank
          strcpy(mem_string, "Memory Empty\0");
          return strlen(mem_string);
        }
        mem_string[i] = '\0';  // not blank, return string
        return strlen(mem_string);
      }
      i++;
    }
  #endif
    return 0;
}

void popup_toggle() {  // toggle popup on and off
  #ifdef FEATURE_TFT_DISPLAY
    if (!popup_active)
      popup(true);
    else 
      popup(false);
  #endif
}

void popup(bool show)
{
  #ifdef FEATURE_TFT_DISPLAY 
    if (!show && popup_active) {  // remove popup window unless it is a repeat key
      lcd.fillRect(00, 0, SCROLL_BOX_WIDTH, SCROLL_BOX_HEIGHT, TFT_BLACK);
      lcd.resetViewport();
      lcd.setFreeFont(TFT_FONT_MEDIUM);
      display_scroll_print_char('~');
      popup_active = false;
      update_heading_display_flag = false;
      //debug_serial_port->println(F("popup off"));
      return;
    }
    // draw the popup window and post the text 
    //debug_serial_port->println(F("popup on"));
    lcd.setViewport(SCROLL_BOX_LEFT_SIDE, SCROLL_BOX_TOP, SCROLL_BOX_WIDTH, SCROLL_BOX_HEIGHT);
    popup_active = true;
    lcd.fillRect(0, 0, SCROLL_BOX_WIDTH, SCROLL_BOX_HEIGHT, TFT_BLUE);
    lcd.setTextWrap(true,true);
    lcd.setCursor(10,20);
    lcd.setTextColor(TFT_WHITE, TFT_BLACK);
    lcd.print(popup_text);
    //lcd.fillRect(00, 0, SCROLL_BOX_WIDTH, SCROLL_BOX_HEIGHT, TFT_BLACK);
    //lcd.frameViewport(TFT_GREEN, 3);
    //lcd.setTextColor(TFT_WHITE, TFT_BLACK);
    lcd.setCursor(10,70);
    //lcd.print("1234567890123456789012345678901234567890");
  #endif
}

#ifdef FEATURE_TOUCH_DISPLAY
void refresh_button_row(uint8_t row) {
  lcd.setFreeFont(TFT_FONT_SMALL);
  for (int t=0; t < NUM_KEYS; t++) {
    if (key[t].row == row) {
      if (key[t].hold) {
        //debug_serial_port->print(F("Hold ON ")); debug_serial_port->println(key[t].text_on);
        btn[key[t].btn_idx].p_btn.drawButton(true, key[t].text_on);
      } else {
        //debug_serial_port->print(F("Hold OFF "));debug_serial_port->println(key[t].text_off);
        btn[key[t].btn_idx].p_btn.drawButton(false, key[t].text_off);
      }
    }
  }
  lcd.setFreeFont(TFT_FONT_MEDIUM);
}
#endif

// Create all our button objects.  Some diplays have more space so placement changes.
void create_buttons() {
  #ifdef FEATURE_TOUCH_DISPLAY
    lcd.setFreeFont(TFT_FONT_SMALL);
    //lcd.setLabelDatum(MY_DATUM);
    
    int16_t bh = BUTTON_HEIGHT;
    int16_t bw = BUTTON_WIDTH;
    int16_t br = BUTTON_ROW;
    int16_t br2 = BUTTON_ROW2;
    int16_t ba = 1;  // row start
    #ifdef TOUCH_BUTTON_16
      int16_t bs = bw + 3;  // start of next button left edge
    #else
      int16_t bs = bw + 4;
    #endif

    // All touch displays have at least 5 usable keys and a CW Scroll Box touch zone
    btn[0].p_btn.initButtonUL(&lcd,  ba+(0*bs), br,  bh, bw, TFT_WHITE, TFT_RED, TFT_WHITE, "", 2);  // library modified to ignore text size
    btn[1].p_btn.initButtonUL(&lcd,  ba+(1*bs), br,  bh, bw, TFT_WHITE, TFT_RED, TFT_WHITE, "", 2);  // library modified to ignore text size
    btn[2].p_btn.initButtonUL(&lcd,  ba+(2*bs), br,  bh, bw, TFT_WHITE, TFT_RED, TFT_WHITE, "", 2);  // library modified to ignore text size
    btn[3].p_btn.initButtonUL(&lcd,  ba+(3*bs), br,  bh, bw, TFT_WHITE, TFT_RED, TFT_WHITE, "", 2);  // library modified to ignore text size
    btn[4].p_btn.initButtonUL(&lcd,  ba+(4*bs), br,  bh, bw, TFT_WHITE, TFT_RED, TFT_WHITE, "", 2);  // library modified to ignore text size    
    #ifndef TOUCH_BUTTON_16
    btn[5].p_btn.initButtonUL(&lcd,  SCROLL_BOX_LEFT_SIDE, SCROLL_BOX_TOP, SCROLL_BOX_WIDTH, SCROLL_BOX_HEIGHT, TFT_BLACK, TFT_BLACK, TFT_BLACK, "", 2);  // library modified to ignore text size
    #else
    // These keys are only created if a larger display is used with room for more keys
    btn[5].p_btn.initButtonUL(&lcd,  ba+(5*bs), br,  bh, bw, TFT_WHITE, TFT_RED, TFT_WHITE, "", 2);  // library modified to ignore text size
    btn[6].p_btn.initButtonUL(&lcd,  ba+(6*bs), br,  bh, bw, TFT_WHITE, TFT_RED, TFT_WHITE, "", 2);  // library modified to ignore text size
    btn[7].p_btn.initButtonUL(&lcd,  ba+(7*bs), br,  bh, bw, TFT_WHITE, TFT_RED, TFT_WHITE, "", 2);  // library modified to ignore text size   
    
