K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
    tx_number = configuration.current_tx;
    tx_number++;
    if (tx_number > MAX_TX_PORTS) tx_number = 1; // cycle back to 1   
    switch_to_tx(tx_number);
    if (tx_number != configuration.current_tx) {
      debug_serial_port->println("Configuration Error: No TX_Line or PTT_line defined"); 
    }
    sprintf(tx_msg, "Tx#%1d", configuration.current_tx);
    strcpy(key[key_ID].text_off, tx_msg);
    refresh_button_row(button_row);
  #endif
}

// Processes the button press, looks up the key it is assigned to for the current row
// Pressing the FUNC button increments the button row counter
// The button row counter is reset to 0 if it exceeds the number of button rows.
void process_buttons() { // (uint8_t button_ID) {
  // Process button presses
  #ifdef FEATURE_TOUCH_DISPLAY        
    static int last_button = 0;
    uint16_t key_ID = 254;
    static uint8_t mem_number = 0;

    //debug_serial_port->print(F("button active = ")); debug_serial_port->println(button_active);

    button_active = false; // True if new touch event waiting, reset to false now that we are processing it.

    for (int t = 0; t < NUM_KEYS; t++) {
      if (btn[key[t].btn_idx].p_btn.isPressed() && (key[t].row == button_row || key[t].row == 255))  {  // Only look at current button row keys or CW_BOX
        key_ID = t;  // flag the latest touched button, converted to key #
        //debug_serial_port->print(F("\nKey_ID:")); debug_serial_port->print(key_ID);
        if (btn[key[key_ID].btn_idx].len == 0 || btn[key[key_ID].btn_idx].len == 2) {
          //debug_serial_port->print(F("  Type(NIL=0,S=1,L=2,V=3: ")); debug_serial_port->print(btn[key[key_ID].btn_idx].len); 
          //debug_serial_port->print(F("  Invalid Duration: ")); debug_serial_port->println(btn[key[key_ID].btn_idx].duration);
          return;
        }
        #ifdef DEBUG_KEY
          debug_serial_port->print(F("  Row:" )); debug_serial_port->print(key[key_ID].row);
          debug_serial_port->print(F("  Column:" )); debug_serial_port->print(key[key_ID].btn_idx);
          debug_serial_port->print(F("  Label: ")); debug_serial_port->print(key[key_ID].text_off);
          debug_serial_port->print(F("  Hold: ")); debug_serial_port->print(key[key_ID].hold);
          debug_serial_port->print(F("  Window: ")); debug_serial_port->print(key[key_ID].window);
          debug_serial_port->print(F("  Type(NIL=0,S=1,L=2,V=3: ")); debug_serial_port->print(btn[key[key_ID].btn_idx].len); 
          debug_serial_port->print(F("  Press Duration: ")); debug_serial_port->println(btn[key[key_ID].btn_idx].duration);
        #endif
        btn[key[key_ID].btn_idx].p_btn.press(false);   // reset state after assigning Button_ID        
        break;        
      }      
    }

    // F-Key (always btn_idx == 0) cycles through rows of action buttons - button_row is the top dawg
    // if TOUCH_BUTTON_16 is set then there is only 1 row and Fx keys are not used
    #ifndef TOUCH_BUTTON_16
      if (key[key_ID].btn_idx == 0) {  // F1, F2, F3, etc are always touch btn0
        button_row++;
        if (button_row >= NUM_BUTTON_ROWS) {
          button_row = 0;        
        }
        //debug_serial_port->print("Switch to Row "); debug_serial_port->println(button_row);
        refresh_button_row(button_row);
        return;
      }
    #endif

    // process the action buttons
    switch (key[key_ID].key_event) {
      case BUTTON_PAUSE: pause_btn_toggle_key(key_ID); break;
      
      case BUTTON_WPM_UP: queueadd(PS2_UPARROW); break;  // add char to the queue - WPM Up
      case BUTTON_WPM_DN: queueadd(PS2_DOWNARROW); break;  // add char to the queue - WPM down          

      // Memory related keys
      case BUTTON_MEM_LIST: // This will cycle the memory # each time it is pressed.                   
        list_memory_key(key_ID, mem_number);
        mem_number++;
        if (mem_number >= number_of_memories)
          mem_number = 0;
        break;
      case BUTTON_MEM_1: memX_key(key_ID, 1); break;  // Memory 1
      case BUTTON_MEM_2: memX_key(key_ID, 2); break;  // Memory 2
      case BUTTON_MEM_3: memX_key(key_ID, 3); break;  // Memory 3
      case BUTTON_MEM_4: memX_key(key_ID, 4); break;  // Memory 4
      case BUTTON_MEM_5: memX_key(key_ID, 5); break;  // Memory 5
      case BUTTON_MEM_6: memX_key(key_ID, 6); break;  // Memory 6      
      case BUTTON_MEM_7: memX_key(key_ID, 7); break;  // Memory 7
      case BUTTON_MEM_8: memX_key(key_ID, 8); break;  // Memory 8

      case BUTTON_TX_SELECT:   TX_select_key(key_ID); break;
      case BUTTON_TX_ENABLE:   TX_enable_key(key_ID); break; // TX_enable_key(key_ID); break;
      case BUTTON_TUNE:        queueflush(); queueadd(PS2_T_CTRL); break;  // Toggle TUNE
      case BUTTON_SIDETONE_EN: queueflush(); queueadd(PS2_O_CTRL); break; //  Toggle Sidetone On/Off
      case BUTTON_POPUP_2:     generic_popup_key(key_ID, btn2_text); break;
      case BUTTON_POPUP_3:     generic_popup_key(key_ID, btn3_text); break;

      case CW_BOX:
      default: 
        //debug_serial_port->println(F("Button: CW Box or Default"));
        if (popup_active) popup(false);
        popup_active = false;
        clear_holds_key();    // reset key[].hold for all keys
        mem_number = 0;
        BtnX_active = 0;
        refresh_button_row(button_row);
        queueflush(); queueadd(PS2_ESC);  //  Stop any send in progress, clear buffer                  
        break;
    }      
    last_button = key_ID;  // update last button ID      
  #endif
}

// Detects if a button is pressed and assign a button ID to it.
#if defined(FEATURE_TOUCH_DISPLAY)

  #ifndef USE_TOUCH_TASK
    void check_touch_buttons(void) {
  #else
    void check_touch_buttons(void * pvParameters) {

      /* The parameter value is expected to be 1 as 1 is passed in the
      pvParameters value in the call to xTaskCreate() below. */

      configASSERT( ( ( uint32_t ) pvParameters ) == 1 );

      while (1)
      {
  #endif
        // Check for touch action, determine if they are for a configured button, or something else      
        static uint32_t scanTime = millis();
        static uint32_t tpTime = millis();
        uint32_t duration = 0;
        bool pressed = false; 
        uint16_t threshold = 320;  // 20-1000 pressure level for resistive screen.  TFT_eSPI has a Z param also                                    

          // Scan buttons every 50ms at most
          if (millis() - scanTime >= 50) {  // check every 50ms for any activity
            scanTime = millis();

            #ifdef TOUCH_GT911_BUTTONS          
              tp.read();              
              pressed = tp.isTouched;
              if (pressed) {           
                t_x = tp.points[0].x;
                t_y = tp.points[0].y;  
              }
            #endif
            
            #ifdef FEATURE_TFT_HOSYOND_320x480_LCD              
              //if (xSemaphoreTake (xMutex, portMAX_DELAY)) {  // take the mutex  
              uint16_t threshold = 320;  // 20-1000 pressure level for resistive screen.  TFT_eSPI has a Z param also              
              pressed = lcd.getTouch(&t_x, &t_y, threshold);
              //  xSemaphoreGive (xMutex);  // release the mutex 
              //}
            #endif              
                      
              if (pressed) {              
              //debug_serial_port->printf("GetTouch: x:%d y:%d z:%d\n", t_x, t_y, threshold);
              //button_active = false;     // set active flag if any valid button triggered on       

              for (uint8_t b = 0; b < buttonCount; b++) {
                btn[b].p_btn.press(false);       
                duration = 0;
                btn[b].len = 0;  // 0, 1=short, 2=long, 3=very_long press time duration
                btn[b].duration = 0;    

                if (btn[b].p_btn.contains(t_x, t_y)) {
                  // look for just pressed                  

                  tpTime = millis();
                  while (pressed) {  // measure duration of button press
                    mydelay(20);
                    
                    #ifdef TOUCH_GT911_BUTTONS 
                      tp.read();
                      pressed = tp.isTouched;
                    #endif

                    #ifdef FEATURE_TFT_HOSYOND_320x480_LCD
                      //if (xSemaphoreTake (xMutex, portMAX_DELAY)) {  // take the mutex
                        pressed = lcd.getTouch(&t_x, &t_y, threshold);     
                      //  xSemaphoreGive (xMutex);  // release the mutex  
                      //}               
                    #endif
                    
                    duration += (millis() - tpTime);      // add each touch to total duration            
                    if (duration >= 100 && duration < 1000) {               
                      //debug_serial_port->print(F("*Short duration = ")); debug_serial_port->println(duration);
                      btn[b].len = 1;
                      btn[b].duration = duration;
                    }
                    if (duration >= 1000 && duration < 1800) {  // using medium length zone as a buffer band, not used for keys
                      //debug_serial_port->print(F("**Long duration = ")); debug_serial_port->println(duration);      
                      btn[b].len = 2; 
                      btn[b].duration = duration;                   
                    } 
                    if (duration >= 1800) {
                      //debug_serial_port->print(F("***Very Long duration = ")); debug_serial_port->println(duration);      
                      btn[b].len = 3;
                      btn[b].duration = duration;
                    }
                    if (btn[b].len == 0) 
                      btn[b].duration = duration;
                  }

                  if (btn[b].len == 0) {  // skip - press duration too short or in middle guard band                        
                    btn[b].p_btn.press(false); 
                    break;
                  }
                  btn[b].p_btn.press(true); // record state info for valid button. - process_buttons() will pick up event and add it to the ch queue)
                  button_active = true;     // set active flag if any valid button triggered on                                 
                } else {
                  btn[b].p_btn.press(false); // touch landed outside current button hot spot, set to false
                }                   
              }   // loop through button list and update state for each 
            }   // touched
          }   // end of scan period          
      #ifdef USE_TOUCH_TASK
      mydelay(10);
      } // end of while loop for task mode 
      debug_serial_port->println("Error: Exited Check Buttons Task Loop");
      #endif   
    }
#endif

//-------------------------------------------------------------------------------------------------------
#if defined(OPTION_BLINK_HI_ON_PTT) || (defined(OPTION_WINKEY_BLINK_PTT_ON_HOST_OPEN) && defined(FEATURE_WINKEY_EMULATION))
void blink_ptt_dits_and_dahs(char const * cw_to_send){

  sending_mode = AUTOMATIC_SENDING;

  for (int x = 0;x < strlen(cw_to_send);x++){
    switch(cw_to_send[x]){
      case '.':
        ptt_key();
        mydelay(100);
        ptt_unkey();
        mydelay(100);
        break;
      case '-':
        ptt_key();
        mydelay(300);
        ptt_unkey();
        mydelay(100);
        break;
      case ' ':
        mydelay(400);
        break;        
    }

    #ifdef OPTION_WATCHDOG_TIMER
      wdt_reset();
    #endif  //OPTION_WATCHDOG_TIMER
  }
}
#endif //defined(OPTION_BLINK_HI_ON_PTT) || (defined(OPTION_WINKEY_BLINK_PTT_ON_HOST_OPEN) && defined(FEATURE_WINKEY_EMULATION))

