K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
  return cycles;

}

#endif //FEATURE_CAPACITIVE_PADDLE_PINS

//---------------------------------------------------------------------
#ifdef FEATURE_LED_RING
void update_led_ring(){

  static int last_leds = 0;
  int leds = 0;
  
  

  leds = map(configuration.wpm,led_ring_low_limit,led_ring_high_limit,0,15);
  if (leds < 0){leds = 0;}
  if (leds > 15){leds = 15;}
    
  if (leds != last_leds){ 
    digitalWrite(led_ring_le,LOW);
    
    digitalWrite(led_ring_sdi,LOW);
    digitalWrite(led_ring_clk,HIGH);
    digitalWrite(led_ring_clk,LOW);
    
    
    for (int x = 15;x > 0;x--){
      if (x <= leds){
        digitalWrite(led_ring_sdi,HIGH);
      } else {
        digitalWrite(led_ring_sdi,LOW);
      }
      digitalWrite(led_ring_clk,HIGH);
      digitalWrite(led_ring_clk,LOW);
    }
    
    //shiftOut(led_ring_sdi,led_ring_clk,MSBFIRST,(sequence[y][x] >> 8));    //High byte first
    //shiftOut(led_ring_sdi,led_ring_clk,MSBFIRST,sequence[y][x]);           //Low byte second
    digitalWrite(led_ring_le,HIGH); 
    
    last_leds = leds;
    digitalWrite(led_ring_sdi,LOW);
  }    
        
}
#endif //FEATURE_LED_RING

//---------------------------------------------------------------------
int paddle_pin_read(int pin_to_read) {

  // Updated code provided by Fred, VK2EFL
  // 
  // Note on OPTION_DIRECT_PADDLE_PIN_READS_MEGA, OPTION_DIRECT_PADDLE_PIN_READS_UNO, OPTION_SAVE_MEMORY_NANOKEYER
  // For Mega2560 and Uno/Nano speed up paddle pin reads by direct read of the register
  // it saves about 340 bytes of code too


#if !defined FEATURE_CAPACITIVE_PADDLE_PINS && !defined FEATURE_TOUCH_PADDLE_PINS //SP5IOU 20220131
  #ifndef OPTION_INVERT_PADDLE_PIN_LOGIC
    #ifdef OPTION_DIRECT_PADDLE_PIN_READS_MEGA
        switch (pin_to_read) {
        case 2:  return(bitRead(PINE, 4)); break;           // pins 2 and 5 are the default paddle pins and are placed at the top 
        case 5:  return(bitRead(PINE, 3)); break;           // as the greatest liklihood is that they will be examined first and then we exit
        case 3:  return(bitRead(PINE, 5)); break;           // this should cover cases where board makers are not using the generic pins 2 and 5 for paddle connections
        case 4:  return(bitRead(PING, 5)); break;           // additional case statements are here to provide responses for testing pins other than 2 or 5, in the range 2-13
        case 6:  return(bitRead(PINH, 3)); break;           // this adds a few bytes of code, but a MEGA2560 is not constrained by available flash memory
        case 7:  return(bitRead(PINH, 4)); break;
        case 8:  return(bitRead(PINH, 5)); break;
        case 9:  return(bitRead(PINH, 6)); break;
        case 10: return(bitRead(PINB, 4)); break;
        case 11: return(bitRead(PINB, 5)); break;
        case 12: return(bitRead(PINB, 6)); break;
        case 13: return(bitRead(PINB, 7)); break;
    }                                                     // end switch(pin_to_read)
    #endif                                                  // OPTION_DIRECT_PADDLE_READS_MEGA
    #ifdef OPTION_DIRECT_PADDLE_PIN_READS_UNO
        return (bitRead(PIND, pin_to_read));                  // use this line on Unos and Nanos
    #endif                                                  // OPTION_DIRECT_PADDLE_PIN_READS_UNO
    #ifdef OPTION_SAVE_MEMORY_NANOKEYER                     // 
        switch (pin_to_read) {
        case 2: return(bitRead(PIND, 2)); break;            // code here just in case the nanoKeyer uses pin 2
        case 5: return(bitRead(PIND, 5)); break;            // the nanoKeyer uses pin 5 for the dah paddle
        case 8: return(bitRead(PINB, 0)); break;            // the nanoKeyer uses pin 8 for the dit paddle
        }                                                     // end switch
    #endif                                                  // OPTION_SAVE_MEMORY_NANOKEYER
    #if !defined(OPTION_DIRECT_PADDLE_PIN_READS_UNO) && !defined(OPTION_DIRECT_PADDLE_PIN_READS_MEGA) && !defined(OPTION_SAVE_MEMORY_NANOKEYER)
        #if defined(FEATURE_MCP23017_EXPANDER) || defined(HARDWARE_ESP32_DEV)
            // !OPTION_INVERT_PADDLE_PIN_LOGIC
            if (pin_to_read == paddle_left) {                            
              //debug_serial_port->print(F("Paddle Left  Val = ")); debug_serial_port->println(paddle_left_state);
              return (int) paddle_left_state;
            }
            else {
              //debug_serial_port->print(F("Paddle Right Val = ")); debug_serial_port->println(paddle_right_state);
              return (int) paddle_right_state;
            }
        #else
            return digitalRead((uint8_t) pin_to_read);                      // code using digitalRead
        #endif
    #endif                                                  // !defined(OPTION_DIRECT_PADDLE_PIN_READS_UNO) && !defined(OPTION_DIRECT_PADDLE_PIN_READS_MEGA)
  #else                                               // !OPTION_INVERT_PADDLE_PIN_LOGIC
      #if defined(FEATURE_MCP23017_EXPANDER) || defined(HARDWARE_ESP32_DEV)
            if (pin_to_read == paddle_left) {              
              //debug_serial_port->print(F("Paddle Left  Val = ")); debug_serial_port->println(paddle_left_state);
              return (int) !paddle_left_state;
            }
            else {
              //debug_serial_port->print(F("Paddle Right Val = ")); debug_serial_port->println(paddle_right_state);
              return (int) !paddle_right_state;
            }
      #else
          return !digitalRead(pin_to_read);                       // we do the regular digitalRead() if none of the direct register read options are valid
      #endif
  #endif
#elif defined(FEATURE_CAPACITIVE_PADDLE_PINS)              // FEATURE_CAPACITIVE_PADDLE_PINS
    if (capactive_paddle_pin_inhibit_pin) {
        if (digitalRead(capactive_paddle_pin_inhibit_pin) == HIGH) {
            return digitalRead(pin_to_read);
        }                                                       // end if
    }                                                         // end if (capactive_paddle_pin_inhibit_pin)
    if (read_capacitive_pin(pin_to_read) > capacitance_threshold) return LOW;
    else return HIGH;
#elif defined(FEATURE_TOUCH_PADDLE_PINS) //SP5IOU 20220131
    if (touchRead(pin_to_read) < touch_threshold) return LOW;
    else return HIGH;
#endif                                                      // FEATURE_TOUCH_PADDLE_PINS

  // #ifndef FEATURE_CAPACITIVE_PADDLE_PINS
  //   #ifndef OPTION_INVERT_PADDLE_PIN_LOGIC
  //     #if defined(OPTION_DIRECT_PADDLE_PIN_READS_MEGA)
  //       switch(pin_to_read){
  //         case 2: return(bitRead(PINE,4));break;
  //         case 5: return(bitRead(PINE,3));break;
  //       }
  //     #else //OPTION_DIRECT_PADDLE_READS_MEGA
  //       return digitalRead(pin_to_read);
  //     #endif //OPTION_DIRECT_PADDLE_READS_MEGA
  //   #else 
  //     return !digitalRead(pin_to_read);
  //   #endif
  // #else
  //     if (capactive_paddle_pin_inhibit_pin){ 
  //       if (digitalRead(capactive_paddle_pin_inhibit_pin) == HIGH){
  //         return digitalRead(pin_to_read);
  //       }
  //     }
  //     if (read_capacitive_pin(pin_to_read) > capacitance_threshold) {
  //       return LOW;
  //     } else {
  //       return HIGH;
  //     }
  // #endif //FEATURE_CAPACITIVE_PADDLE_PINS  
}

