K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
//---------------------------------------------------------------------
#ifdef FEATURE_ALPHABET_SEND_PRACTICE
void command_alphabet_send_practice(){

  // contributed by Ryan, KC2ZWM

  int cw_char;
  char letter = 'A';
  
  do
  {
    vTaskDelay(1 / portTICK_PERIOD_MS);
    cw_char = get_cw_input_from_user(0);
    if (letter == (char)(convert_cw_number_to_ascii(cw_char))){  
      if (correct_answer_led) {
        digitalWrite(correct_answer_led, HIGH);
      }
      if (wrong_answer_led) {
        digitalWrite(wrong_answer_led, LOW);
      }      
      beep();

      //send_dit();
      if (letter < 'Z')
        letter++;
      else
        letter = 'A';
    }
    else
    if (cw_char != 9) {
      if (wrong_answer_led) {
        digitalWrite(wrong_answer_led, HIGH);
      }  
      if (correct_answer_led) {
        digitalWrite(correct_answer_led, LOW);
      }          
      boop();
      boop();
      //send_dah();
    }
  } while (cw_char != 9);


  if (correct_answer_led) {
    digitalWrite(correct_answer_led, LOW);
  }
  if (wrong_answer_led) {
    digitalWrite(wrong_answer_led, LOW);
  }      

}
#endif //FEATURE_ALPHABET_SEND_PRACTICE


//---------------------------------------------------------------------
#ifdef FEATURE_PTT_INTERLOCK
void service_ptt_interlock(){

  static unsigned long last_ptt_interlock_check = 0;

  if ((millis() - last_ptt_interlock_check) > ptt_interlock_check_every_ms){
    if (digitalRead(ptt_interlock) == ptt_interlock_active_state){
      if (!ptt_interlock_active){
        ptt_interlock_active = 1;
        #ifdef FEATURE_DISPLAY
          if (LCD_COLUMNS < 9){
            lcd_center_print_timed("PTT Lock",0,2000);
          } else {
            lcd_center_print_timed("PTT Interlock",0,2000);
          }
        #endif //FEATURE_DISPLAY
      }
    } else {
      if (ptt_interlock_active){
        ptt_interlock_active = 0;
      }
    }
    last_ptt_interlock_check = millis();
  }
}
#endif //FEATURE_PTT_INTERLOCK




//---------------------------------------------------------------------

#if defined(OPTION_WINKEY_SEND_BREAKIN_STATUS_BYTE) && defined(FEATURE_WINKEY_EMULATION)
void service_winkey_breakin(){


  if (send_winkey_breakin_byte_flag){
    winkey_port_write(0xc2|winkey_sending|winkey_xoff,0); // 0xc2 - BREAKIN bit set high
    winkey_interrupted = 1;
    send_winkey_breakin_byte_flag = 0;
    #ifdef DEBUG_WINKEY
      debug_serial_port->println(F("service_winkey_breakin: winkey_interrupted = 1"));
    #endif
  }   
   
}
#endif //defined(OPTION_WINKEY_SEND_BREAKIN_STATUS_BYTE) && defined(FEATURE_WINKEY_EMULATION) 

//---------------------------------------------------------------------
#if defined(FEATURE_WIFI) && defined(HARDWARE_ESP32_DEV) //SP5IOU 20220129
boolean wifiConnect(char* ssid = WIFI_SSID, char* password = WIFI_PASSWORD, int attempts = 20) {
#if defined DEBUG_WIFI
    debug_serial_port->print(F("Wifi connecting WiFi"));
#endif    
        WiFi.begin(ssid, password); //begin with credentials from function parameters
    for (int i = 0; (i < attempts) && (WiFi.status() != WL_CONNECTED); i++) {
        mydelay(500);
#if defined DEBUG_WIFI
        debug_serial_port->print(F("."));
#endif    
    }
    if (WiFi.status() == WL_CONNECTED) {
#if defined DEBUG_WIFI
        debug_serial_port->print(F("\nWifi connected to "));
        debug_serial_port->println(WiFi.SSID());
        debug_serial_port->print(F("RSSI: "));
        debug_serial_port->println(WiFi.RSSI());
        debug_serial_port->print(F("IP Adress: "));
        debug_serial_port->println(WiFi.localIP());
        debug_serial_port->print(F("Subnet mask: "));
        debug_serial_port->println(WiFi.subnetMask());
        debug_serial_port->print(F("Dafault gateway address: "));
        debug_serial_port->println(WiFi.gatewayIP());
        debug_serial_port->print(F("DNS address: "));
        debug_serial_port->println(WiFi.dnsIP());
        debug_serial_port->print(F("Interface mac address: "));
        debug_serial_port->println(WiFi.macAddress());
#endif  
        for (int i = 0; i < 4; i++) {
            configuration.ip[i] = WiFi.localIP()[i];
            configuration.gateway[i] = WiFi.gatewayIP()[i];
            configuration.subnet[i] = WiFi.subnetMask()[i];
            configuration.dns_server[i] = WiFi.dnsIP()[i];
        }
 #if defined DEBUG_WIFI
        debug_serial_port->print(F("configuration.ip "));
        debug_serial_port->print(configuration.ip[0]);
        debug_serial_port->print(F("."));
        debug_serial_port->print(configuration.ip[1]);
        debug_serial_port->print(F("."));
        debug_serial_port->print(configuration.ip[2]);
        debug_serial_port->print(F("."));
        debug_serial_port->println(configuration.ip[3]);
        debug_serial_port->print(F("configuration.gateway "));
        debug_serial_port->print(configuration.gateway[0]);
        debug_serial_port->print(F("."));
        debug_serial_port->print(configuration.gateway[1]);
        debug_serial_port->print(F("."));
        debug_serial_port->print(configuration.gateway[2]);
        debug_serial_port->print(F("."));
        debug_serial_port->println(configuration.gateway[3]);
        debug_serial_port->print(F("configuration.subnet "));
        debug_serial_port->print(configuration.subnet[0]);
        debug_serial_port->print(F("."));
        debug_serial_port->print(configuration.subnet[1]);
        debug_serial_port->print(F("."));
        debug_serial_port->print(configuration.subnet[2]);
        debug_serial_port->print(F("."));
        debug_serial_port->println(configuration.subnet[3]);
        debug_serial_port->print(F("configuration.dns_server "));
        debug_serial_port->print(configuration.dns_server[0]);
        debug_serial_port->print(F("."));
        debug_serial_port->print(configuration.dns_server[1]);
        debug_serial_port->print(F("."));
        debug_serial_port->print(configuration.dns_server[2]);
        debug_serial_port->print(F("."));
        debug_serial_port->println(configuration.dns_server[3]);
#endif
        config_dirty = 1;
        return(true);
           }
    else
    {
        for (int i = 0; i < 4; i++) {
            configuration.ip[i] = 0;
            configuration.gateway[i] = 0;
            configuration.subnet[i] = 0;
            configuration.dns_server[i] = WiFi.dnsIP()[i];
        }
        WiFi.disconnect();
#if defined DEBUG_WIFI
        debug_serial_port->print(F("\nWiFi connection failed "));
#endif
        config_dirty = 1;
        return(false);
    }
}
#endif

