K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
                            #ifdef DEBUG_BT_KEYBOARD_C
                                debug_serial_port->print(ch);  // print our valid char
                                debug_serial_port->print(',');
                            #endif
                            /*
                            switch (ch) 
                            {
                                case PS2_RIGHTARROW : adjust_dah_to_dit_ratio(int(configuration.dah_to_dit_ratio/10)); break;
                                case PS2_LEFTARROW : adjust_dah_to_dit_ratio(-1*int(configuration.dah_to_dit_ratio/10)); break;
                                case PS2_UPARROW : speed_set(configuration.wpm+1); break;
                                case PS2_DOWNARROW : speed_set(configuration.wpm-1); break;
                                case PS2_ESC: CMD_KEY = false; debug_serial_port->println(F("< Exiting CLI mode >")); break;
                                case PS2_TAB:
                                    if (pause_sending_buffer) {
                                    pause_sending_buffer = 0;
                                    #ifdef FEATURE_DISPLAY
                                        #ifdef OPTION_MORE_DISPLAY_MSGS
                                        lcd_center_print_timed("Resume", 0, default_display_msg_delay);
                                        #endif
                                    #endif                 
                                    } else {
                                    pause_sending_buffer = 1;
                                    #ifdef FEATURE_DISPLAY
                                        lcd_center_print_timed("Pause", 0, default_display_msg_delay);
                                    #endif            
                                    }
                                break;  // pause
                                default:  break;
                                {
                                    //  process the rest of the keys
                                    if (!CMD_KEY && (((ch != '\\') && (ch >= ' ') && (ch < 127)) || (ch == '\n') || (ch == '\r'))) {
                                        //if (ps2_prosign_flag) {
                                        //    add_to_send_buffer(SERIAL_SEND_BUFFER_PROSIGN);
                                        //    ps2_prosign_flag = 0;
                                        //}
                                        ch = uppercase(ch);
                                        add_to_send_buffer(ch);
                                    
                                        #ifdef FEATURE_MEMORIES
                                            repeat_memory = 255;
                                        #endif
                                    }
                                    else if (CMD_KEY || ch > 126 || ch == '\\') {  // function key and ALT, CTRL, and special keys
                                        debug_serial_port->print(F("< Special key = "));
                                        
                                        if (ch == '\\'){
                                            debug_serial_port->println(F("Command Line Key Pressed.  To exit press ESC key"));
                                            CMD_KEY = true;  // command line interface will need to set this to false to allow CW to resume
                                        }
                                        else {
                                            debug_serial_port->print(ch, DEC);   
                                            debug_serial_port->println(F(" >"));
                                        }
                                    }
                                }  // end of default
                            }  // ens of switch
                            */
  
                            queueadd(ch);   // add char to the queue                          
                            #ifdef DEBUG_BT_KEYBOARD_A
                                debug_serial_port->print(F("["));
                                if (queueempty())
                                    debug_serial_port->print(F("Q Empty\n")); 
                                else
                                    debug_serial_port->print(F("Q NOT Empty\n"));
                                //debug_serial_port->print(queuepop());
                                debug_serial_port->print(F("],"));
                            #endif
                            ch = 0;
                        } // end of key mapping                        
                    }  // end of valid keystroke
                }  // inf size 7 or 8
                last_key = keyDN;
                keyDN = false;
                ch = 0;
          #endif
         mydelay(5); 
        #ifdef USE_BT_TASK
        } // for ever
        #endif
    } // check_bt_keyboard
#endif // FEATURE_BT_KEYBOARD

#ifdef FEATURE_M5STACK_CORE2a
static void m_volume_up(bool)
{
  int v = M5.Speaker.getVolume() + 1;
  if (v < 256) { M5.Speaker.setVolume(v); }
}

static void m_volume_down(bool)
{
  int v = M5.Speaker.getVolume() - 1;
  if (v >= 0) { M5.Speaker.setVolume(v); }
}

void initialize_m5stack_core2() 
{
    M5_LOGE("this is error LOG");
    M5_LOGW("this is warning LOG");
    M5_LOGI("this is info LOG");
    M5_LOGD("this is debug LOG");
    M5_LOGV("this is verbose LOG");

    auto cfg = M5.config();

    #ifdef TEST
    cfg.clear_display = true;  // default=true. clear the screen when begin.
    cfg.output_power  = true;  // default=true. use external port 5V output.
    cfg.internal_imu  = false;  // default=true. use internal IMU.
    cfg.internal_rtc  = true;  // default=true. use internal RTC.
    cfg.internal_spk  = true;  // default=true. use internal speaker.
    cfg.internal_mic  = true;  // default=true. use internal microphone.
    cfg.external_imu  = false;  // default=false. use Unit Accel & Gyro.
    cfg.external_rtc  = false;  // default=false. use Unit RTC.
    cfg.led_brightness = 64;   // default= 0. system LED brightness (0=off / 255=max) (※ not NeoPixel)

    // external speaker setting.
    cfg.external_speaker.module_display = true;  // default=false. use ModuleDisplay AudioOutput
    cfg.external_speaker.hat_spk        = false;  // default=false. use HAT SPK
    cfg.external_speaker.hat_spk2       = false;  // default=false. use HAT SPK2
    cfg.external_speaker.atomic_spk     = false;  // default=false. use ATOMIC SPK
    cfg.external_speaker.atomic_echo    = false;  // default=false. use ATOMIC ECHO BASE
    cfg.external_speaker.module_rca     = false; // default=false. use ModuleRCA AudioOutput

    // external display setting. (Pre-include required)
    cfg.external_display.module_display = true;  // default=true. use ModuleDisplay
    cfg.external_display.atom_display   = false;  // default=true. use AtomDisplay
    cfg.external_display.unit_glass     = false; // default=true. use UnitGLASS
    cfg.external_display.unit_glass2    = false; // default=true. use UnitGLASS2
    cfg.external_display.unit_oled      = false; // default=true. use UnitOLED
    cfg.external_display.unit_mini_oled = false; // default=true. use UnitMiniOLED
    cfg.external_display.unit_lcd       = false; // default=true. use UnitLCD
    cfg.external_display.unit_rca       = false; // default=true. use UnitRCA VideoOutput
    cfg.external_display.module_rca     = false; // default=true. use ModuleRCA VideoOutput
    #endif

