K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
                lcd.drawPixel(x, y, color);
                color += 155;
              }
            }           
          
          // *****************
          #elif defined(CAL_TOUCH) || defined(SET_CAL)
                /*  params are x, x1, y, y1, and rotate=bit0, invertx=bit1, inverty=bit2
                touchCalibration_rotate = parameters[4] & 0x01;
                touchCalibration_invert_x = parameters[4] & 0x02;
                touchCalibration_invert_y = parameters[4] & 0x04;
                */
            uint16_t calibrationData[5] = {TOUCH_X, TOUCH_X1, TOUCH_Y, TOUCH_Y1, TOUCH_BITS};  // My own results are pretty good.
            // can run this to cal at startup.
            #ifdef CAL_TOUCH
              lcd.calibrateTouch(calibrationData, TFT_WHITE, TFT_RED, 15);
            #endif
            //debug_serial_port->printf("Cal data - x:%d x1:%d y:%d y1:%d bits=0x%X\n", calibrationData[0], calibrationData[1], calibrationData[2], calibrationData[3], calibrationData[4]);
            lcd.setTouch(calibrationData);              
          #endif
        #endif
    #endif
    lcd.fillScreen(TFT_BLACK);  
    lcd.setTextDatum(MY_DATUM); // Centre text on x,y position
    // Set up new screen and draw status bar and icons in it
    lcd.setTextColor(TFT_GREY, TFT_BLACK);
    //lcd.setFreeFont(FM9);
    lcd.setTextFont(STATUS_BAR_FONT);  // &fonts::FreeMonoBold12pt7b)
    lcd.drawString("00:00:00", SCROLL_TEXT_LEFT_SIDE-6, STATUS_BAR_X_CURSOR);  
    lcd.setTextColor(TFT_RED);
    lcd.drawRoundRect(0, 0, SCREEN_WIDTH, SCREEN_BOX_HEIGHT, 6, TFT_RED);
    lcd.drawFastHLine(0, SCROLL_BOX_TOP-2, SCREEN_WIDTH, TFT_RED);
    lcd.drawFastHLine(0,SCROLL_BOX_TOP-1, SCREEN_WIDTH, TFT_RED);
    //lcd.setTextWrap(false, false);                         // turn off text wrap, else will overwrite the borders
    lcd.setTextWrap(true, true);                         // turn off text wrap, else will overwrite the borders
    lcd.setTextColor(TFT_WHITE,TFT_BLACK);
    // now updae scroll box area with satus messages and eventually CW text to send
    //lcd.drawCentreString("Searching for BT Keyboard ...", SCREEN_WIDTH/2, SCREEN_HEIGHT/2, 2);
    //lcd.drawString("Searching for BT Keyboard ...", SCROLL_BOX_LEFT_SIDE, SCREEN_HEIGHT/2, 2);
    //mydelay(5000);
    
    //  Some possibly useful draw functions
    //lcd.setAddrWindow(10, 31, 316, 166);
    // Test some print formatting functions
    //float fnumber = 123.45;
    // Set the font colour to be blue with no background, set to font 4
    ////lcd.setTextColor(TFT_BLUE, true);    lcd.setTextFont(4);
    //lcd.print(F("Float = ")); lcd.println(fnumber);           // Print floating point number
    //lcd.print(F("Binary = ")); lcd.println((int)fnumber, BIN); // Print as integer value in binary
    //lcd.print(F("Hexadecimal = ")); lcd.println((int)fnumber, HEX); // Print as integer number in Hexadecimal

    lcd.setCursor(SCROLL_TEXT_LEFT_SIDE, SCROLL_TEXT_TOP_LINE);
    lcd.setTextColor(TFT_WHITE,TFT_BLACK);  
    //lcd.setTextFont(4); //&fonts::FreeMonoBold12pt7b)
    lcd.setTextDatum(MY_DATUM); // Centre text on x,y position
    lcd.setFreeFont(TFT_FONT_MEDIUM);
  }
#endif

#ifdef FEATURE_BT_KEYBOARD
  void BT_Keyboard_Status(void)
  {
        //ToDo: Set up as a periodic scan for reconnect or new keyboard
        if (BT_Keyboard_Lost == true) {
            if (Keyboard_Disconnected_signal) {                
                debug_serial_port->println(F("Lost BT Keyboard Connection"));
                //clear_display_row(1);
                lcd_center_print_timed("Lost Connection", 2, 3000);
                Keyboard_Disconnected_signal = false;
            }
        }
        else{
            if (Keyboard_Connected_signal) {
                lcd_center_print_timed("Keyboard Connected", 2, 3000);
                //clear_display_row(1);
                debug_serial_port->println(F("BT Keyboard Connected"));
                Keyboard_Connected_signal = false;
            }
        }
  }
#endif

#ifdef FEATURE_GPS
// Process NMEA data to extract position an time, calculates grid sqaure
// Using TinyGPSPlus_ESP32 library to get lat, lon and time
// Additional functions to calculate maidenhead grid square

// reverses a string 'str' of length 'len' 
void reverse(char *str, int len) 
{ 
    int i=0, j=len-1, temp; 
    while (i<j) 
    { 
        temp = str[i]; 
        str[i] = str[j]; 
        str[j] = temp; 
        i++; j--; 
    } 
} 

// Converts a given integer x to string str[].  d is the number 
// of digits required in output. If d is more than the number 
// of digits in x, then 0s are added at the beginning. 
int intToStr(int x, char str[], int d) 
{ 
    int i = 0; 
    while (x) 
    { 
        str[i++] = (x%10) + '0'; 
        x = x/10; 
    } 
  
    // If number of digits required is more, then 
    // add 0s at the beginning 
    while (i < d) 
        str[i++] = '0'; 
  
    reverse(str, i); 
    str[i] = '\0'; 
    return i; 
} 

// Converts a floating point number to string. 
void ftoa(float n, char *res, int afterpoint) 
{ 
    // Extract integer part 
    int ipart = (int)n; 
  
    // Extract floating part 
    float fpart = n - (float)ipart; 
  
    // convert integer part to string 
    int i = intToStr(ipart, res, 0); 
  
    // check for display option after point 
    if (afterpoint != 0) 
    { 
        res[i] = '.';  // add dot 
  
        // Get the value of fraction part upto given no. 
        // of points after dot. The third parameter is needed 
        // to handle cases like 233.007 
        fpart = fpart * pow(10, afterpoint); 
  
        intToStr((int)fpart, res + i + 1, afterpoint); 
    } 
}

/*
* The algorithm is fairly straightforward. The scaling array provides divisors to divide up the space into the required number of sections,
* which is 18 for for the field, 10 for the square, 24 for the subsquare, 10 for the extended square, then 24, then 10. 
* The limit is 6 pairs which is 2 more than is used even in the most detailed versions (8 characters in all). 
* The divisor is also used in the fmod function to narrow down the range to the next highest order square that we’re dividing up.
* The scaling array could be precalculated, but I figure the optimizing compiler would take care of that. 
* I also thought the values could be scaled up at the beginning of the function, then use integer arithmetic to do the conversion. 
* It might be a bit faster.
*
*/

