K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
/*
To run it “./geo lat long”, e.g. “./geo 43.999 -79.495” which yields FN03gx09
*/

/*  Parse the GPS NMEA ASCII GPGGA string for the time, latitude and longitude  */

//---------------------------------------------------------------------------------------------------------

int positionToMaidenhead(char m[])
{

    const int pairs=4;
    const double scaling[]={360.,360./18.,(360./18.)/10., \
    ((360./18.)/10.)/24.,(((360./18.)/10.)/24.)/10., \
    ((((360./18.)/10.)/24.)/10.)/24., \
    (((((360./18.)/10.)/24.)/10.)/24.)/10.};
    int i;
    int index;

    for (i=0;i<pairs;i++)
    {
        index = (int)floor(fmod((180.0+p->longitude), scaling[i])/scaling[i+1]); 
        m[i*2] = (i&1) ? 0x30+index : (i&2) ? 0x61+index : 0x41+index;
        index = (int)floor(fmod((90.0+p->latitude), (scaling[i]/2))/(scaling[i+1]/2));
        m[i*2+1] = (i&1) ? 0x30+index : (i&2) ? 0x61+index : 0x41+index;
    }
    m[pairs*2]=0;
    return 1;  // success
}

//  Convert Lat and Lon to MH Grid Sqaure
int Convert_to_MH(void)
{
    char m[9];

   // if(GPS_Status == GPS_STATUS_LOCK_INVALID || msg_Complete == 0)   
   //     return 1;  /* if we are here with invalid data then exit.  LAt and LOnwill have text which cannot be computered of cour     */
    /*  Get from GPS Serial input later */
    p->latitude = gps.location.lat();
    p->longitude = gps.location.lng();

    if (positionToMaidenhead(m))
    {   
        strncpy(grid_sq_str,m,8);
        return 1;  // Success               
    }
    else
    {
        strcpy(grid_sq_str,"");
        return 0; // fail      /*  Can use later to skip displaying anything when have invalid or no GPS input   */
    }
}

#ifdef GPS_TEST
#include "nmea.h"  // has simulated NMEA strings for testing
void displayInfo()
{
  debug_serial_port->print(F("Location: ")); 

  //if (gps.location.isUpdated())
  if (gps.location.isValid())
  {
    Convert_to_MH();
    debug_serial_port->print(F("Grid Square = "));
    debug_serial_port->println(grid_sq_str);
    debug_serial_port->print(gps.location.lat(), 6);
    debug_serial_port->print(F(","));
    debug_serial_port->println(gps.location.lng(), 6);
    debug_serial_port->print(F("LOCATION   Fix Age="));
    debug_serial_port->print(gps.location.age());
    debug_serial_port->print(F("ms Raw Lat="));
    debug_serial_port->print(gps.location.rawLat().negative ? "-" : "+");
    debug_serial_port->print(gps.location.rawLat().deg);
    debug_serial_port->print("[+");
    debug_serial_port->print(gps.location.rawLat().billionths);
    debug_serial_port->print(F(" billionths],  Raw Long="));
    debug_serial_port->print(gps.location.rawLng().negative ? "-" : "+");
    debug_serial_port->print(gps.location.rawLng().deg);
    debug_serial_port->print("[+");
    debug_serial_port->print(gps.location.rawLng().billionths);
    debug_serial_port->print(F(" billionths],  Lat="));
    debug_serial_port->print(gps.location.lat(), 6);
    debug_serial_port->print(F(" Long="));
    debug_serial_port->println(gps.location.lng(), 6);
  }
  else
  {
    debug_serial_port->print(F("INVALID"));
  }

  debug_serial_port->print(F("  Date/Time: "));
  //if (gps.date.isUpdated())
  if (gps.date.isValid())
  {
    debug_serial_port->print(gps.date.month());
    debug_serial_port->print(F("/"));
    debug_serial_port->print(gps.date.day());
    debug_serial_port->print(F("/"));
    debug_serial_port->print(gps.date.year());
  }
  else
  {
    debug_serial_port->print(F("INVALID"));
  }

  debug_serial_port->print(F(" "));
  //if (gps.time.isUpdated())
  if (gps.time.isValid())
  {
    if (gps.time.hour() < 10) debug_serial_port->print(F("0"));
    debug_serial_port->print(gps.time.hour());
    debug_serial_port->print(F(":"));
    if (gps.time.minute() < 10) debug_serial_port->print(F("0"));
    debug_serial_port->print(gps.time.minute());
    debug_serial_port->print(F(":"));
    if (gps.time.second() < 10) debug_serial_port->print(F("0"));
    debug_serial_port->print(gps.time.second());
    debug_serial_port->print(F("."));
    if (gps.time.centisecond() < 10) debug_serial_port->print(F("0"));
    debug_serial_port->print(gps.time.centisecond());
  }
  else
  {
    debug_serial_port->print(F("INVALID"));
  }
  debug_serial_port->println();
}
#endif

#endif  // FEATURE_GPS

void check_gps(bool force_update, bool ignore_gps) {
  #ifdef FEATURE_GPS
    static char last_grid_sq_str[GRIDSQUARE_LEN] = "";
    int memory_number = GRID_MEMORY-1;
    int x;
    static uint32_t lost_gps_timer = 0;

    if (ignore_gps) {
      if (!configuration.ignore_gps) {
        configuration.ignore_gps = true;   // toggle gps usage off
        #ifdef FEATURE_DISPLAY
          lcd_center_print_timed("Toggle GPS OFF", 0, default_display_msg_delay);
        #endif
      } else {
        configuration.ignore_gps = false;  // toggle gps usage back on
        
        if (strlen(configuration.GridSq) != 0)
          strcpy(grid_sq_str, configuration.GridSq);
        else
          strcpy(grid_sq_str, DEFAULT_GRID);
      
        #ifdef FEATURE_DISPLAY
          lcd_center_print_timed("Toggle GPS ON", 0, default_display_msg_delay);        
        #endif
      }
      config_dirty = 1;  // changed ignore_gps in struct memory
      //debug_serial_port->print("Ignore GPS=");debug_serial_port->println(configuration.ignore_gps);
    }   
    uint8_t gps_hour = 0;
    uint8_t gps_minute = 0;
    uint8_t gps_second = 0;  
    
    #ifdef GPS_TEST
      // choose one of the 2 below to simulate NMEA data from either grid square
      //auto gpsStream = gpsStream_EM10;
      auto gpsStream = gpsStream_CN87;

      while (*gpsStream) {
        if (gps.encode(*gpsStream++)) {
          //displayInfo();
          if (gps.location.isValid()) {
            Convert_to_MH();
            debug_serial_port->print(F("Grid Square = "));
            debug_serial_port->println(grid_sq_str);
            stop_msg = false;
          }
        }
      }
    #else
      while (Serial2.available() > 0) {
        //debug_serial_port->print((char) Serial2.read());
        gps.encode(Serial2.read());
        stop_msg = false;
        lost_gps_timer = millis();
      }

