K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
      if (gps.location.isValid() && gps.location.isUpdated()) {
          Convert_to_MH();
          stop_msg = false;
          //debug_serial_port->print(F(" Grid Square = ")); debug_serial_port->println(grid_sq_str);      
      } else {
        if (!gps.location.isValid()) stop_msg = true;
      }
      
      if (gps.time.isValid() && gps.time.isUpdated())
      {
          gps_hour = gps.time.hour();
          gps_minute = gps.time.minute();
          gps_second = gps.time.second();
          sprintf(time_str, "%02d:%02d:%02d", gps_hour, gps_minute, gps_second);
          stop_msg = false;
          //debug_serial_port->println(time_str);        
      } else {
        if (!gps.time.isValid()) stop_msg = true;
      }
    #endif

      if (!stop_msg && (millis() > (lost_gps_timer + 5000))) //&& gps.charsProcessed() < 10)
      {
        debug_serial_port->println(F("No GPS detected: Check wiring."));
        stop_msg = true;
        lost_gps_timer = millis();
      }

    // see if there is any valid gps info we can use.  If not use config grid square if not blank
    if (strlen(grid_sq_str) == 0 || configuration.ignore_gps) { // if no input then allow manually programmed grid to be used, do not overwrite, bail.
      strcpy(configuration.GridSq, ""); // zero out stored grid used for icon row
      return;
    } else {
      strcpy(configuration.GridSq, grid_sq_str);  // store valid GPS grid into EEPROM
    }
  
    if (configuration.grid_digits == 0)
      configuration.grid_digits = 4;
      
    // Store grid square into the designated memory location
    if (strcmp(grid_sq_str, last_grid_sq_str) != 0 || force_update) {  // grid or digits changed, store new value
      strncpy(configuration.GridSq, grid_sq_str, configuration.grid_digits);  // strip down to configured length
      debug_serial_port->print("Grid=");debug_serial_port->println(configuration.GridSq);

      for (x = 0; x < configuration.grid_digits; x++) {  // write to memory
        EEPROM.write((memory_start(memory_number)+x), (byte) uppercase(configuration.GridSq[x]));
        if ((memory_start(memory_number)+x) == memory_end(memory_number)) {    // are we at last memory location?
          x = configuration.grid_digits;
        }
      }
      EEPROM.write((memory_start(memory_number)+x),255);   // write terminating 255
      debug_serial_port->print(F("\nWrote GPS Location to Keyboard Memory ")); debug_serial_port->println(memory_number+1);
      strcpy(last_grid_sq_str, grid_sq_str);
      config_dirty = 1;
      #if defined(HARDWARE_ESP32_DEV)
        EEPROM.commit();
      #endif
      update_icons();
      beep();
    }
  #endif
}  // end check_GPS

void setup_esp()
{
    static bool setup_called = false;
    
    if (setup_called) return;  // for main.ino co-existance
    setup_called = true;
    
    initialize_serial_ports();        // Goody - this is available for testing startup issues  
    #if defined (FEATURE_MCP23017_EXPANDER) || defined (FEATURE_COMPASS)
      initialize_i2c();
    #endif
    initialize_pins();
    initialize_display();
    create_buttons();
    update_icons();
    // initialize_debug_startup();       // Goody - this is available for testing startup issues
    // debug_blink();                    // Goody - this is available for testing startup issues
    initialize_keyer_state();
    initialize_potentiometer();
    initialize_rotary_encoder();
    initialize_default_modes();
    initialize_watchdog();
    initialize_ethernet_variables();
    #if defined(DEBUG_EEPROM_READ_SETTINGS)
        initialize_serial_ports();
    #endif
    check_eeprom_for_initialization();
    check_for_beacon_mode();
    check_for_debug_modes();
    initialize_analog_button_array();
    #if defined(DEBUG_EEPROM_READ_SETTINGS)
        initialize_serial_ports();
    #endif 
    initialize_ps2_keyboard();
    initialize_usb();
    initialize_cw_keyboard();
    initialize_bt_keyboard();
    #if defined(FEATURE_WIFI) && defined(HARDWARE_ESP32_DEV) //SP5IOU 20220129
        wifiConnect(configuration.wifissid,configuration.wifipassword);
    #endif
    initialize_ethernet();
    initialize_udp();
    initialize_web_server();
    initialize_sd_card();  
    initialize_debug_startup();
    #ifdef FEATURE_GPS
      pinMode(GPS_RX_PIN, INPUT);
      Serial2.begin(GPS_BAUD_RATE, SERIAL_8N1, GPS_RX_PIN, -1, GPS_SERIAL_INVERT);
    #endif
    #ifdef FEATURE_COMPASS
      initialize_compass();  //  ist8310 compass
    #endif
}

//#define USE_TASK     // for main program in a task

#ifdef USE_TASK
void main_loop(void * pvParameters )
{
  /* The parameter value is expected to be 1 as 1 is passed in the
    pvParameters value in the call to xTaskCreate() below. */

  configASSERT( ( ( uint32_t ) pvParameters ) == 1 );
  for( ;; ) {
 #else
void main_loop(void) 
{
  if (1) {
  #endif
    #ifdef OPTION_WATCHDOG_TIMER
      wdt_reset();
    #endif  //OPTION_WATCHDOG_TIMER
    //if (xSemaphoreTake (xMutex, portMAX_DELAY)) {  // take the mutex
      #if defined(FEATURE_BEACON) && defined(FEATURE_MEMORIES)
        if (keyer_machine_mode == BEACON) {
            vTaskDelay(1 / portTICK_PERIOD_MS);                                                                 // an odd duration delay before we enter BEACON mode
            #ifdef OPTION_BEACON_MODE_MEMORY_REPEAT_TIME
                unsigned int time_to_delay = configuration.memory_repeat_time - configuration.ptt_tail_time[configuration.current_tx - 1];
            #endif                                                                        // OPTION_BEACON_MODE_MEMORY_REPEAT_TIME

            while (keyer_machine_mode == BEACON) {                                        // if we're in beacon mode, just keep playing memory 1
                vTaskDelay(1 / portTICK_PERIOD_MS);
                if (!send_buffer_bytes) {
                    add_to_send_buffer(SERIAL_SEND_BUFFER_MEMORY_NUMBER);
                    add_to_send_buffer(0);
                }
                service_send_buffer(PRINTCHAR);
                #ifdef OPTION_BEACON_MODE_PTT_TAIL_TIME
                    mydelay(configuration.ptt_tail_time[configuration.current_tx - 1]);         // after memory 1 has played, this holds the PTT line active for the ptt tail time of the current tx
                    check_ptt_tail();                                                         // this resets things so that the ptt line will go high during the next playout
                    digitalWrite (configuration.current_ptt_line, ptt_line_inactive_state);   // forces the ptt line of the current tx to be inactive
                #endif                                                                      // OPTION_BEACON_MODE_PTT_TAIL_TIME

                #ifdef FEATURE_SERIAL
                    check_serial();
                #endif

                #ifdef OPTION_WATCHDOG_TIMER
                    wdt_reset();
                #endif                                                                      // OPTION_WATCHDOG_TIMER

